[
  {
    "id": "Core.16.1.1",
    "category": "Transplant Anesthesia",
    "subcategory": "Heart and lung transplant issues",
    "difficulty": "medium",
    "questionText": "A 56-year-old man, 3 months after bilateral lung transplant for idiopathic pulmonary fibrosis, presents for urgent bronchoscopy due to progressive dyspnea and monophonic expiratory wheeze. CT demonstrates severe focal narrowing (≈5 mm lumen) at the right main bronchial anastomosis, and spirometry shows a flattened expiratory limb consistent with variable intrathoracic obstruction. On room air, SpO2 is 92% and improves to 96% with CPAP 8 cm H2O. An arterial blood gas on CPAP reveals PaCO<sub>2</sub> 52 mm Hg and PaO<sup>2</sup> 70 mm Hg. The thoracic surgeon plans dilation and possible stent placement via rigid bronchoscopy.\n\nWhich of the following is the most appropriate anesthetic plan to optimize safety during induction and airway control in this patient?",
    "answers": [
      {
        "text": "IV induction and placement of a left-sided double-lumen tube to ventilate the left lung while the surgeon treats the right airway",
        "isCorrect": false,
        "explanation": "Loss of airway tone with IV induction can worsen dynamic collapse; a DLT complicates shared-airway access and does not address the fixed/dynamic right-sided obstruction."
      },
      {
        "text": "Inhalational induction maintaining spontaneous ventilation with CPAP, with the surgeon scrubbed and a rigid bronchoscope and jet ventilator immediately available; avoid neuromuscular blockade until the rigid scope is placed",
        "isCorrect": true,
        "explanation": "Maintaining spontaneous ventilation preserves airway tone and CPAP splints malacic segments; immediate availability of rigid bronchoscopy and HFJV is essential for safe dilation/stenting of post-transplant anastomotic disease."
      },
      {
        "text": "Rapid-sequence induction with succinylcholine and placement of an 8.0-mm ETT to allow flexible bronchoscopy through the tube",
        "isCorrect": false,
        "explanation": "Paralysis removes airway tone and can precipitate dynamic collapse in tracheobronchomalacia; a standard ETT and flexible scope may not traverse or stabilize a tight anastomotic stenosis."
      },
      {
        "text": "Prophylactic veno-venous ECMO cannulation prior to induction to prevent hypoxemia during airway manipulation",
        "isCorrect": false,
        "explanation": "ECMO is reserved for near-complete obstruction or refractory gas-exchange failure; this stable patient can be managed with rigid bronchoscopy and appropriate anesthetic technique."
      },
      {
        "text": "Awake fiberoptic intubation with advancement of a 7.0-mm ETT into the right mainstem bronchus to bypass the stenosis",
        "isCorrect": false,
        "explanation": "The stenosis is at the right main bronchial anastomosis, so advancing an ETT into the right mainstem is unlikely feasible and risks trauma/worsening obstruction."
      }
    ],
    "didactic": "Post–lung transplant airway complications are common early after surgery due to ischemia of the bronchial anastomosis (bronchial arteries are typically not reanastomosed) and denervation. Problems include anastomotic stenosis and tracheobronchomalacia, which present with dyspnea, monophonic wheeze, positional symptoms, and a flow–volume loop showing a flattened expiratory limb (variable intrathoracic obstruction).\n\nFor significant post-transplant stenosis/malacia requiring dilation or stenting, the safest approach is to maintain spontaneous ventilation during induction. Loss of airway smooth muscle tone with general anesthesia and neuromuscular blockade can exacerbate dynamic collapse. Applying CPAP or $P_{EEP}$ can splint malacic airways by increasing $P_{aw}$ and reducing the transmural pressure gradient during expiration. Rigid bronchoscopy is preferred because it both stabilizes the airway and provides a large working channel for dilation/stent placement and ventilation (eg, high-frequency jet ventilation) via the side port. Flexible bronchoscopy through an ETT is typically inadequate for tight anastomotic lesions and does not stent the airway.\n\nKey preparation points:\n- Have the surgeon scrubbed with a rigid bronchoscope and jet ventilator immediately available; consider smaller ETTs only if needed as a bridge.\n- Maintain spontaneous ventilation for induction; delay neuromuscular blockade until the rigid scope secures the airway.\n- Use CPAP/$P_{EEP}$ to mitigate dynamic collapse; titrate $F_{IO_2}$ to the lowest compatible with oxygenation if thermal ablation is planned (airway fire risk).\n- Plan rescue strategies (eg, returning to mask ventilation with CPAP, rigid scope ventilation); reserve ECMO for near-complete obstruction or refractory hypoxemia.\n\nAnticipating stenosis/malacia and preparing for rigid bronchoscopy support reduces the risk of a \"can’t ventilate\" scenario in these patients.",
    "educationalObjective": "Anticipate airway complications (stenosis, malacia) post–lung transplant and prepare for rigid bronchoscopy support."
  }
]
