[
  {
    "id": "Core.6.1.1",
    "category": "General Anesthesia & Postop",
    "subcategory": "Awareness and depth monitoring",
    "difficulty": "medium",
    "questionText": "A 62-year-old man (ASA II) is undergoing laparoscopic cholecystectomy with a circle system at 1 L/min fresh gas flow. Maintenance: sevoflurane dial 2.0% with end-tidal sevoflurane 1.2% (age-adjusted ≈0.9 MAC) and remifentanil 0.05 mcg/kg/min. BIS has been 50–55. After pneumoperitoneum, MAP falls to 55 mm Hg and you give ephedrine 10 mg IV. Two minutes later, HR rises from 65 to 85 bpm and MAP increases to 75 mm Hg. End-tidal sevoflurane decreases from 1.2% to 0.9% and BIS increases to 68.\n\nWhich of the following is the most appropriate immediate action to maintain anesthetic depth after the ephedrine-induced hemodynamic change?",
    "answers": [
      {
        "text": "Increase the sevoflurane vaporizer to restore the end-tidal concentration to the pre-pressor value",
        "isCorrect": true,
        "explanation": "Ephedrine increases cardiac output and volatile uptake, lowering alveolar/end-tidal concentration and lightening anesthesia. Increasing the dial to reestablish the prior end-tidal MAC maintains depth despite the hemodynamic change."
      },
      {
        "text": "Administer another 10 mg of ephedrine to further support MAP without changing anesthetic delivery",
        "isCorrect": false,
        "explanation": "Additional ephedrine will further increase cardiac output and uptake of volatile, likely reducing end-tidal anesthetic even more and worsening the risk of awareness; it treats MAP but not anesthetic depth."
      },
      {
        "text": "Increase fresh gas flow to 6 L/min while keeping the vaporizer setting unchanged",
        "isCorrect": false,
        "explanation": "Raising FGF may speed inspired–alveolar equilibration but does not increase inspired concentration beyond the dialed value; with increased uptake from higher cardiac output, end-tidal anesthetic will remain low unless the dial is increased."
      },
      {
        "text": "Give a propofol bolus (0.5 mg/kg) to deepen anesthesia without altering the volatile",
        "isCorrect": false,
        "explanation": "A propofol bolus transiently deepens anesthesia but risks recurrent hypotension in this context and does not address the sustained reduction in end-tidal volatile from increased uptake."
      },
      {
        "text": "Reduce the remifentanil infusion by 50% to avoid synergistic hypotension with volatile anesthesia",
        "isCorrect": false,
        "explanation": "Reducing opioid lightens anesthesia and may increase awareness risk; hypotension has already improved. The key problem is decreased end-tidal volatile from increased uptake, best treated by restoring end-tidal MAC."
      }
    ],
    "didactic": "Vasopressors can change anesthetic depth indirectly by altering cardiac output and thus volatile uptake. Volatile uptake is roughly proportional to blood–gas solubility and cardiac output: Uptake ∝ λ·Q·(P_A−P_V); when Q (cardiac output) increases (e.g., after ephedrine), uptake increases and alveolar/end-tidal partial pressure falls, lightening anesthesia at a fixed dial setting. Conversely, decreased cardiac output (e.g., with phenylephrine in some patients) can raise end-tidal concentration and deepen volatile anesthesia. Practical rule: after ephedrine, anticipate a drop in end-tidal agent and increase the vaporizer to maintain age-adjusted end-tidal MAC; after phenylephrine, avoid turning down anesthetic solely because BIS falls, as reduced cerebral blood flow can lower EEG indices without adequate anesthetic. End-tidal MAC (age-adjusted) is a more reliable depth target than raw BIS when hemodynamics change. Always reassess analgesia and ventilation, but prevent inadvertent awareness by maintaining the intended end-tidal anesthetic concentration.",
    "educationalObjective": "Adjust anesthetic plan when vasopressors are used to treat hypotension so depth is not inadvertently reduced."
  },
  {
    "id": "Core.6.1.2",
    "category": "General Anesthesia & Postop",
    "subcategory": "Awareness and depth monitoring",
    "difficulty": "hard",
    "questionText": "A 28-year-old G1P0 at 39 weeks with peripartum cardiomyopathy (EF 25%) requires a crash cesarean delivery for persistent fetal bradycardia. After RSI with etomidate 0.2 mg/kg and rocuronium 1.2 mg/kg, she is ventilated with 100% O2 on a circle system. Two minutes after skin incision, BP is 88/46 mm Hg, HR 112/min, SpO2 100%, ETCO2 32 mm Hg. She is on a phenylephrine infusion at 50 mcg/min. End-tidal sevoflurane is 0.6% (pregnancy MAC ≈ 1.4%, so MAC fraction ≈ 0.6/1.4 ≈ 0.43). BIS is 78 with TOF 0/4. The obstetrician anticipates delivery in ~2 minutes. You want to reduce the risk of awareness without worsening maternal hemodynamics or fetal oxygenation.\n\nWhich immediate intervention is most appropriate?",
    "answers": [
      {
        "text": "Administer ketamine 0.5 mg/kg IV bolus",
        "isCorrect": true,
        "explanation": "Adds amnesia and analgesia via NMDA antagonism while providing sympathomimetic support, typically improving or preserving BP and CO. At this low dose before delivery, neonatal depression is minimal and preferable to large volatile increases or benzodiazepines in a hemodynamically fragile, hypoxic-risk setting."
      },
      {
        "text": "Increase end-tidal sevoflurane to 1.2% immediately",
        "isCorrect": false,
        "explanation": "Raising to ~0.85 MAC in pregnancy would deepen anesthesia but risks precipitous vasodilation, hypotension, and uterine relaxation in a patient already at BP 88/46 mm Hg, jeopardizing maternal CO and uteroplacental perfusion."
      },
      {
        "text": "Start 50% N2O to supplement volatile",
        "isCorrect": false,
        "explanation": "Although 50% N2O contributes ~0.5 MAC-equivalents, it reduces FiO2 from 1.0 during fetal compromise and offers limited amnesia at subanesthetic doses. Oxygen delivery to the fetus takes precedence before delivery."
      },
      {
        "text": "Give midazolam 2 mg IV now",
        "isCorrect": false,
        "explanation": "Benzodiazepines can cause maternal hypotension and neonatal respiratory depression; they are typically deferred until after delivery. They also do not address the immediate hemodynamic instability."
      },
      {
        "text": "Increase phenylephrine to 100 mcg/min and raise sevoflurane to 0.9%",
        "isCorrect": false,
        "explanation": "While this could permit slightly more volatile, further afterload increase in severe LV dysfunction (EF 25%) may reduce stroke volume and uteroplacental perfusion. It is slower and less reliable than ketamine for promptly achieving amnesia without compromising hemodynamics."
      }
    ],
    "didactic": "Awareness risk is elevated during obstetric GA because volatile is often held at ≤0.5 MAC before delivery to avoid hypotension and maintain uteroplacental perfusion. Quantitatively, MAC in pregnancy is reduced by ~30%, so the MAC fraction can be estimated by $\\text{MAC}_{\\text{fraction}}=\\tfrac{\\text{Et agent}}{\\text{MAC}_{\\text{preg}}}$ (e.g., sevo 0.6%/1.4%≈0.43). Processed EEG (e.g., BIS) can help, but ensure low EMG artifact (adequate NMB) when interpreting; here, TOF 0/4 and BIS 78 strongly suggest light anesthesia. Ketamine 0.3–0.5 mg/kg is a high-yield adjunct in crash cesarean with hemodynamic instability: it provides amnesia and analgesia with sympathetic support, avoids reducing FiO2, and typically has minimal neonatal impact at low dose. Avoid large volatile increases pre-delivery in unstable patients and avoid N2O when fetal oxygenation is at risk. After delivery, deepen with volatile to ≥0.7–1.0 MAC as tolerated, add opioids/benzodiazepines, and manage uterine tone with uterotonics while titrating vasopressors to maintain MAP and uteroplacental perfusion.",
    "educationalObjective": "Balance light anesthesia risks against hemodynamic goals in high-risk obstetric or cardiac cases."
  },
  {
    "id": "Core.6.1.3",
    "category": "General Anesthesia & Postop",
    "subcategory": "Awareness and depth monitoring",
    "difficulty": "medium",
    "questionText": "A 47-year-old woman (ASA II) undergoes laparoscopic cholecystectomy under general anesthesia with rocuronium. Intraoperatively she had brief hypotension near incision, during which end-tidal sevoflurane was reduced to ~0.6 MAC and phenylephrine was given; processed EEG (BIS) was 55–60. Thirty minutes in the PACU, she tearfully reports hearing staff, feeling pain, and being unable to move for “a few minutes” during surgery. Vitals are stable; she is anxious and asks, “Did I wake up during my operation?”\n\nWhich is the most appropriate immediate action in the PACU to address her report and reduce the risk of persistent psychological harm?",
    "answers": [
      {
        "text": "Conduct a structured Brice interview using non-leading questions; validate her distress, document details (timing, sensations, paralysis), and arrange follow-up within 24–72 hours and again at 2–4 weeks with an offer of psychological support.",
        "isCorrect": true,
        "explanation": "A structured, empathetic Brice interview is the recommended immediate response to suspected intraoperative awareness. It both elicits reliable details for evaluation and initiates early support and scheduled follow-up, which mitigates risk of persistent anxiety/PTSD."
      },
      {
        "text": "Administer midazolam now to induce amnesia and reassure her that the memory will likely disappear.",
        "isCorrect": false,
        "explanation": "Benzodiazepines provide anterograde, not reliable retrograde, amnesia; giving midazolam does not erase established memories and may cloud assessment."
      },
      {
        "text": "Reassure her that dreams under anesthesia are common and avoid further discussion to prevent reinforcing the memory.",
        "isCorrect": false,
        "explanation": "Minimizing or deflecting discourages disclosure and delays support; early, structured exploration reduces distress and improves outcomes."
      },
      {
        "text": "Defer discussion and immediately file an incident report and call risk management; plan to discuss it at her routine surgical follow-up.",
        "isCorrect": false,
        "explanation": "Systems reporting is important but should not precede an immediate, compassionate, structured interview in the PACU and timely follow-up arrangements."
      },
      {
        "text": "Explain that with BIS <60 awareness is essentially impossible and order processed EEG for future cases.",
        "isCorrect": false,
        "explanation": "Processed EEG reduces but does not eliminate awareness risk; overreliance can invalidate a credible report and undermines patient trust."
      }
    ],
    "didactic": "Suspected intraoperative awareness with recall (AAGA) warrants an immediate, structured, and empathetic interview. The Brice interview uses non-leading prompts: (1) last thing remembered before going to sleep, (2) first thing remembered after waking, (3) any recall in between, (4) whether dreams occurred, and (5) the worst part of the experience. Validate the patient’s distress, avoid minimizing language, and document specifics (timing cues, sounds, pain, paralysis, dyspnea) that can later be correlated with end-tidal anesthetic, neuromuscular blockade, hemodynamics, and processed EEG. Arrange follow-up contact within 24–72 hours and again at 2–4 weeks, and offer psychological support (e.g., counseling), as some patients develop persistent anxiety or PTSD. Benzodiazepines do not reliably produce retrograde amnesia and should not be used to “erase” memories. While monitors like BIS may reduce risk, awareness can occur despite BIS <60, particularly with neuromuscular blockade and light anesthesia. In addition to caring for the patient, perform internal review and reporting after the initial interview to improve systems and future care.",
    "educationalObjective": "Conduct a structured postoperative interview for reported awareness and arrange follow-up and support."
  },
  {
    "id": "Core.6.1.4",
    "category": "General Anesthesia & Postop",
    "subcategory": "Awareness and depth monitoring",
    "difficulty": "hard",
    "questionText": "A 62-year-old man is undergoing posterior lumbar fusion with intraoperative neurophysiologic monitoring. Anesthesia is maintained with propofol and remifentanil TIVA via a syringe pump connected to a left forearm IV through a three-way stopcock that also delivered crystalloid and perioperative antibiotics. An NIBP cuff cycles every 3 minutes on the left upper arm. After turning prone, you relieve your colleague at a handoff; vitals are stable and processed EEG is ~40. You plan to continue TIVA for another 4 hours. Which action at this handoff most effectively reduces the risk of unintentional interruption of TIVA and intraoperative awareness?\n",
    "answers": [
      {
        "text": "Move the NIBP cuff to the right arm and lengthen the cycling interval to 10 minutes.",
        "isCorrect": false,
        "explanation": "Relocating the cuff may reduce brief occlusion-related pressure spikes in the TIVA line, but it does not address the higher-risk failure modes (shared line, backflow/siphon, disconnections). Extending the interval can compromise blood pressure vigilance without preventing TIVA interruption."
      },
      {
        "text": "Increase both propofol and remifentanil targets by 25% to compensate for possible intermittent delivery.",
        "isCorrect": false,
        "explanation": "Increasing dose cannot overcome mechanical interruptions (occlusion, disconnection, empty syringe) and raises the risk of hypotension/bradycardia. The primary hazard is delivery failure, not underdosing per se."
      },
      {
        "text": "Reconfigure to a dedicated TIVA IV separate from all other infusions, place anti-siphon and back-check valves near the pump, and perform a full pump/line trace, label, alarm, and remaining-volume check with the outgoing provider.",
        "isCorrect": true,
        "explanation": "A safeguard bundle specifically targets TIVA failure modes: a dedicated line avoids dilution and stopcock errors; anti-siphon/back-check valves prevent free-flow, backflow, and inadvertent bolus; and a structured handoff (trace-to-patient, verify settings/alarms, confirm patency and syringe volume) mitigates disconnections and empty-syringe awareness."
      },
      {
        "text": "Run a pressurized crystalloid carrier at 100 mL/h through the same stopcock to ensure forward flow of TIVA.",
        "isCorrect": false,
        "explanation": "A carrier infusion can dilute TIVA, mask infiltration, and does not prevent stopcock misposition or cuff-induced occlusion; it may also create backflow and bolus risks when started/stopped. It is inferior to a dedicated, valved TIVA line."
      },
      {
        "text": "Lower the syringe pump below patient level to reduce the chance of siphoning or free-flow.",
        "isCorrect": false,
        "explanation": "Pump height alone is unreliable; hydrostatic effects ($\\Delta P = \\rho g h$; ~7.4 mm Hg per 10 cm) can unpredictably favor either backflow or free-flow depending on circuit geometry. Anti-siphon and check valves, not device height, are the appropriate safeguards."
      }
    ],
    "didactic": "TIVA’s main hazard is delivery failure: even brief interruptions from an empty syringe, closed/incorrect stopcock, shared-line dilution, BP-cuff occlusion, disconnection, or siphoning can cause awareness. A high-reliability approach is a safeguard bundle: use a dedicated IV for hypnotic/opioid infusions (no piggybacks), add an anti-siphon valve near the syringe to prevent free-flow with downstream negative pressure, and a back-check valve to prevent retrograde flow or dilution from carrier fluids. At every handoff or after repositioning, perform a structured pump-and-line check: trace line to patient, confirm patency/infiltration, verify pump program and alarms, and check remaining volume to prevent run-dry events. Avoid sharing the TIVA line with antibiotics, blood, or pressurized carriers; these introduce backflow/bolus and stopcock-error risks. BP cuffs on the TIVA limb can intermittently occlude delivery; moving the cuff helps, but it is not a substitute for a dedicated, valved circuit. Remember basic hydrostatics ($\\Delta P = \\rho g h$; ~0.74 mm Hg per cm height difference): rely on valves, not gravity, to control flow. Processed EEG can supplement but does not replace mechanical safeguards against delivery failure.",
    "educationalObjective": "Implement TIVA-specific safeguards: dedicated IV line, anti-siphon valves, and pump and line checks at handoffs."
  },
  {
    "id": "Core.6.1.5",
    "category": "General Anesthesia & Postop",
    "subcategory": "Awareness and depth monitoring",
    "difficulty": "medium",
    "questionText": "A 65-year-old man with ischemic cardiomyopathy (EF 25%) undergoes on-pump CABG at 32 °C. Shortly after initiating cardiopulmonary bypass, the sevoflurane vaporizer fails and the oxygenator lacks a volatile agent delivery module. The anesthetic is converted to TIVA with propofol at 60 mcg/kg/min and remifentanil at 0.05 mcg/kg/min; deep neuromuscular blockade is maintained. The surgeon requests a $MAP$ of 50–55 mm Hg, supported with phenylephrine. A processed EEG monitor is available in the room but has not been applied. Which of the following changes would most reduce this patient’s risk of intraoperative awareness?",
    "answers": [
      {
        "text": "Apply a processed EEG monitor and titrate propofol to maintain $BIS$ 40–60",
        "isCorrect": true,
        "explanation": "TIVA without end-tidal anesthetic monitoring is a major risk for awareness; adding processed EEG and titrating hypnosis to a $BIS$ target (≈40–60) reduces awareness in high-risk patients, especially during CPB when volatile monitoring is unavailable."
      },
      {
        "text": "Increase phenylephrine to maintain $MAP$ > 75 mm Hg during CPB",
        "isCorrect": false,
        "explanation": "Hypotension is associated with awareness largely because anesthetic doses are reduced to preserve blood pressure; raising $MAP$ alone does not ensure adequate hypnosis and may prompt further lightening of anesthesia (misconception: blood pressure equals depth of anesthesia)."
      },
      {
        "text": "Increase remifentanil to 0.2 mcg/kg/min while keeping propofol unchanged",
        "isCorrect": false,
        "explanation": "Opioids blunt sympathetic responses but are unreliable for amnesia or hypnosis; escalating opioid without increasing hypnotic dose does not mitigate recall risk (misconception: analgesia equals unconsciousness)."
      },
      {
        "text": "Substitute 70% $N_2O$ for air to augment anesthesia",
        "isCorrect": false,
        "explanation": "$N_2O$ is a weak hypnotic, generally avoided in cardiac/CPB, and does not reliably prevent awareness when used with low-dose hypnotic (misconception: $N_2O$ provides dependable amnesia at common concentrations)."
      },
      {
        "text": "Discontinue neuromuscular blockade to allow movement if anesthesia is light",
        "isCorrect": false,
        "explanation": "Allowing movement reveals inadequate depth but does not reduce the risk of recall and compromises surgical conditions and safety (misconception: movement is an acceptable surrogate to prevent awareness)."
      }
    ],
    "didactic": "Awareness with recall occurs in about 0.1–0.2% of general anesthetics, but risk is higher in cardiac surgery and emergency obstetrics (≈0.4–1% or more). Major risk factors include TIVA without reliable depth monitoring, hemodynamic instability that prompts dose reduction, cardiac surgery (especially on CPB), and obstetric GA where volatiles may be minimized. When inhaled agents are used, targeting an age-adjusted end-tidal $MAC$ fraction ≥0.7–0.8 markedly reduces awareness; on TIVA, use processed EEG and titrate hypnosis to $BIS$ 40–60. Neuromuscular blockade masks motor signs and increases unrecognized awareness; opioids provide analgesia but do not ensure amnesia. In high-risk settings, ensure a dedicated amnestic/hypnotic (e.g., adequate propofol or volatile), avoid relying on opioids alone, and document/communicate risk. $N_2O$ has limited hypnotic effect and is generally avoided in cardiac/CPB; it does not substitute for adequate hypnotic dosing. Practical rule: volatile case → watch end-tidal $MAC$; TIVA/CPB → watch processed EEG.",
    "educationalObjective": "List major risk factors for intraoperative awareness (TIVA without monitoring, hemodynamic instability, obstetrics, cardiac)."
  },
  {
    "id": "Core.6.1.6",
    "category": "General Anesthesia & Postop",
    "subcategory": "Awareness and depth monitoring",
    "difficulty": "medium",
    "questionText": "A 62-year-old woman (BMI 28) undergoes laparoscopic cholecystectomy under general anesthesia. Induction is with fentanyl, propofol, and rocuronium; maintenance is sevoflurane in O2/air at 1 L/min fresh gas flow. Five minutes after pneumoperitoneum and just before trocar placement, her HR increases from 70 to 102 bpm and BP from 120/70 to 162/88 mm Hg. TOF is 0/4. The anesthesia machine shows end‑tidal sevoflurane 0.7% and \"MAC 0.4\" (not age-adjusted). Processed EEG (BIS) reads 55. No N2O is used. Which intervention best reduces the patient’s risk of intraoperative awareness at this point?\n",
    "answers": [
      {
        "text": "Increase the sevoflurane vaporizer and transiently raise FGF to 6–8 L/min to achieve an age‑adjusted end‑tidal MAC ≥ 0.7 before allowing incision",
        "isCorrect": true,
        "explanation": "End‑tidal agent closely reflects brain partial pressure; targeting age‑adjusted $\\text{MAC}\\,\\ge 0.7$ reduces awareness risk, especially with neuromuscular blockade. Temporarily increasing FGF speeds the rise in end‑tidal concentration (shorter time constant), achieving the target promptly."
      },
      {
        "text": "Administer 100 mcg fentanyl to blunt the sympathetic response and proceed without changing the volatile",
        "isCorrect": false,
        "explanation": "Opioids attenuate nociception and hemodynamics but do not ensure amnesia. With ET sevo ~0.4 age‑adjusted MAC, the hypnotic component is inadequate and awareness risk remains."
      },
      {
        "text": "Give an additional 20 mg rocuronium to prevent movement with trocar entry",
        "isCorrect": false,
        "explanation": "Neuromuscular blockade prevents movement but does not provide hypnosis or amnesia; it can mask clinical signs and increase the risk of unrecognized awareness."
      },
      {
        "text": "Rely on the BIS of 55 as evidence of adequate hypnosis and make no changes",
        "isCorrect": false,
        "explanation": "Processed EEG can be confounded by EMG and neuromuscular blockade; BIS may appear acceptable despite inadequate ET volatile. A low ET MAC (<0.7 age‑adjusted) with sympathetic activation warrants increasing volatile."
      },
      {
        "text": "Increase fresh gas flow to 6 L/min while keeping the vaporizer setting unchanged to speed delivery",
        "isCorrect": false,
        "explanation": "Higher FGF accelerates alveolar uptake but will only approach the (still too low) dialed concentration; without increasing the vaporizer to a higher target, ET MAC will remain below the amnestic threshold."
      }
    ],
    "didactic": "End‑tidal anesthetic concentration (ETAC) is a practical surrogate for brain partial pressure; targeting an age‑adjusted $\\text{MAC}\\,\\ge 0.7$ significantly reduces awareness risk, particularly when neuromuscular blockers are used. MAC decreases with age (≈6% per decade after 40), so age adjustment is essential; for sevoflurane, $\\text{MAC}_{age}\\approx \\text{MAC}_{40}\\times(1-0.06\\times\\text{decades over 40})$. In low‑flow anesthesia, the time constant for raising alveolar concentration is $\\tau \\approx \\dfrac{\\text{circuit volume}}{\\text{FGF}}$; briefly increasing FGF (e.g., 6–8 L/min) shortens $\\tau$ and hastens ETAC to the new target. Hemodynamic signs (tachycardia/hypertension) suggest inadequate anesthetic during stimulation but are not specific; however, when coupled with low ET MAC they should prompt increasing volatile. Opioids treat nociception, not amnesia; neuromuscular blockade masks movement and can increase unrecognized awareness. Processed EEG can help but is imperfect (NMB lowers EMG and can artifactually reduce indices), so prioritize ETAC and clinical context. When multiple agents are used, total MAC is approximately additive: $\\text{MAC}_{total}=\\sum \\text{MAC fractions}$, and maintaining $\\ge 0.7$ age‑adjusted MAC is a practical rule of thumb to prevent awareness.",
    "educationalObjective": "Prevent awareness with end-tidal agent monitoring targeting age-adjusted MAC and attention to clinical signs."
  },
  {
    "id": "Core.6.1.7",
    "category": "General Anesthesia & Postop",
    "subcategory": "Awareness and depth monitoring",
    "difficulty": "hard",
    "questionText": "A 62-year-old man (BMI 29) is 30 minutes into a laparoscopic colectomy under balanced general anesthesia with ET sevoflurane 0.9 age-adjusted MAC, $N_2O$ 50%, and fentanyl infusion. Neuromuscular monitoring at the adductor pollicis shows TOF 3/4 (TOF ratio ≈ 0.4) and no recent redosing of rocuronium since induction. During periods of monopolar electrocautery, the processed EEG index (BIS) abruptly rises from 45–50 to 78–85, the EMG indicator spikes, and the signal quality index drops; when cautery stops, BIS returns to the mid-40s. Hemodynamics remain stable (MAP 72 mm Hg, HR 68 bpm), pupils are 2 mm, and a lower-body forced-air warmer is in use. To ensure accurate interpretation of hypnotic depth, which is the most appropriate next step?\n\n",
    "answers": [
      {
        "text": "Administer a small rocuronium bolus (e.g., 10 mg) and reassess the BIS during a cautery-free interval before adjusting anesthetic dosing.",
        "isCorrect": true,
        "explanation": "High EMG activity and poor signal quality during cautery indicate artifact contaminating the EEG. Additional neuromuscular blockade suppresses frontalis EMG (reducing spuriously high BIS) without changing hypnosis; reassessing during a cautery-free interval improves reliability before altering hypnotic depth."
      },
      {
        "text": "Increase sevoflurane to 1.3 MAC to prevent intraoperative awareness suggested by BIS values in the 80s.",
        "isCorrect": false,
        "explanation": "Treating the number risks hypotension and ignores that the BIS rise occurs with cautery, low SQI, and high EMG. With ET sevo 0.9 MAC plus $N_2O$ 50% (≈0.5 MAC), the combined anesthetic is already ≈1.4 MAC, and stable vitals argue against light hypnosis."
      },
      {
        "text": "Stop $N_2O$ and give an opioid bolus to lower the BIS into the 40–60 range.",
        "isCorrect": false,
        "explanation": "$N_2O$ and opioids have limited, inconsistent effects on EEG-derived indices; opioids mainly reduce nociception, not cortical hypnosis. This does not address EMG/cautery artifact causing the spurious BIS elevation."
      },
      {
        "text": "Replace the BIS sensor and move the forced-air warmer away from the head to eliminate likely hardware artifact.",
        "isCorrect": false,
        "explanation": "Faulty sensors and head warming can contribute to artifact, but here the BIS increases track electrocautery with concurrent high EMG and low SQI, then normalize when cautery stops—pointing to EMG/electrical interference rather than a defective sensor or warming-related artifact."
      },
      {
        "text": "Administer esmolol to blunt sympathetic responses while maintaining the current anesthetic plan.",
        "isCorrect": false,
        "explanation": "Hemodynamics are already stable and esmolol would not correct EMG or electrocautery interference. Beta-blockade may mask physiologic signs without improving the accuracy of EEG depth monitoring."
      }
    ],
    "didactic": "EEG-based depth monitors (e.g., BIS, PSI) are vulnerable to artifacts from frontalis EMG and electrical interference—classically monopolar electrocautery. EMG contributes high-frequency power that can spuriously increase the index; incomplete neuromuscular blockade (facial muscles recover early) often elevates EMG. A key rule: act on trends only when signal quality is high and artifact indicators are low; interpret values during cautery-free intervals. Neuromuscular blockers can lower BIS by reducing EMG without changing the hypnotic state, so redose NMB to improve signal fidelity, then reassess before changing hypnotic dosing. $N_2O$ and opioids minimally affect cortical EEG indices; thus a balanced anesthetic may be adequately deep even when BIS is insensitive to analgesia or $N_2O$. MAC fractions are roughly additive (e.g., ET sevo 0.9 MAC + $N_2O$ 50% ≈ 0.5 MAC → ≈1.4 MAC), and stable hemodynamics further argue against light anesthesia. Avoid treating the number in isolation; first mitigate artifact (EMG/cautery), then integrate EEG with clinical signs and age-adjusted MAC.",
    "educationalObjective": "Recognize artifacts and confounders in depth monitors (NMB, electrocautery, EMG) and avoid misinterpretation."
  },
  {
    "id": "Core.6.1.8",
    "category": "General Anesthesia & Postop",
    "subcategory": "Awareness and depth monitoring",
    "difficulty": "medium",
    "questionText": "A 58-year-old man (BMI 29) undergoing laparoscopic cholecystectomy under general anesthesia becomes tachycardic (70 → 110 bpm) and hypertensive (120/70 → 165/95 mm Hg) during dissection. He is paralyzed with rocuronium. Current settings: sevoflurane in air/O2 at fresh gas flow 1 L/min, vaporizer 1.0%, fentanyl 150 µg given at induction 45 minutes ago. Capnography and ventilation are normal. Processed EEG (BIS) rises from 45 to 75 with increased EMG activity. End-tidal sevoflurane is 0.6% with displayed end-tidal MAC = 0.3 (age-adjusted). You suspect inadequate anesthetic depth with possible awareness.\n\nWhich of the following is the most appropriate immediate action?",
    "answers": [
      {
        "text": "Administer propofol 0.8 mg/kg IV and increase sevoflurane to rapidly achieve end-tidal MAC ≥ 1.0",
        "isCorrect": true,
        "explanation": "An IV hypnotic bolus provides immediate amnesia/hypnosis, and turning up the vaporizer promptly restores adequate end-tidal anesthetic (target ET MAC ≈ 0.8–1.2 for surgical anesthesia, age-adjusted). This directly treats the cause of sympathetic activation and mitigates risk of awareness."
      },
      {
        "text": "Administer midazolam 2 mg IV and continue the current anesthetic settings",
        "isCorrect": false,
        "explanation": "Benzodiazepines provide anterograde amnesia but are too slow and unreliable as sole therapy for active awareness; leaving hypnotic/analgesic depth unchanged risks continued awareness."
      },
      {
        "text": "Administer fentanyl 2 µg/kg IV as the only intervention",
        "isCorrect": false,
        "explanation": "Opioid blunts nociception but does not reliably produce hypnosis or amnesia; analgesia alone may improve vital signs while allowing awareness to persist."
      },
      {
        "text": "Treat hypertension with esmolol 20–30 mg IV and give additional rocuronium",
        "isCorrect": false,
        "explanation": "Beta-blockade and deeper paralysis may mask signs without correcting inadequate hypnosis, increasing the risk of awareness in a paralyzed patient."
      },
      {
        "text": "Increase fresh gas flow to 6 L/min only and reassess in 5 minutes",
        "isCorrect": false,
        "explanation": "Raising FGF speeds alveolar concentration changes ($\\tau = \\tfrac{V}{\\text{FGF}}$) but, without increasing the vaporizer and providing immediate hypnosis, the patient remains at a sub-MAC end-tidal concentration during intense stimulation."
      }
    ],
    "didactic": "Suspected intraoperative awareness requires immediate deepening of hypnosis: give a rapid-acting IV hypnotic (e.g., propofol 0.5–1 mg/kg) and increase the volatile to raise end-tidal anesthetic to an age-adjusted surgical range (roughly ET MAC 0.8–1.2). Provide analgesia (e.g., fentanyl 1–2 µg/kg or a short-acting infusion) and avoid treating vital signs with beta-blockers alone, which can mask awareness. Consider increasing fresh gas flow (e.g., to 6–10 L/min) to speed alveolar concentration changes, remembering $\\tau = \\tfrac{V}{\\text{FGF}}$; then titrate the vaporizer to achieve the target ET MAC. If neuromuscular blockade is not essential, reduce or pause it to allow movement as a safety signal; speak reassuringly to the patient. Benzodiazepines (e.g., midazolam 0.02–0.04 mg/kg) can be given to promote anterograde amnesia but should not delay definitive deepening of anesthesia. After stabilization, document the event, check equipment and recorded end-tidal agent values, debrief the team, and conduct a postoperative structured interview with follow-up and referral if recall is reported.",
    "educationalObjective": "Respond to suspected awareness intraoperatively with amnestic/analgesic dosing and documentation."
  },
  {
    "id": "Core.6.1.9",
    "category": "General Anesthesia & Postop",
    "subcategory": "Awareness and depth monitoring",
    "difficulty": "medium",
    "questionText": "A 58-year-old man (BMI 29) is undergoing laparoscopic cholecystectomy with total intravenous anesthesia: propofol (target-controlled infusion) and remifentanil. Rocuronium was administered for paralysis. Forty-five minutes into the case, with pneumoperitoneum in place, the blood pressure is 120/70 mm Hg, HR 65/min, EtCO2 34 mm Hg, and SpO2 100%. The BIS, previously 50–55, increases to 78. The BIS display shows a high EMG bar, Signal Quality Index 95%, and good electrode impedance. There is no electrocautery at this moment, and a forced-air warmer is on the lower body. Peripheral nerve stimulation at the adductor pollicis shows 0/4 TOF. You confirm both infusions are running and the IV lines are patent.\n\nWhich action is most appropriate to address the cause of the elevated BIS in this situation?",
    "answers": [
      {
        "text": "Inspect the raw EEG/EMG trace and reduce facial EMG artifact (e.g., administer a small rocuronium bolus if paralysis is indicated) before changing hypnotic dosing.",
        "isCorrect": true,
        "explanation": "A sudden BIS rise with a high EMG indicator and good signal quality most likely reflects EMG contamination from frontalis/corrugator activity. Facial muscles are less sensitive and recover earlier than the adductor pollicis; thus EMG can persist despite 0/4 TOF at the hand. Reviewing the raw EEG/EMG and treating EMG (including additional NMB if clinically indicated) addresses the artifact before altering hypnotic depth."
      },
      {
        "text": "Increase the propofol infusion by 50% to drive the BIS below 60.",
        "isCorrect": false,
        "explanation": "This assumes the elevated BIS reflects inadequate hypnosis. However, the high EMG indicator with excellent signal quality strongly suggests artifact; increasing hypnotic without addressing EMG risks unnecessary deepening and hypotension."
      },
      {
        "text": "Add $50\\%$ N2O to reduce awareness risk while maintaining hemodynamics.",
        "isCorrect": false,
        "explanation": "N2O has minimal effect on BIS and adds little hypnotic in the presence of propofol/remifentanil; it would not correct EMG-driven BIS elevation and may increase PONV."
      },
      {
        "text": "Discontinue remifentanil, which falsely elevates BIS values.",
        "isCorrect": false,
        "explanation": "Opioids do not artifactually elevate BIS; if anything, they reduce responses to surgical stimulation with modest effects on processed EEG indices. The elevated BIS here is better explained by EMG contamination."
      },
      {
        "text": "Remove the BIS because neuromuscular blockade makes processed EEG unreliable.",
        "isCorrect": false,
        "explanation": "BIS remains useful under NMB, though EMG reduction can lower BIS independent of hypnosis. The issue here is excess EMG inflating BIS; removing the monitor forfeits potentially valuable information and does not address the artifact."
      }
    ],
    "didactic": "Processed EEG indices (e.g., BIS) are composites that trend with cortical hypnotic state; values near $40$–$60$ generally align with surgical hypnosis, while $>70$ suggests lighter states. A key limitation is contamination by frontalis/corrugator EMG, which can falsely elevate BIS despite adequate hypnosis. Neuromuscular blockade is not anesthetic but decreases EMG, often lowering BIS without changing cortical state; thus a BIS decrease after NMB does not prove deeper anesthesia. Facial muscles (corrugator supercilii) are less sensitive to NMB and recover earlier than the adductor pollicis, so 0/4 TOF at the hand does not guarantee absent facial EMG. Best practice: confirm infusion integrity (especially during TIVA), assess the Signal Quality Index, review the raw EEG for alpha/spindle patterns vs EMG, and address EMG artifact (optimize electrodes, reduce stimulation, consider NMB if indicated) before adjusting hypnotic dosing. Agents such as ketamine and artifacts like electrocautery or warming systems can also alter processed indices without reflecting true hypnotic depth; always interpret BIS in clinical context and trends rather than a single number.",
    "educationalObjective": "Use processed EEG (e.g., BIS) appropriately, understanding what values represent and common limitations."
  },
  {
    "id": "Core.6.2.1",
    "category": "General Anesthesia & Postop",
    "subcategory": "Emergence and extubation",
    "difficulty": "medium",
    "questionText": "A 38-year-old man undergoes endoscopic sinus surgery with oral endotracheal intubation and a pharyngeal throat pack. After 2 hours, the surgeon reports hemostasis is \"adequate\" and is ready for emergence. Vital signs are stable on FiO2 0.5 and the patient is breathing intermittently with pressure support. You note oozing blood in the oropharynx, a partially clogged Yankauer, and uncertainty about whether the throat pack was removed. Neuromuscular blockade has been fully reversed. To minimize aspiration and extubation-related airway complications, which action is most appropriate before extubation?",
    "answers": [
      {
        "text": "Coordinate with the surgeon to confirm and visually verify throat pack removal, obtain a second functioning suction, perform laryngoscopy to clear the hypopharynx under direct vision, and proceed to fully awake extubation once the airway is clear.",
        "isCorrect": true,
        "explanation": "This approach establishes a shared plan, ensures pack removal, and uses two working suctions to clear blood under direct vision. Extubating fully awake with intact protective reflexes minimizes aspiration and obstruction risk in a bloody airway."
      },
      {
        "text": "Perform a deep extubation to reduce coughing and potential bleeding from the surgical site.",
        "isCorrect": false,
        "explanation": "Deep extubation in the presence of blood increases risk of silent aspiration, laryngospasm, and airway obstruction. Cough suppression does not outweigh the risk of an uncleared airway."
      },
      {
        "text": "Insert an orogastric tube to decompress the stomach, blindly suction the oral cavity, and extubate promptly.",
        "isCorrect": false,
        "explanation": "Gastric decompression does not address pooled blood in the pharynx, and blind suction may miss hypopharyngeal collections; prompt extubation without direct visualization increases aspiration risk."
      },
      {
        "text": "Place the patient in Trendelenburg, apply 100% O2, and extubate after ensuring adequate spontaneous ventilation.",
        "isCorrect": false,
        "explanation": "Trendelenburg can worsen venous oozing and promotes pooling of secretions above the glottis; oxygenation and ventilation do not mitigate the need to clear and inspect the airway."
      },
      {
        "text": "Check for a cuff leak to assess airway edema, then extubate if a leak is present.",
        "isCorrect": false,
        "explanation": "A cuff leak evaluates edema, not the presence of blood or retained packing. It does not address aspiration risk from a contaminated upper airway."
      }
    ],
    "didactic": "At emergence from ENT cases, especially with throat packs and mucosal bleeding, aspiration and airway obstruction are key risks. A shared plan with the surgeon should explicitly confirm throat pack removal, followed by direct visualization and thorough suctioning of the oropharynx/hypopharynx; using two functioning suctions (e.g., Yankauer plus flexible catheter) reduces clogging and speeds clearance. Extubation should occur when the airway is clear and the patient is fully awake with intact protective reflexes, unless there is a compelling reason to remain intubated. Deep extubation may limit coughing but is unsafe when blood is present. Positioning alone (e.g., Trendelenburg) or tests like the cuff-leak do not substitute for airway toilet. Practical tips: announce a “pack out and suction” pause, have backup suction ready, consider laryngoscopy to inspect and clear the hypopharynx, and extubate in a lateral or head-up position once criteria are met.",
    "educationalObjective": "Address airway bleeding or surgical packing at emergence with shared plan and suction readiness."
  },
  {
    "id": "Core.6.2.2",
    "category": "General Anesthesia & Postop",
    "subcategory": "Emergence and extubation",
    "difficulty": "medium",
    "questionText": "A 56-year-old man (BMI 31) undergoes a 7-hour anterior cervical discectomy and fusion (C4–C7) with prolonged retraction. He received 3.2 L crystalloid and has mild facial swelling at the end of the case. He is warm, follows commands, and has been fully reversed from neuromuscular blockade. On VC ventilation with Vt 450 mL, RR 12, and PEEP 5 cm H2O, you perform a cuff leak test after oropharyngeal suctioning:\n\n- With the cuff inflated, average exhaled Vt = 450 mL\n- With the cuff deflated, average exhaled Vt = 410 mL\n\nYou calculate $V_{leak} = V_{T,exh}^{inflated} - V_{T,exh}^{deflated} = 450 - 410 = 40\\ \\text{mL}$ (≈9% of set Vt). Based on these findings and the surgical context, what is the best next step to minimize the risk of post-extubation airway obstruction?",
    "answers": [
      {
        "text": "Delay extubation, administer IV dexamethasone, elevate the head of bed, and re-evaluate the cuff leak in 2–4 hours in a monitored setting",
        "isCorrect": true,
        "explanation": "A cuff leak <110 mL or <10–15% of Vt suggests clinically significant laryngeal edema and a high risk of post-extubation obstruction. The safest strategy is to defer extubation, give steroids (e.g., dexamethasone 8–10 mg IV), optimize positioning (head-up), and reassess the cuff leak after edema has improved."
      },
      {
        "text": "Proceed with extubation and administer racemic epinephrine if stridor develops",
        "isCorrect": false,
        "explanation": "Treating obstruction after extubation does not mitigate the initial risk of failure and may lead to a can’t ventilate/can’t intubate scenario. Prophylactic racemic epinephrine is short-lived and not a substitute for deferring extubation when the cuff leak is markedly reduced."
      },
      {
        "text": "Extubate over an airway exchange catheter to facilitate rapid reintubation",
        "isCorrect": false,
        "explanation": "An airway exchange catheter may aid reintubation but does not prevent critical obstruction from edema. When the cuff leak is very low, the priority is to avoid extubation until the airway is safer rather than planning for rescue."
      },
      {
        "text": "Increase PEEP to 10 cm H2O and repeat the cuff leak test; if the leak exceeds 10%, extubate",
        "isCorrect": false,
        "explanation": "Altering PEEP changes trans-laryngeal pressures and can mask a clinically significant leak, making the test unreliable. Standard technique uses low/zero PEEP and consistent settings to avoid false reassurance."
      },
      {
        "text": "Switch to pressure support and rely on an audible leak to decide on extubation",
        "isCorrect": false,
        "explanation": "Qualitative, auscultation-based leak assessment is less reliable than quantitative measurements and is influenced by ventilator mode and patient effort. A low measured leak in a high-risk surgical context warrants delaying extubation, not proceeding based on a subjective audible leak."
      }
    ],
    "didactic": "The cuff leak test estimates the space available around the deflated cuff to infer laryngeal edema. A common approach is to measure the difference in average exhaled tidal volume with the cuff inflated versus deflated on VC ventilation with low PEEP: $V_{leak}=V_{T,exh}^{inflated}-V_{T,exh}^{deflated}$. Thresholds associated with higher risk of post-extubation obstruction are typically $<110$ mL or <$10$–$15\\%$ of Vt. Standardize the test: suction the oropharynx, use VC with stable settings, and keep PEEP low (≤5 cm H2O) to avoid false negatives. In high-risk scenarios (prolonged intubation, airway/neck surgery, large fluid load), a low leak should prompt delaying extubation, administering IV steroids (e.g., dexamethasone 4–10 mg, ideally ≥4 hours before planned extubation), head-up positioning, and reassessment. Airway exchange catheters and racemic epinephrine are adjuncts if extubation must proceed, but neither prevents obstruction when edema is significant. No test is perfect; combine the cuff leak with clinical context (voice quality, neck swelling, ease of ventilation) to guide safe extubation decisions.",
    "educationalObjective": "Assess airway edema with a cuff leak test in prolonged intubation or airway surgery and delay extubation if unsafe."
  },
  {
    "id": "Core.6.2.3",
    "category": "General Anesthesia & Postop",
    "subcategory": "Emergence and extubation",
    "difficulty": "medium",
    "questionText": "A 65-year-old man (BMI 28) with mild COPD undergoes right VATS lobectomy with one-lung ventilation for 3 hours. He is now supine with two-lung ventilation. Vital signs: BP 138/76 mm Hg, HR 82/min, SpO2 96% on FiO2 0.60, ETCO2 38 mm Hg. On volume control: Vt 6 mL/kg predicted body weight, RR 14/min, PEEP 5 cm H2O. Breath sounds are coarse with visible secretions in the oropharynx. Neuromuscular blockade is fully reversed, patient is warm and following commands. You plan to extubate in the next few minutes and want to minimize post-extubation atelectasis.\n\nWhich of the following is the best immediate strategy to clear secretions and re-expand the lungs before extubation?",
    "answers": [
      {
        "text": "Suction the oropharynx and ETT, then perform an alveolar recruitment maneuver to 30–40 cm H2O for 10–15 s, set PEEP 8–10 cm H2O, and extubate while providing gentle positive pressure",
        "isCorrect": true,
        "explanation": "This sequence clears pooled secretions, re-opens atelectatic units after OLV, and maintains end-expiratory stability; extubation under positive pressure reduces microaspiration. Using 30–40 cm H2O for 10–15 s overcomes slow time constants ($\\tau=R\\times C$) in collapsed units, while PEEP 8–10 cm H2O prevents rapid derecruitment."
      },
      {
        "text": "Deep extubate to minimize coughing and bronchospasm, then apply CPAP by mask in PACU",
        "isCorrect": false,
        "explanation": "Deep extubation may reduce coughing but does not address existing collapse and risks upper-airway obstruction; recruitment and PEEP are needed before tube removal to minimize post-extubation atelectasis."
      },
      {
        "text": "Increase FiO2 to 1.0 for 10 minutes and extubate without PEEP to avoid barotrauma",
        "isCorrect": false,
        "explanation": "High FiO2 without recruitment promotes absorption atelectasis, and removing PEEP encourages derecruitment. Oxygenation alone does not re-expand collapsed alveoli."
      },
      {
        "text": "Aggressively suction the ETT with the cuff deflated and extubate during a negative-pressure inspiratory effort",
        "isCorrect": false,
        "explanation": "While suctioning is important, extubating during negative pressure draws secretions distally and increases microaspiration; cuff-down suction should be followed by positive-pressure extubation and recruitment with PEEP."
      },
      {
        "text": "Deliver several large manual breaths (12–15 mL/kg) and then reduce PEEP to 0 cm H2O before extubation",
        "isCorrect": false,
        "explanation": "High tidal volumes risk volutrauma without reliably recruiting dependent lung; dropping PEEP to zero causes immediate derecruitment. Sustained inflation plus adequate PEEP is superior for alveolar reopening and stabilization."
      }
    ],
    "didactic": "One-lung ventilation and long cases promote dependent-lung collapse from absorption, compression, and surfactant dysfunction. The most effective peri-extubation approach is an open-lung strategy: clear secretions, recruit, and then maintain alveolar stability. Practical sequence: suction the oropharynx and ETT, perform a recruitment maneuver (sustained inflation to 30–40 cm H2O for 10–15 s or stepwise increases in PEEP/driving pressure), then maintain PEEP 8–10 cm H2O. Extubate while providing gentle positive pressure (e.g., CPAP 5–10 cm H2O) to reduce microaspiration and prevent abrupt loss of end-expiratory volume. Limit FiO2 to the lowest that maintains SpO2 ≥ 92–94% to reduce absorption atelectasis. The physiology hinges on time constants ($\\tau = R \\times C$): collapsed units with high $\\tau$ need sustained pressure to reopen, and PEEP prevents rapid recollapse after recruitment.",
    "educationalObjective": "Clear secretions and re-expand lungs before extubation after one-lung ventilation or long cases to reduce atelectasis."
  },
  {
    "id": "Core.6.2.4",
    "category": "General Anesthesia & Postop",
    "subcategory": "Emergence and extubation",
    "difficulty": "medium",
    "questionText": "A 55-year-old man (BMI 42) with severe OSA uses nightly CPAP at 12 cm H2O. He undergoes an uneventful laparoscopic cholecystectomy under general anesthesia with rocuronium. At case end he is normothermic and hemodynamically stable. On pressure support with PEEP 8 cm H2O, he is breathing comfortably. Quantitative neuromuscular monitoring via acceleromyography shows a train-of-four ratio of 0.88 ten minutes after neostigmine. He is responsive to commands. His home CPAP device is available in the PACU. Which of the following is the most appropriate extubation strategy to minimize post-extubation airway obstruction and hypoxemia in this patient?",
    "answers": [
      {
        "text": "Extubate fully awake in a 25–30° head-up (ramped) position after a quantitative TOF ratio $\\ge 0.95$, then immediately apply CPAP (e.g., 10–12 cm H2O) via a well-fitted mask.",
        "isCorrect": true,
        "explanation": "Head-up positioning improves FRC and airway patency, quantitative reversal to TOF $\\ge 0.95$ reduces pharyngeal collapse from residual weakness, and immediate CPAP stents the upper airway and preserves lung volume in OSA/obesity."
      },
      {
        "text": "Perform deep extubation in the supine position and place a simple face mask at 10 L/min to avoid coughing and hypertension.",
        "isCorrect": false,
        "explanation": "Deep extubation increases risk of upper-airway obstruction in OSA/obesity; oxygen alone does not prevent pharyngeal collapse and may mask hypoventilation."
      },
      {
        "text": "Extubate supine once 4/4 twitches are present on qualitative TOF with a strong 5-second head lift, then use a nasal cannula at 4 L/min.",
        "isCorrect": false,
        "explanation": "Subjective (qualitative) TOF and clinical tests are insensitive; residual block can persist until TOF $\\ge 0.9$–$0.95$, predisposing to airway obstruction and hypoventilation in OSA."
      },
      {
        "text": "Extubate in a head-up position with a nonrebreather at 15 L/min, reserving CPAP for PACU only if desaturation occurs.",
        "isCorrect": false,
        "explanation": "Head-up positioning helps, but delaying CPAP loses its prophylactic benefit; supplemental O2 does not prevent dynamic upper-airway collapse and can delay recognition of hypoventilation."
      },
      {
        "text": "Extubate supine and place high-flow nasal cannula at 50 L/min and 100% O2 to provide PEEP-like support.",
        "isCorrect": false,
        "explanation": "HFNC provides variable, low distending pressure compared with CPAP and does not reliably stent the collapsible pharynx in OSA; supine positioning further worsens airway collapsibility."
      }
    ],
    "didactic": "Obese patients with OSA have reduced FRC and highly collapsible upper airways, making them vulnerable to post-extubation obstruction and hypoxemia, especially when supine. Best practice is to extubate fully awake in a head-up (ramped or reverse Trendelenburg) position, after quantitative neuromuscular monitoring confirms adequate reversal (TOF ratio $\\ge 0.95$), because pharyngeal dilator function is impaired until near-complete recovery. Immediate application of CPAP (typically 8–12 cm H2O) stents the upper airway and preserves lung volume, reducing atelectasis and apnea. Supplemental oxygen alone does not prevent airway collapse and can mask hypoventilation; deep extubation increases obstruction risk in OSA. Practical steps: ensure quantitative monitoring, minimize opioids with multimodal analgesia, position head-up before emergence, and have CPAP set up and applied immediately after extubation. These measures reduce unplanned reintubation, PACU respiratory events, and ICU admissions in high-risk OSA/obesity patients.",
    "educationalObjective": "Extubate the obese/OSA patient in head-up position with full reversal and immediate CPAP availability."
  },
  {
    "id": "Core.6.2.5",
    "category": "General Anesthesia & Postop",
    "subcategory": "Emergence and extubation",
    "difficulty": "hard",
    "questionText": "A 58-year-old woman undergoes a 4-hour multilevel anterior cervical discectomy and fusion. She received 3 L of crystalloid and 10 mg IV dexamethasone near case end for anticipated airway edema. Cuff-leak was minimal pre-extubation, but she was extubated awake for a neurologic exam. In the PACU 20 minutes later she develops inspiratory stridor with suprasternal retractions and anxiety. Vitals: BP 148/82 mm Hg, HR 125/min with occasional PVCs on the monitor, RR 28/min, SpO2 96% on 40% aerosolized face mask. Head-up position, cool humidified oxygen, and two nebulized treatments of racemic epinephrine (2.25%, 0.5 mL diluted to 3 mL) provide only transient improvement before symptoms recur. She can speak short phrases and is mentating normally.\n\nWhich intervention is the most appropriate next step to reduce her work of breathing while definitive therapies take effect?",
    "answers": [
      {
        "text": "Initiate heliox 70:30 via a tight-fitting face mask at high flow",
        "isCorrect": true,
        "explanation": "Heliox lowers gas density, reducing turbulent flow across a narrowed glottis and work of breathing (Reynolds number $Re=\\tfrac{\\rho v D}{\\mu}$; decreasing $\\rho$ lowers $Re$). With adequate oxygenation and tachyarrhythmia limiting further epinephrine, a 70:30 mixture temporizes symptoms while steroids begin to work."
      },
      {
        "text": "Start CPAP at 10 cm H2O with 100% O2",
        "isCorrect": false,
        "explanation": "CPAP can stent dynamic collapse but does not address high-density turbulent flow from fixed glottic edema, and 100% O2 is unnecessary here. Given adequate oxygenation and recent anterior neck surgery, heliox is a safer first temporizing step; CPAP is reserved for worsening gas exchange or fatigue."
      },
      {
        "text": "Repeat nebulized racemic epinephrine now",
        "isCorrect": false,
        "explanation": "She has already received two treatments with only transient benefit and now has tachycardia with PVCs, increasing the risk of arrhythmia. Heliox is preferable to reduce work of breathing while avoiding additional beta-agonist exposure."
      },
      {
        "text": "Administer nebulized albuterol 2.5 mg",
        "isCorrect": false,
        "explanation": "Albuterol treats lower-airway bronchospasm; postextubation stridor reflects upper-airway edema at the glottis. It will not meaningfully relieve turbulent inspiratory flow at the laryngeal inlet."
      },
      {
        "text": "Give additional IV methylprednisolone 125 mg now",
        "isCorrect": false,
        "explanation": "Systemic steroids are already on board and require 4–6 hours for clinical effect; more steroid now will not provide immediate relief. A density-reducing gas (heliox) is the appropriate temporizing therapy."
      }
    ],
    "didactic": "Postextubation stridor most commonly results from laryngeal edema and presents with inspiratory noise, retractions, and increased work of breathing shortly after extubation. Initial management includes head elevation, calm environment, humidified oxygen, and nebulized epinephrine (racemic 2.25%: 0.5 mL diluted to 2–3 mL; or L-epinephrine 1 mg/mL: 5 mL) with cardiac monitoring; corticosteroids (e.g., dexamethasone 8–10 mg IV) help but require 4–6 hours for effect. Heliox (typically 70:30 or 80:20 He:O2) decreases gas density and turbulent flow across fixed upper-airway narrowing, thereby reducing work of breathing; select the highest helium fraction compatible with oxygenation (e.g., 70:30 if SpO2 ≥94% on ≤40% O2). The physics is captured by the Reynolds number $Re=\\tfrac{\\rho v D}{\\mu}$—lowering density ($\\rho$) decreases turbulence. Escalate to CPAP/BiPAP or reintubation if hypoxemia, hypercarbia, fatigue, or worsening obstruction develops. Practical rule: if symptoms persist after epinephrine and oxygenation is acceptable, trial heliox to bridge while steroids take effect; avoid repeated epinephrine in patients with tachyarrhythmias or ischemia risk.",
    "educationalObjective": "Manage postextubation stridor with nebulized epinephrine, steroids, and heliox as needed."
  },
  {
    "id": "Core.6.2.6",
    "category": "General Anesthesia & Postop",
    "subcategory": "Emergence and extubation",
    "difficulty": "hard",
    "questionText": "A 58-year-old woman (BMI 36) with long-standing substernal goiter causing tracheal compression underwent total thyroidectomy. Preoperatively she had limited neck extension and was intubated awake with a flexible bronchoscope after failed direct laryngoscopy. The 4-hour case was uneventful. At the end, she is fully responsive, follows commands, TOF ratio is 0.95, and SpO2 is 99% on FiO2 0.5 with EtCO2 37 mm Hg. The surgeon requests an on-table neurologic and voice assessment, but you are concerned about dynamic airway collapse and the potential need for rapid reintubation. You decide to extubate now in the OR.\n\nWhich extubation plan best maximizes safety by preserving rapid reintubation options while providing backup oxygenation?",
    "answers": [
      {
        "text": "Extubate fully awake over an airway exchange catheter left intratracheal at approximately the ETT depth (≈20–25 cm at the teeth); provide 1–2 L/min O2 via the catheter side port plus supplemental nasal cannula O2; avoid jet/positive-pressure ventilation through the catheter; remove the catheter only after sustained airway stability",
        "isCorrect": true,
        "explanation": "This approach preserves a secure guide for rapid reintubation and provides low-flow insufflation without risking barotrauma. Keeping the patient awake and breathing spontaneously reduces collapse risk; low-flow ($1$–$2$ L/min) O2 via the catheter avoids dangerous pressures if supraglottic obstruction occurs."
      },
      {
        "text": "Extubate deep and immediately remove the airway exchange catheter to improve comfort; apply face mask CPAP (10–12 cm H2O) and, if desaturation occurs, perform manual jet ventilation through the catheter",
        "isCorrect": false,
        "explanation": "Deep extubation removes airway muscle tone and increases collapse risk in tracheomalacia/edema. Jet/positive-pressure ventilation through an AEC in the setting of upper airway obstruction can cause barotrauma due to gas trapping and high transpulmonary pressures."
      },
      {
        "text": "Exchange the ETT for a laryngeal mask airway while the patient breathes spontaneously, then remove the LMA once voice is assessed",
        "isCorrect": false,
        "explanation": "An LMA does not preserve tracheal access for rapid reintubation and may worsen obstruction if supraglottic edema is present. It forfeits the key advantage of an intratracheal guide that an AEC provides."
      },
      {
        "text": "Extubate to high-flow nasal cannula at 60 L/min and avoid using an airway exchange catheter to reduce airway trauma; if obstruction occurs, perform vigorous bag-mask ventilation",
        "isCorrect": false,
        "explanation": "HFNC can aid oxygenation but does not preserve a conduit for reintubation in a known difficult airway. Aggressive mask ventilation against fixed or dynamic obstruction may be ineffective and risks gastric insufflation without solving reintubation access."
      },
      {
        "text": "Keep the patient intubated and transport to PACU for later awake extubation without an airway exchange catheter, relying on a cuff leak test alone to assess for collapse",
        "isCorrect": false,
        "explanation": "Deferring extubation may be reasonable in some cases, but here the plan is to extubate now. A cuff leak does not reliably predict dynamic collapse; not using an AEC forfeits a critical safety measure for a known difficult airway."
      }
    ],
    "didactic": "In patients with known or suspected difficult airways or dynamic collapse (e.g., large goiter, airway edema), extubation should be planned as carefully as induction. Prefer an awake, fully reversed, head-elevated extubation with spontaneous ventilation preserved. An airway exchange catheter (typically 11–14 Fr) placed intratracheally at approximately the prior ETT depth provides a ready guide for rapid reintubation and allows continuous capnography if equipped with a connector. Provide supplemental oxygen via nasal cannula or face mask; if using the catheter for insufflation, use low flows (about 1–2 L/min) and avoid positive-pressure/jet ventilation through the catheter to reduce barotrauma risk when upper airway obstruction is present. Confirm catheter position (e.g., by waveform capnography) and leave it in place until airway patency and gas exchange are reliably stable, then remove. Practical tips: preoxygenate, head-up positioning, minimize sedatives, have reintubation equipment ready (videolaryngoscope, fiberoptic), and consider CPAP/NIV support post-extubation in OSA or collapse-prone patients.",
    "educationalObjective": "Plan extubation for the known or suspected difficult airway using an airway exchange catheter and backup oxygenation."
  },
  {
    "id": "Core.6.2.7",
    "category": "General Anesthesia & Postop",
    "subcategory": "Emergence and extubation",
    "difficulty": "medium",
    "questionText": "A healthy 32-year-old man is emerging from general anesthesia after an uncomplicated laparoscopic inguinal hernia repair. He was extubated awake and immediately developed high-pitched inspiratory noise that progressed to silent airway obstruction with paradoxical chest/abdominal motion. The capnogram is flat and SpO2 decreases from 99% to 88% over 20 seconds. Blood-tinged secretions are noted in the oropharynx. You apply 100% O2 via a tight facemask and perform a vigorous jaw thrust (Larson maneuver) with continuous CPAP of $15\\ \\text{cm H_2O}$ while an assistant suctions the oropharynx, but after 10 seconds there is still no airflow and SpO2 is 84%.\n\nWhich of the following is the most appropriate next step?",
    "answers": [
      {
        "text": "Administer succinylcholine $0.5\\ \\text{mg/kg}$ IV and assist ventilation by mask",
        "isCorrect": true,
        "explanation": "Persistent complete laryngospasm despite suction–CPAP–jaw thrust warrants prompt small-dose succinylcholine to rapidly relax the laryngeal muscles and restore ventilation; mask ventilation can then resume until recovery."
      },
      {
        "text": "Deliver albuterol via nebulizer for suspected bronchospasm",
        "isCorrect": false,
        "explanation": "Bronchospasm presents with wheezing and an expiratory flow problem; this patient has upper-airway closure with silent chest and paradoxical efforts, consistent with laryngospasm, for which albuterol is ineffective."
      },
      {
        "text": "Insert a laryngeal mask airway without medication to bypass the obstruction",
        "isCorrect": false,
        "explanation": "Attempting airway instrumentation through an active laryngospasm can worsen the spasm and is slower than pharmacologic relaxation; definitive treatment is rapid neuromuscular relaxation with succinylcholine when noninvasive maneuvers fail."
      },
      {
        "text": "Administer propofol $0.5\\ \\text{mg/kg}$ IV and continue CPAP",
        "isCorrect": false,
        "explanation": "Small-dose propofol can relieve partial spasm, but it is less reliable than succinylcholine for complete, rapidly desaturating laryngospasm after failure of suction–CPAP–jaw thrust; immediate muscle relaxation is preferred."
      },
      {
        "text": "Administer naloxone $0.1\\ \\text{mg}$ IV for opioid-induced respiratory depression",
        "isCorrect": false,
        "explanation": "Opioid-induced hypoventilation causes depressed effort with preserved airway patency, not paradoxical chest motion with silent airflow and a flat capnogram; the problem is mechanical glottic closure, not central depression."
      }
    ],
    "didactic": "Laryngospasm is a reflex glottic closure often triggered by secretions or stimulation during light anesthesia. Immediate management is stepwise: remove the stimulus and perform SUCTION–CPAP–jaw thrust (Larson maneuver) with 100% O2, using firm CPAP of $10{-}20\\ \\text{cm H_2O}$. If obstruction persists, administer a small dose of propofol ($0.5{-}1\\ \\text{mg/kg}$) or, more definitively, succinylcholine ($0.1{-}0.5\\ \\text{mg/kg}$ IV; $\\sim4\\ \\text{mg/kg}$ IM if no IV) to break the spasm rapidly. Early treatment prevents hypoxemia and negative-pressure pulmonary edema from forceful inspiratory efforts against a closed glottis. Prevention includes fully awake or deep extubation, gentle airway manipulation, and clearing blood/secretions; lidocaine $1{-}1.5\\ \\text{mg/kg}$ IV may attenuate reflexes. Recognize the distinction from bronchospasm (wheezing, expiratory difficulty, capnogram present) where bronchodilators, not succinylcholine, are indicated.",
    "educationalObjective": "Prevent and treat laryngospasm using SUCTION–CPAP–jaw thrust and small doses of propofol or succinylcholine."
  },
  {
    "id": "Core.6.2.8",
    "category": "General Anesthesia & Postop",
    "subcategory": "Emergence and extubation",
    "difficulty": "easy",
    "questionText": "A 3-year-old boy (15 kg) with adenotonsillar hypertrophy and nightly snoring is undergoing tonsillectomy under sevoflurane in air/O2. He received IV acetaminophen (15 mg/kg) and the surgeon infiltrated local anesthetic; the case has been uneventful. Ten minutes remain, end-tidal sevoflurane is being decreased, and you plan an awake extubation. You are concerned about emergence agitation in the PACU but want to minimize respiratory depression given suspected OSA.\n\nWhich intraoperative intervention at this time would most effectively reduce the risk of emergence agitation while preserving respiratory drive?",
    "answers": [
      {
        "text": "Administer dexmedetomidine $0.3$–$0.5\\,\\mu\\text{g/kg}$ IV over $5$–$10$ minutes before emergence",
        "isCorrect": true,
        "explanation": "Low-dose dexmedetomidine reliably reduces pediatric emergence agitation and provides opioid-sparing analgesia with minimal respiratory depression; main risks are bradycardia and mild hypotension."
      },
      {
        "text": "Give fentanyl $2\\,\\mu\\text{g/kg}$ IV as a bolus at the end of surgery",
        "isCorrect": false,
        "explanation": "While fentanyl treats pain, it increases risk of postoperative apnea and airway obstruction in suspected OSA and may prolong emergence; it is not the safest strategy to prevent emergence agitation here."
      },
      {
        "text": "Administer midazolam $0.1\\,\\text{mg/kg}$ IV at the end of the case",
        "isCorrect": false,
        "explanation": "Benzodiazepines do not reliably prevent emergence agitation and can cause paradoxical agitation, respiratory depression, or delayed recovery in young children."
      },
      {
        "text": "Give propofol $1\\,\\text{mg/kg}$ IV once as volatile anesthesia is discontinued",
        "isCorrect": false,
        "explanation": "A single propofol bolus may transiently smooth emergence but is less consistent than dexmedetomidine for preventing emergence agitation and can precipitate airway obstruction or hypotension, especially in OSA."
      },
      {
        "text": "Maintain deeper sevoflurane (near $1\\,\\text{MAC}$) until extubation to ensure a smooth wake-up",
        "isCorrect": false,
        "explanation": "Sustained exposure to sevoflurane is associated with higher rates of emergence agitation in preschool children; deep anesthesia also delays recovery and does not address the underlying risk factors."
      }
    ],
    "didactic": "Emergence agitation (EA) is common in preschool children, especially with low-solubility volatiles (sevoflurane, desflurane), short ENT procedures, high preoperative anxiety, and inadequate analgesia. Dexmedetomidine, an $\\alpha_2$-agonist, reduces EA through anxiolysis and analgesia while preserving ventilation; typical dosing is a bolus of $0.3$–$0.5\\,\\mu\\text{g/kg}$ over $5$–$10$ minutes near the end of the case or an infusion of $0.2$–$0.7\\,\\mu\\text{g/kg/h}$, with monitoring for bradycardia and hypotension. Opioids can blunt pain-related agitation but increase risk of postoperative airway obstruction and apnea in children with suspected OSA. Benzodiazepines are inconsistent for EA prevention and may worsen agitation. A brief propofol technique (e.g., TIVA for the entire case) reduces EA compared with sevoflurane, but a single end-of-case bolus is less reliable. Practical approach: ensure multimodal analgesia (acetaminophen, NSAID, local/regional) and add low-dose dexmedetomidine before emergence to prevent EA while minimizing respiratory depression.",
    "educationalObjective": "Prevent pediatric emergence agitation with appropriate analgesia and agents such as dexmedetomidine."
  },
  {
    "id": "Core.6.2.9",
    "category": "General Anesthesia & Postop",
    "subcategory": "Emergence and extubation",
    "difficulty": "easy",
    "questionText": "A 70-kg man undergoes laparoscopic cholecystectomy with rocuronium for muscle relaxation. Near the end of the case, sevoflurane is decreased and he begins to breathe spontaneously but has shallow tidal volumes (2–3 mL/kg) with end-tidal CO2 of 48 mm Hg. Quantitative neuromuscular monitoring at the adductor pollicis using acceleromyography shows a train-of-four (TOF) count of 4 with a $TOF_{ratio}=0.55$. Ten minutes earlier he received neostigmine 40 mcg/kg with glycopyrrolate. He is otherwise hemodynamically stable and following commands intermittently. Which is the most appropriate next step to facilitate safe extubation?",
    "answers": [
      {
        "text": "Administer sugammadex 2 mg/kg and confirm $TOF_{ratio} \\ge 0.9$ prior to extubation",
        "isCorrect": true,
        "explanation": "A $TOF_{ratio}=0.55$ indicates moderate residual block from rocuronium despite neostigmine. Sugammadex 2 mg/kg reliably reverses moderate block (TOF count ≥2–4); extubation should wait until $TOF_{ratio} \\ge 0.9$."
      },
      {
        "text": "Extubate now because there are 4 twitches and a 5-second head lift",
        "isCorrect": false,
        "explanation": "Clinical tests (head lift, grip) and qualitative TOF are insensitive; patients may have significant weakness until $TOF_{ratio} \\ge 0.9$. Extubation now risks airway obstruction and hypoventilation."
      },
      {
        "text": "Give additional neostigmine 30 mcg/kg",
        "isCorrect": false,
        "explanation": "Neostigmine has a ceiling effect and slow, variable antagonism at this depth of block; redosing 10 minutes after 40 mcg/kg offers limited additional benefit and increases cholinergic side effects."
      },
      {
        "text": "Wait 5 minutes without intervention and extubate if the patient appears strong",
        "isCorrect": false,
        "explanation": "Time alone is unpredictable, and clinical appearance is unreliable. Quantitative recovery to $TOF_{ratio} \\ge 0.9$ should be demonstrated before extubation."
      },
      {
        "text": "Administer sugammadex 4 mg/kg",
        "isCorrect": false,
        "explanation": "While effective, 4 mg/kg is intended for deeper block (TOF count 0 with post-tetanic count 1–2). The most appropriate dose for moderate block (TOF count 2–4) is 2 mg/kg."
      }
    ],
    "didactic": "Residual neuromuscular block is common at emergence and is best detected with quantitative monitoring; safe extubation generally requires $TOF_{ratio} \\ge 0.9$. Clinical tests (head lift, tongue protrusion) and qualitative TOF often miss clinically significant weakness when the ratio is 0.4–0.9. After rocuronium/vecuronium, reversal choice depends on depth: neostigmine works for shallow to moderate block but has a ceiling effect and slower onset, whereas sugammadex provides rapid, predictable reversal based on block depth. Typical sugammadex dosing: 2 mg/kg for moderate block (TOF count ≥2–4), 4 mg/kg for deep block (post-tetanic count 1–2 with TOF=0), and 16 mg/kg for immediate reversal after RSI dosing. Extubation should be deferred until quantitative recovery is documented; aiming for $TOF_{ratio} \\ge 0.9$ minimizes airway obstruction, hypoventilation, and postoperative pulmonary complications. When neostigmine has been given yet the $TOF_{ratio}$ remains <0.9, sugammadex is appropriate and compatible, followed by reassessment before extubation.",
    "educationalObjective": "Recognize residual neuromuscular block on emergence and treat based on quantitative monitoring."
  },
  {
    "id": "Core.6.2.10",
    "category": "General Anesthesia & Postop",
    "subcategory": "Emergence and extubation",
    "difficulty": "medium",
    "questionText": "A 58-year-old man (HTN, prior PCI, on metoprolol) undergoes total thyroidectomy under balanced anesthesia with sevoflurane and rocuronium. The drain is in place and the surgeon requests “no coughing” because a postoperative hematoma would be dangerous. Sevoflurane has been reduced to ~0.2 MAC; TOF ratio is 0.95; the patient is following commands and will be extubated awake in 2–3 minutes. Current vitals: BP 165/90 mm Hg, HR 88 bpm, SpO2 99% on FiO2 0.5. You want to minimize coughing and the hypertensive surge without delaying emergence.\n\nWhich of the following is the best next step?",
    "answers": [
      {
        "text": "Start a remifentanil infusion at 0.05–0.1 mcg/kg/min during emergence and discontinue at extubation",
        "isCorrect": true,
        "explanation": "Remifentanil reliably blunts cough and the sympathetic response to extubation, with an ultra–short context-sensitive half-time ($\\approx 3$–$5$ min) that minimizes delayed emergence. Low-dose infusion titrated to extubation provides smoother hemodynamics and airway reflex suppression than lidocaine or esmolol alone."
      },
      {
        "text": "Administer IV lidocaine 1.5 mg/kg 1–2 minutes before extubation",
        "isCorrect": false,
        "explanation": "IV lidocaine reduces airway reflexes and cough but has inconsistent effects on hypertension at extubation. It is reasonable when opioids are contraindicated, but it is less reliable than remifentanil for simultaneously controlling cough and sympathetic surges."
      },
      {
        "text": "Administer esmolol 0.5 mg/kg IV 2 minutes before extubation",
        "isCorrect": false,
        "explanation": "Esmolol attenuates tachycardia and hypertension but does not suppress cough or airway reflexes. Relying on a beta-blocker alone risks coughing in a fresh thyroid bed—a common misconception when targeting only hemodynamics."
      },
      {
        "text": "Give dexmedetomidine 0.5 mcg/kg IV bolus over 2 minutes now",
        "isCorrect": false,
        "explanation": "Dexmedetomidine can decrease coughing and blunt sympathetic responses, but a rapid bolus often causes bradycardia/hypotension and may delay awakening. It is better as a slow infusion or smaller dose earlier; it is less predictable than remifentanil for a planned extubation in 2–3 minutes."
      },
      {
        "text": "Instill 4% lidocaine 2 mL via the ETT immediately before extubation",
        "isCorrect": false,
        "explanation": "Topical/tracheal lidocaine can help if given with adequate lead time, but instilling immediately before extubation is unpredictable and may itself trigger coughing during instillation. It also provides limited control of the hypertensive response compared with remifentanil."
      }
    ],
    "didactic": "Emergence coughing and hypertension are driven by airway stimulation and sympathetic activation from the ETT. Short-acting opioids, especially remifentanil, best blunt both phenomena with rapid offset; low-dose infusions (≈0.03–0.1 mcg/kg/min) titrated to extubation reduce coughing and BP surges and can be stopped at tube removal, with context-sensitive half-time ≈$3$–$5$ minutes. IV lidocaine (1–1.5 mg/kg given 1–2 minutes pre-extubation) suppresses cough and may modestly attenuate hemodynamics, but effects are less consistent than remifentanil. Beta-blockers (e.g., esmolol 10–30 mg or ~0.5 mg/kg) blunt HR/BP but do not reduce airway reflexes; they are adjuncts, not stand-alone solutions for cough. Dexmedetomidine reduces cough and sympathetic tone but may cause bradycardia/hypotension and can prolong emergence if bolused late; prefer a slow infusion or earlier dosing. Practical approach: combine multimodal analgesia, consider low-dose remifentanil for extubation, and tailor adjuncts (lidocaine, esmolol, dexmedetomidine) to the patient’s hemodynamics and timing.",
    "educationalObjective": "Reduce emergence coughing and hypertension using lidocaine, short-acting opioids, beta-blockers, or dexmedetomidine."
  },
  {
    "id": "Core.6.2.11",
    "category": "General Anesthesia & Postop",
    "subcategory": "Emergence and extubation",
    "difficulty": "medium",
    "questionText": "A 27-year-old man with moderate persistent asthma (on ICS/LABA; used albuterol preoperatively), no GERD, and an easy airway undergoes elective tympanoplasty. He was NPO for 10 hours. Anesthesia is maintained with sevoflurane and a low-dose remifentanil infusion. At closure, the surgeon notes the middle ear graft is delicate and asks to avoid coughing or bucking. The throat and pharynx are dry after thorough suctioning; the throat pack has been removed. He is spontaneously ventilating via the ETT with regular breaths (Vt ≈ 6 mL/kg), normocapnia, stable hemodynamics, TOF ratio 0.95 after full reversal, and end-tidal sevoflurane ≈ 1.1 MAC. Which extubation strategy is most appropriate?",
    "answers": [
      {
        "text": "Perform deep extubation while maintaining sevoflurane (≈1 MAC) after thorough oropharyngeal suctioning, place an oropharyngeal airway, administer 100% O2, and transport in lateral position.",
        "isCorrect": true,
        "explanation": "Low aspiration risk, an easy airway, and a strong need to avoid coughing in a reactive airway favor deep extubation. Suctioning plus airway adjuncts and lateral positioning mitigate secretion-related events while minimizing bucking and bronchospasm."
      },
      {
        "text": "Extubate fully awake after complete reversal and a cuff-leak assessment to minimize aspiration risk.",
        "isCorrect": false,
        "explanation": "Awake extubation is preferred when aspiration risk or reintubation risk is high. Here aspiration risk is low and awake extubation increases coughing/bucking and bronchospasm risk, potentially disrupting the graft."
      },
      {
        "text": "Exchange the ETT for an LMA, then remove the LMA under a deep plane to achieve a smoother emergence.",
        "isCorrect": false,
        "explanation": "Airway device exchange adds stimulation and risk without increasing protection from aspiration; it is unnecessary given low aspiration risk and may precipitate laryngospasm/bronchospasm."
      },
      {
        "text": "Perform deep extubation in the supine position while avoiding suction to prevent airway stimulation.",
        "isCorrect": false,
        "explanation": "Avoiding suction increases the risk of pooling secretions and laryngospasm/aspiration. Deep extubation should be paired with meticulous suction and protective positioning."
      },
      {
        "text": "Extubate at a light plane (≈MAC-awake) when the patient is not yet following commands to balance coughing and aspiration risks.",
        "isCorrect": false,
        "explanation": "“Light” extubation maximizes laryngospasm/bronchospasm risk. Safe strategies are either truly deep (no airway reflexes) or fully awake with intact protective reflexes; the in-between plane is hazardous."
      }
    ],
    "didactic": "Choice of deep versus awake extubation hinges on aspiration risk, airway reactivity, reintubation difficulty, and surgical priorities. Deep extubation is reasonable when aspiration risk is low, the airway is easy, and coughing/bucking could harm the patient or surgery (e.g., middle ear, ophthalmic, intracranial, hernia repairs) or precipitate bronchospasm in reactive airways; ensure a truly deep plane (e.g., end-tidal volatile near surgical MAC), meticulous suction, 100% O2, OPA, and lateral positioning. Awake extubation is preferred when aspiration risk is increased (full stomach, uncontrolled GERD, blood in the airway), the airway may be difficult to resecure, or airway obstruction risk is high (significant edema, OSA with poor tone). Avoid the “light” zone around $MAC_{awake}\\approx 0.3$–$0.5$ MAC, where airway reflexes are returning but cooperation is absent, as it increases laryngospasm/bronchospasm risk. Practical steps: fully reverse neuromuscular blockade (TOF ratio ≥ 0.9–1.0), suction oropharynx (and consider gastric suction if risk), preoxygenate, and be prepared for reintubation. A simple rule: high aspiration or reintubation risk → awake; low aspiration with high consequence of bucking/reactivity → deep with precautions.",
    "educationalObjective": "Select deep versus awake extubation based on aspiration risk, airway reactivity, and surgical factors."
  },
  {
    "id": "Core.6.2.12",
    "category": "General Anesthesia & Postop",
    "subcategory": "Emergence and extubation",
    "difficulty": "medium",
    "questionText": "A 56-year-old man (BMI 32) with moderate OSA undergoes laparoscopic hernia repair under general anesthesia with sevoflurane, fentanyl, and rocuronium. The last rocuronium dose was given 60 minutes ago; neostigmine 40 µg/kg with glycopyrrolate 7 µg/kg was administered 15 minutes ago after observing four twitches. At case end, sevoflurane is discontinued (end-tidal 0.1 MAC), the patient is on PSV (PS 5, PEEP 5), and he is breathing spontaneously. Vitals: BP 138/78 mm Hg, HR 82 bpm, SpO2 varies with FiO2. You have quantitative neuromuscular monitoring available.\n\nWhich of the following sets of findings best indicates readiness for extubation now?",
    "answers": [
      {
        "text": "Qualitative TOF count 4/4 without obvious fade; Vt 5 mL/kg; patient drowsy but arousable; SpO2 100% on FiO2 1.0; ETCO2 41 mm Hg",
        "isCorrect": false,
        "explanation": "Four twitches without fade on qualitative monitoring does not exclude residual block (TOF ratio may still be <0.9), and high FiO2 can mask inadequate reserve; somnolence raises concern for airway protection."
      },
      {
        "text": "Quantitative TOF ratio 0.86 at the adductor pollicis; patient follows commands; Vt 6 mL/kg; ETCO2 48 mm Hg on minimal support; SpO2 96% on FiO2 0.5",
        "isCorrect": false,
        "explanation": "A TOF ratio <0.9 indicates residual neuromuscular block despite command following; hypercarbia suggests inadequate ventilation."
      },
      {
        "text": "Quantitative TOF ratio 0.95 at the adductor pollicis; patient follows commands and coughs to suction; NIF −25 cm H2O; Vt 6–8 mL/kg (IBW), RR 12–16; ETCO2 40 mm Hg; SpO2 98% on FiO2 0.4",
        "isCorrect": true,
        "explanation": "Objective reversal (TOF ≥0.9 at adductor pollicis) plus adequate ventilation and oxygenation on modest FiO2, responsiveness, and airway reflexes together indicate readiness for extubation."
      },
      {
        "text": "Sustained 5-second head lift and strong hand-grip; Vt 3 mL/kg with RR 30; ETCO2 55 mm Hg; SpO2 99% on FiO2 0.8",
        "isCorrect": false,
        "explanation": "Head lift/hand-grip are unreliable predictors of full reversal; the shallow, rapid pattern with hypercarbia indicates inadequate ventilation despite acceptable oxygenation on high FiO2."
      },
      {
        "text": "Quantitative TOF ratio 0.92 at the corrugator supercilii; not reliably following commands with end-tidal sevoflurane 0.2 MAC; Vt 7 mL/kg, RR 14; ETCO2 43 mm Hg; SpO2 97% on FiO2 0.3",
        "isCorrect": false,
        "explanation": "Corrugator supercilii recovers earlier than adductor pollicis, so TOF 0.92 there may overestimate pharyngeal strength; residual volatile and lack of command-following argue against extubation."
      }
    ],
    "didactic": "Extubation readiness requires objective recovery from neuromuscular block plus adequate ventilation, oxygenation, and responsiveness. Quantitative monitoring with a TOF ratio ≥0.9–1.0 at the adductor pollicis correlates with restoration of upper airway muscle function; qualitative “4/4” or head-lift/hand-grip are insufficient. The corrugator supercilii recovers earlier than the adductor pollicis, so a TOF ≥0.9 at the forehead may overestimate airway muscle strength. Assess ventilation with pattern and capnography: a normal ETCO2 and appropriate minute ventilation ($\\dot V_E = RR \\times V_T$) and, more specifically, adequate alveolar ventilation ($\\dot V_A \\approx RR\\times (V_T - V_D)$, with $V_D \\approx 2$ mL/kg). Oxygenation should be acceptable on modest FiO2 (e.g., SpO2 ≥92–94% on FiO2 ≤0.4) to avoid masking poor reserve. Additional practical checks include following commands, intact cough, hemodynamic stability, and normothermia; residual volatile or sedatives can blunt airway reflexes even when TOF is adequate.",
    "educationalObjective": "Verify readiness for extubation with objective criteria: TOF ratio ≥0.9–1.0, adequate ventilation, oxygenation, and responsiveness."
  },
  {
    "id": "Core.6.3.1",
    "category": "General Anesthesia & Postop",
    "subcategory": "Maintenance: inhaled vs TIVA",
    "difficulty": "medium",
    "questionText": "You are supervising four ORs and considering adding 50% $\\mathrm{N_2O}$ to sevoflurane during 45–90 minute cases to lower volatile requirements and speed emergence. In which case is this plan most appropriate?",
    "answers": [
      {
        "text": "28-year-old woman for tympanoplasty with underlay graft; history of severe PONV and motion sickness.",
        "isCorrect": false,
        "explanation": "$\\mathrm{N_2O}$ rapidly diffuses into the middle ear, increasing pressure during use and then creating negative pressure after discontinuation, risking graft displacement; it also increases PONV risk in this high-risk patient."
      },
      {
        "text": "67-year-old man with partial small-bowel obstruction for exploratory laparotomy; markedly distended abdomen on exam.",
        "isCorrect": false,
        "explanation": "$\\mathrm{N_2O}$ expands intraluminal gas (diffuses in faster than $\\mathrm{N_2}$ leaves), worsening bowel distension and impairing surgical exposure and ventilation."
      },
      {
        "text": "34-year-old nonsmoking woman with motion sickness for laparoscopic cholecystectomy.",
        "isCorrect": false,
        "explanation": "This patient has high PONV risk and pneumoperitoneum; $\\mathrm{N_2O}$ increases PONV and can further expand intra-abdominal gas, so it should be avoided."
      },
      {
        "text": "50-year-old male smoker with no PONV history for a 60-minute open inguinal hernia repair.",
        "isCorrect": true,
        "explanation": "No closed gas spaces are involved and PONV risk is low; 50% $\\mathrm{N_2O}$ contributes roughly 0.5 MAC, reducing volatile needs while allowing rapid emergence."
      }
    ],
    "didactic": "$\\mathrm{N_2O}$ diffuses into air-filled spaces ~34 times faster than $\\mathrm{N_2}$ leaves, so it expands or pressurizes closed or semi-closed cavities (e.g., middle ear, pneumothorax, intracranial air, obstructed bowel, pneumoperitoneum, and intraocular gas). Consequently, avoid $\\mathrm{N_2O}$ in closed-space surgeries (tympanoplasty, bowel obstruction, recent intravitreal SF6/C3F8) and when PONV risk is high. $\\mathrm{N_2O}$ also increases PONV in a dose- and duration-dependent manner (mitigated by TIVA with propofol and multimodal prophylaxis). When these concerns are absent, selective use of 50% $\\mathrm{N_2O}$ can reduce volatile requirements by about 0.5 MAC, maintain hemodynamic stability, and facilitate rapid wake-up. Practical rules: avoid $\\mathrm{N_2O}$ for middle ear surgery and retinal gas (for at least 7–10 days for SF6, longer for C3F8), known or suspected pneumothorax, intracranial air, and distended bowel. Use it cautiously in laparoscopy and in patients with significant PONV risk factors (female, nonsmoker, history of PONV/motion sickness, opioids). Balancing benefits (MAC reduction, analgesia) against these risks guides selective, case-by-case use.",
    "educationalObjective": "Avoid nitrous oxide in closed-space surgery or high PONV risk and use it selectively for MAC reduction."
  },
  {
    "id": "Core.6.3.2",
    "category": "General Anesthesia & Postop",
    "subcategory": "Maintenance: inhaled vs TIVA",
    "difficulty": "medium",
    "questionText": "A 34-year-old woman (BMI 24) presents for suspension microlaryngoscopy with laser excision of bilateral vocal fold papillomas. The ENT surgeon plans shared-airway surgery using intermittent apnea and high-frequency jet ventilation through the rigid laryngoscope, requests FiO2 ≤ 0.30, and does not want a cuffed endotracheal tube in place. She has severe prior postoperative nausea and vomiting (PONV), mild exercise-induced asthma, and a family history of malignant hyperthermia (uncle affected); she has not been tested and will be treated as susceptible. Standard anesthesia machine is available, but the jet ventilator has no vaporizer, and end-tidal agent monitoring will not be possible during the open-airway portions. A processed EEG depth monitor is available. Which maintenance anesthetic plan is MOST appropriate for this case?",
    "answers": [
      {
        "text": "Propofol–remifentanil total intravenous anesthesia with neuromuscular blockade and processed EEG depth monitoring",
        "isCorrect": true,
        "explanation": "Best integrates all constraints: avoids volatile agents in an MH-susceptible patient, is deliverable and titratable during open-airway/jet ventilation when end-tidal agent monitoring is impossible, supports low FiO2 for laser fire safety, provides reliable immobility with NMB, and reduces PONV versus inhaled agents. Processed EEG mitigates awareness risk during TIVA when no end-tidal anesthetic is measurable."
      },
      {
        "text": "Sevoflurane maintenance via insufflation through the laryngoscope with spontaneous ventilation to leverage bronchodilation",
        "isCorrect": false,
        "explanation": "Insufflated volatile during an open-airway case provides unpredictable alveolar concentrations, no end-tidal monitoring, and significant OR pollution; it also exposes an MH-susceptible patient to a trigger and increases PONV. Bronchodilation benefits do not override delivery and safety constraints."
      },
      {
        "text": "Desflurane with 50% N2O via a cuffed laser endotracheal tube for precise end-tidal control and rapid emergence",
        "isCorrect": false,
        "explanation": "A laser ETT would obstruct the surgeon’s view in suspension microlaryngoscopy with jet ventilation and conflicts with the planned open-airway technique. Volatiles trigger MH, desflurane can irritate the airway, and N2O increases PONV and supports airway fire in laser cases."
      },
      {
        "text": "Sevoflurane at ~0.7 MAC supplemented with dexmedetomidine infusion to limit PONV during jet ventilation",
        "isCorrect": false,
        "explanation": "Volatile delivery remains unreliable without a closed circuit or end-tidal monitoring during jet ventilation, and any MAC of a triggering agent is contraindicated in MH susceptibility. Dexmedetomidine may reduce PONV and opioid needs but does not solve the fundamental delivery and MH-trigger issues."
      },
      {
        "text": "Ketamine infusion (about 2 mg/kg/h) as the sole maintenance anesthetic to avoid volatile agents",
        "isCorrect": false,
        "explanation": "While ketamine avoids MH triggers, as a sole anesthetic it is poorly titratable for surgical immobility, increases secretions, and risks dysphoria; it does not reduce PONV as effectively as propofol. A propofol–remifentanil TIVA provides superior hypnotic control and rapid, precise titration for shared-airway surgery."
      }
    ],
    "didactic": "In shared/open-airway surgery (rigid laryngoscopy, bronchoscopy, jet ventilation), volatile anesthetics cannot be reliably delivered or monitored; choose TIVA when you cannot measure end-tidal agent concentration. MH susceptibility absolutely contraindicates volatile agents and succinylcholine; propofol–remifentanil TIVA is the standard alternative. Laser airway cases require minimizing oxidizers (avoid N2O and keep FiO2 ≤ 0.30) to reduce fire risk. Propofol-based TIVA reduces PONV by roughly 30–50% compared with volatile maintenance, aligning with this patient’s high PONV risk. Use processed EEG (e.g., BIS/PSI target ~40–60) during TIVA—especially with neuromuscular blockade—to mitigate awareness risk when no end-tidal anesthetic is available. Although volatiles have bronchodilatory effects helpful in asthma, delivery feasibility, MH risk, and surgical airway requirements take precedence in selecting maintenance anesthesia.",
    "educationalObjective": "Choose inhaled anesthesia versus TIVA by balancing airway surgery needs, PONV risk, comorbidities, and monitoring requirements."
  },
  {
    "id": "Core.6.3.3",
    "category": "General Anesthesia & Postop",
    "subcategory": "Maintenance: inhaled vs TIVA",
    "difficulty": "medium",
    "questionText": "A 29-year-old woman with moderate persistent asthma (albuterol inhaler several times per week, on inhaled budesonide) presents for laparoscopic ovarian cystectomy. She received albuterol preoperatively and has no wheeze on exam. After IV induction with fentanyl, lidocaine, propofol, and rocuronium, a 7.0-mm cuffed ETT is placed. Maintenance is begun with sevoflurane at ~0.6 MAC in air/O2 (FiO2 0.5), FGF 2 L/min, VT 6–7 mL/kg IBW, PEEP 5 cm H2O. Ten minutes after pneumoperitoneum, peak inspiratory pressure rises to 35 cm H2O with expiratory wheeze; ETCO2 is 45 mm Hg and SpO2 98%. Plateau pressure has risen only slightly compared to peak, consistent with increased airway resistance. You rule out tube obstruction/kink and administer albuterol MDI via the circuit, with partial improvement.\n\nWhich maintenance plan will most effectively reduce airway resistance and minimize further bronchospasm?",
    "answers": [
      {
        "text": "Increase sevoflurane to 1.2–1.5 MAC in O2/air (avoid N2O) and continue intermittent albuterol as needed",
        "isCorrect": true,
        "explanation": "Volatile agents (especially sevoflurane) produce dose-dependent bronchodilation and blunt reflex-mediated bronchoconstriction; deepening volatile anesthesia is the most immediate and reliable strategy during intraoperative bronchospasm."
      },
      {
        "text": "Switch to desflurane at ~1.0 MAC to facilitate a faster emergence",
        "isCorrect": false,
        "explanation": "Desflurane is pungent and can increase airway resistance and trigger bronchospasm, particularly in patients with reactive airways and with rapid concentration changes."
      },
      {
        "text": "Add 50% N2O to reduce the sevoflurane requirement and improve bronchodilation",
        "isCorrect": false,
        "explanation": "N2O has no bronchodilatory effect; reducing sevoflurane to make room for N2O would likely lessen, not enhance, bronchodilation."
      },
      {
        "text": "Convert to TIVA with propofol–remifentanil and add a low-dose ketamine infusion",
        "isCorrect": false,
        "explanation": "TIVA with propofol and ketamine is an acceptable alternative if volatiles are contraindicated, but inhaled anesthetics provide more rapid and predictable bronchodilation; ketamine may increase secretions and often requires an antisialagogue."
      },
      {
        "text": "Maintain with isoflurane 0.5 MAC and use morphine boluses for analgesia",
        "isCorrect": false,
        "explanation": "Light anesthesia favors reflex bronchoconstriction, and morphine can release histamine and worsen bronchospasm; deeper volatile anesthesia (sevo/isoflurane) is preferred."
      }
    ],
    "didactic": "Volatile anesthetics (sevoflurane and isoflurane) directly relax airway smooth muscle via reduced intracellular Ca2+ availability and inhibition of vagal reflex pathways, producing dose-dependent bronchodilation at clinical MACs. Desflurane is relatively airway-irritating and may increase airway resistance—avoid it in reactive airways, especially with rapid up-titration. TIVA with propofol (attenuates airway reflexes) and ketamine (bronchodilator) is a valid alternative when volatiles are undesirable (e.g., MH susceptibility), but in active or threatened bronchospasm, deepening a non-pungent volatile often yields the most immediate improvement. Avoid histamine-releasing drugs (e.g., morphine, atracurium) and ensure adequate depth; adjuncts include inhaled β2-agonists, IV lidocaine, and steroids. Ventilation should accommodate longer expiratory times because airway resistance is elevated: $R_{aw} = (P_{peak} - P_{plat})/\\text{flow}$ and the time constant is $\\tau = R \\times C$, so high $R$ mandates a lower respiratory rate and prolonged expiration to prevent air-trapping. Practical rule: in asthmatics with rising $P_{peak}$ and wheeze, first deepen sevoflurane to >1 MAC, deliver albuterol, and avoid desflurane and N2O until the airway stabilizes.",
    "educationalObjective": "Choose maintenance strategies for reactive airways, leveraging volatile bronchodilation versus TIVA with adjuncts."
  },
  {
    "id": "Core.6.3.4",
    "category": "General Anesthesia & Postop",
    "subcategory": "Maintenance: inhaled vs TIVA",
    "difficulty": "hard",
    "questionText": "A 72-kg man with suspected malignant hyperthermia undergoes a 5-hour thoracolumbar decompression with MEP/SEP monitoring. He will be induced supine, then turned prone with both arms tucked. You have a reliable 18G forearm IV and a 20G foot IV; once prone, IV sites will be largely out of view. The hospital recently experienced brief power “flickers,” and your biomedical team notes the anesthesia machine’s auxiliary outlets are not on an uninterruptible power supply. You plan TIVA with propofol and remifentanil and processed EEG monitoring. \n\nWhich of the following is the most appropriate TIVA setup and plan to minimize the risk of awareness from infusion interruption in this case?",
    "answers": [
      {
        "text": "Use separate syringe pumps for propofol (TCI to $C_{eff}$ 3–4 μg/mL) and remifentanil (2–4 ng/mL) connected to a short, low–dead-space manifold secured at the distal IV hub with a separate carrier at 50–75 mL/h; keep the infusion tubing visible after positioning, plug pumps into red (emergency) outlets and confirm ≥2 h internal battery life, use processed EEG, taper remifentanil at dressing and reduce propofol 10–15 min before emergence.",
        "isCorrect": true,
        "explanation": "Distal connection minimizes dead space and flush boluses, a separate low carrier maintains patency without dilutional spikes, and verified emergency power plus internal battery mitigates power loss; processed EEG and a staged taper reduce awareness risk while enabling timely emergence."
      },
      {
        "text": "Y-site both infusions into a single long extension near the pumps with a 250 mL/h carrier to ensure delivery; plug pumps into the anesthesia machine auxiliary outlet; stop both infusions at skin closure and flush the line to speed wake-up.",
        "isCorrect": false,
        "explanation": "A long upstream Y-set increases dead space and risks a large propofol bolus with any flush; machine auxiliary outlets may drop during power transfer; abrupt cessation of both infusions increases awareness and hemodynamic volatility."
      },
      {
        "text": "Gravity-feed propofol through a 200 mm Hg pressure bag and drip chamber to avoid pump failure; run remifentanil by pump; rely on BIS to detect interruptions and keep the carrier off to avoid hypotension.",
        "isCorrect": false,
        "explanation": "Gravity TIVA is unsafe and unreliable; BIS changes lag delivery failure, and no carrier increases the risk of line occlusion and unrecognized infiltration."
      },
      {
        "text": "Place both infusions on an upstream manifold under the drapes at mid-chest with anti-siphon valves and no separate carrier; rely on cuff BP changes to detect infiltration; plug pumps into standard (white) outlets because internal batteries suffice for brief flickers.",
        "isCorrect": false,
        "explanation": "An upstream manifold under the drapes hides the line and increases dead space (delayed onset, flush bolus risk); white outlets may lose power; physiologic changes detect failure late."
      },
      {
        "text": "Position the propofol TCI infusion port 150 cm from the patient to promote mixing and smoother delivery; plug pumps into a power strip mounted on the bed so they remain powered during bed rotation; add 0.5 MAC volatile as backup.",
        "isCorrect": false,
        "explanation": "Long tubing increases dead space and bolus risk; bed-mounted power strips are not a reliable emergency power source; volatile “backup” is contraindicated in MH-susceptible patients."
      }
    ],
    "didactic": "Safe TIVA requires a reliable infusion source, secure and visible IV access, minimized dead space, and assured power. Use syringe pumps (not gravity) on red/emergency outlets and verify internal battery run time (often ≈2–4 h); anesthesia machine auxiliary outlets may not be backed up when the machine is on battery. Connect TIVA via a short, low–dead-space manifold at the distal IV hub with a separate carrier (e.g., 50–75 mL/h) to maintain patency while avoiding large dilutional swings; avoid long upstream Y-sites that create 0.5–2 mL of dead space, which can deliver a dangerous bolus when flushed (e.g., 5 mL residual at 10 mg/mL propofol = 50 mg ≈ 0.7 mg/kg in a 70-kg patient). Use processed EEG to reduce awareness risk and set pump occlusion/low-rate alarms; keep the infusion and IV site visible after positioning and physically secure tubing to prevent traction or disconnection. Induction: bolus and immediately start TCI or weight-based infusions (typical targets: propofol $C_{eff}$ 3–5 μg/mL, remifentanil 2–6 ng/mL), titrating to stimulus and neuromonitoring needs. Emergence: stop remifentanil at dressing (context-sensitive half-time ≈3–5 min) and reduce propofol to $C_{eff}$ 1–2 μg/mL 10–15 min before wake-up; avoid large line flushes. Practical rules: dedicate a lumen to TIVA, minimize dead space, maintain a modest carrier, verify emergency power and batteries, and never rely on gravity for general anesthesia.",
    "educationalObjective": "Construct a safe TIVA plan (induction, maintenance, emergence) including infusion pumps, IV access security, and backup power."
  },
  {
    "id": "Core.6.3.5",
    "category": "General Anesthesia & Postop",
    "subcategory": "Maintenance: inhaled vs TIVA",
    "difficulty": "easy",
    "questionText": "A 45-year-old woman (BMI 28) with a strong history of PONV and mild OSA on CPAP is scheduled for elective laparoscopic sigmoid colectomy on an ERAS colorectal pathway. She is opioid-naïve. Induction is uneventful; BP 118/72 mm Hg, HR 72, SpO2 100% on $F_{i}O_{2}$ 0.5. The surgeon anticipates a 2-hour case and requests minimal bowel distension to maintain pneumoperitoneum. You have access to regional anesthesia and standard adjuncts. Which intraoperative maintenance strategy best supports ERAS goals of opioid-sparing analgesia and early recovery for this patient?",
    "answers": [
      {
        "text": "Propofol TIVA (e.g., 75–125 $\\mu$g·kg⁻¹·min⁻¹) with IV lidocaine $1.5$ mg·kg⁻¹ bolus then $1.5$ mg·kg⁻¹·hr⁻¹, low-dose ketamine $0.2$ mg·kg⁻¹ bolus then $0.1$–$0.3$ mg·kg⁻¹·hr⁻¹, bilateral TAP blocks, scheduled acetaminophen/NSAID, dual PONV prophylaxis; avoid long-acting opioids.",
        "isCorrect": true,
        "explanation": "Propofol TIVA lowers PONV and facilitates rapid recovery; IV lidocaine reduces pain and postoperative ileus in colorectal surgery, and low-dose ketamine plus TAP blocks provide opioid-sparing analgesia without respiratory depression—well aligned with ERAS goals."
      },
      {
        "text": "Sevoflurane $\\approx 1$ MAC with 50% N2O; intermittent hydromorphone (1–2 mg) and a single antiemetic; no regional anesthesia.",
        "isCorrect": false,
        "explanation": "N2O increases PONV and bowel distension, and hydromorphone promotes ileus and sedation; single-agent antiemesis is inadequate for a high-risk patient—contrary to ERAS priorities."
      },
      {
        "text": "Desflurane $\\approx 1$ MAC with remifentanil infusion (0.2 $\\mu$g·kg⁻¹·min⁻¹) throughout; stop remifentanil at closure; no multimodal adjuncts or blocks.",
        "isCorrect": false,
        "explanation": "Although emergence may be rapid, volatile anesthetics increase PONV and remifentanil without multimodal coverage risks opioid-induced hyperalgesia and high postoperative opioid needs—misaligned with opioid-sparing ERAS care."
      },
      {
        "text": "Sevoflurane $0.8$–$1.0$ MAC with bilateral TAP blocks, ketorolac, and acetaminophen, plus a morphine infusion (0.05 mg·kg⁻¹·hr⁻¹) to maintain comfort.",
        "isCorrect": false,
        "explanation": "Regional and non-opioids help, but a continuous morphine infusion undermines opioid-sparing goals and increases risks of ileus and respiratory depression, especially in OSA."
      },
      {
        "text": "Propofol TIVA with high-dose fentanyl (5 $\\mu$g·kg⁻¹ at incision and 3 $\\mu$g·kg⁻¹ hourly); no regional anesthesia; standard single-agent antiemetic.",
        "isCorrect": false,
        "explanation": "While TIVA reduces PONV, large-dose fentanyl opposes ERAS by increasing postoperative opioid needs, sedation, and PONV risk; lack of regional/multimodal support further impairs recovery."
      }
    ],
    "didactic": "ERAS maintenance prioritizes opioid-sparing, low-PONV techniques that enable early extubation, mobilization, and feeding. Propofol TIVA reduces PONV compared with volatile agents and avoids N2O, which increases PONV and bowel distension—key in laparoscopic and colorectal surgery. Multimodal analgesia should pair regional techniques (e.g., TAP blocks) with non-opioids such as acetaminophen and NSAIDs, and adjuncts like low-dose ketamine ($0.1$–$0.3$ mg·kg⁻¹·hr⁻¹) or dexmedetomidine ($0.2$–$0.7$ $\\mu$g·kg⁻¹·hr⁻¹) to limit opioids without respiratory depression. An IV lidocaine regimen (bolus $1$–$1.5$ mg·kg⁻¹ then $1$–$2$ mg·kg⁻¹·hr⁻¹) can reduce pain and postoperative ileus in colorectal ERAS protocols. Avoid long-acting opioids and consider remifentanil only with robust multimodal coverage to mitigate opioid-induced hyperalgesia. Provide multimodal PONV prophylaxis in high-risk patients (e.g., dexamethasone + 5-HT3 antagonist), and use short-acting agents to support fast-track recovery.",
    "educationalObjective": "Coordinate maintenance choices with ERAS goals, emphasizing opioid-sparing and early recovery."
  },
  {
    "id": "Core.6.3.6",
    "category": "General Anesthesia & Postop",
    "subcategory": "Maintenance: inhaled vs TIVA",
    "difficulty": "medium",
    "questionText": "A 62-year-old, 82-kg man undergoes a 4-hour laparoscopic colectomy maintained with TIVA: propofol at 100 mcg/kg/min and remifentanil at 0.08 mcg/kg/min. He has normal hepatic and renal function. Twenty minutes remain until dressing; BIS is 45, hemodynamics are stable, and you plan to extubate at the end of dressing with good analgesia. Considering the context-sensitive half-times of propofol and remifentanil, which emergence plan best targets a timely, smooth extubation with adequate pain control?",
    "answers": [
      {
        "text": "Turn off propofol now, administer hydromorphone 0.6 mg IV now, continue remifentanil through dressing, and stop remifentanil at the start of dressing.",
        "isCorrect": true,
        "explanation": "Propofol’s context-sensitive half-time (CSHT) increases with infusion duration (≈20–30 min after several hours), so turning it off ~20 min before the end allows hypnosis to wane on time. Remifentanil’s duration-independent CSHT (~3–5 min) lets you maintain analgesia until the last noxious stimulus; giving a longer-acting opioid now bridges analgesia when remifentanil is stopped."
      },
      {
        "text": "Turn off remifentanil now, continue propofol at the current rate until skin closure, and give analgesia in PACU.",
        "isCorrect": false,
        "explanation": "Stopping remifentanil first removes analgesia while painful stimulation persists, risking tachycardia and hypertension despite ongoing hypnosis. Delaying analgesia to PACU ignores remifentanil’s very short CSHT and invites emergence pain."
      },
      {
        "text": "Continue both infusions until the end of dressing, then stop them simultaneously to avoid intraoperative awareness.",
        "isCorrect": false,
        "explanation": "Simultaneous discontinuation at the end ignores propofol’s longer CSHT after prolonged infusion and will likely delay awakening and extubation. Awareness risk is low with current dosing and BIS 45; the issue is staggered offset, not simultaneous termination."
      },
      {
        "text": "Reduce both infusions by 50% every 5 minutes over the next 20 minutes and avoid additional opioids to prevent respiratory depression.",
        "isCorrect": false,
        "explanation": "A gradual taper does not overcome propofol’s duration-influenced CSHT and remifentanil will still dissipate within minutes, leaving inadequate analgesia. Avoiding longer-acting opioids disregards the need to bridge remifentanil’s rapid offset."
      }
    ],
    "didactic": "Context-sensitive half-time (CSHT) is the time for plasma concentration to fall by 50% after stopping an infusion and depends on infusion duration due to redistribution into peripheral compartments. Propofol’s CSHT increases with context—roughly ~10–15 min after 1 hour and ~20–30+ min after several hours (often <40 min even after very long cases)—so it should be turned off before the final noxious stimulus to allow timely recovery. Remifentanil’s CSHT is ~3–5 min and largely independent of infusion duration due to rapid esterase metabolism; its effect-site equilibrates quickly ($t_{1/2,ke0}\\approx1$–2 min), so analgesia dissipates within minutes of stopping. Practical approach for long TIVA cases: stop propofol 10–20 min before the end, continue remifentanil to cover closure/dressing, and administer a longer-acting analgesic (e.g., hydromorphone 0.5–1 mg IV or fentanyl 1–2 mcg/kg) 10–20 min before stopping remifentanil. If remifentanil is stopped too early, expect sympathetic responses despite hypnosis; if both are stopped at the end, propofol may delay emergence. Rule of thumb for first-order decay: $t_{1/2}=\\ln(2)/k$ and meaningful clinical recovery often requires on the order of 1–2 CSHTs, guiding the staggered timing of discontinuation.",
    "educationalObjective": "Explain context-sensitive half-times of propofol and remifentanil and how they shape emergence timelines."
  },
  {
    "id": "Core.6.3.7",
    "category": "General Anesthesia & Postop",
    "subcategory": "Maintenance: inhaled vs TIVA",
    "difficulty": "medium",
    "questionText": "A 45-year-old ASA II man is undergoing a 3-hour laparoscopic colectomy with a circle system and active scavenging to wall vacuum. After IV induction and intubation, maintenance is desflurane 6% in air/oxygen at fresh gas flow (FGF) 3 L/min; end-tidal $CO_2$ is 34 mm Hg, MAP 78 mm Hg, and he is hemodynamically stable. The surgeon requests a deep plane for insufflation, and there are no contraindications to TIVA. You want to minimize the environmental impact of the anesthetic while maintaining adequate depth.\n\nWhich management change would most effectively reduce the greenhouse gas emissions of this case?",
    "answers": [
      {
        "text": "Switch to total intravenous anesthesia (propofol infusion) with air/oxygen and discontinue inhaled agents",
        "isCorrect": true,
        "explanation": "Eliminating volatile anesthetics removes the major source of greenhouse emissions from the anesthetic; propofol has negligible direct global warming impact compared with halogenated agents. This yields a larger reduction than simply lowering FGF or switching to a lower-GWP volatile."
      },
      {
        "text": "Keep desflurane but reduce FGF to 0.5–1 L/min after equilibration",
        "isCorrect": false,
        "explanation": "Lowering FGF proportionally reduces volatile consumption, but desflurane’s very high GWP (~2540 $CO_2$e) means substantial emissions persist. This improves but does not outperform eliminating volatiles altogether."
      },
      {
        "text": "Switch to sevoflurane at 1 MAC with FGF 0.5–1 L/min and avoid $N_2O$",
        "isCorrect": false,
        "explanation": "Sevoflurane has a much lower GWP (~130 $CO_2$e) and low-flow anesthesia markedly decreases emissions, but volatile use still emits greenhouse gases. TIVA produces an even larger reduction by avoiding volatiles entirely."
      },
      {
        "text": "Add 50% $N_2O$ to reduce desflurane requirements and keep FGF at 2 L/min",
        "isCorrect": false,
        "explanation": "Although $N_2O$ lowers desflurane consumption, $N_2O$ itself has a high GWP (~298 $CO_2$e) and long atmospheric lifetime, often increasing the net footprint."
      },
      {
        "text": "Increase active scavenging vacuum to maximize waste-gas removal from the OR",
        "isCorrect": false,
        "explanation": "Scavenging protects staff from exposure but vents anesthetic gases to the environment; it does not decrease greenhouse emissions unless coupled to capture/recycling systems, which standard active scavenging is not."
      }
    ],
    "didactic": "Volatile anesthetics dominate the perioperative greenhouse footprint; choosing not to use them (TIVA) usually provides the largest reduction in emissions. If using inhaled agents, avoid desflurane (GWP100 ≈ 2540 $CO_2$e) and $N_2O$ (≈ 298), and prefer sevoflurane (≈ 130) or isoflurane (≈ 510) while minimizing FGF after equilibration. Volatile consumption scales with flow and concentration; a useful rule is $mL_{liquid}/h \\approx 3 \\times \\text{FGF (L/min)} \\times \\text{vol\\%}$, so cutting FGF from 2 to 0.5 L/min reduces agent use by ~75%. Active scavenging reduces occupational exposure but does not mitigate climate impact because gases are vented outdoors; only capture/recycling systems change that. Practical steps: avoid $N_2O$, avoid desflurane, use low-flow (0.5–1 L/min) circle anesthesia with vigilant monitoring of $FiO_2$, inspired agent, and $CO_2$ absorbent status, or choose TIVA when clinically appropriate. After induction/denitrogenation, lowering FGF and selecting a low-GWP agent substantially decrease emissions while maintaining stable anesthesia.",
    "educationalObjective": "Minimize environmental impact by understanding fresh gas flow, agent selection, and scavenging implications."
  },
  {
    "id": "Core.6.3.8",
    "category": "General Anesthesia & Postop",
    "subcategory": "Maintenance: inhaled vs TIVA",
    "difficulty": "medium",
    "questionText": "A 62-year-old man (90 kg) on lisinopril presents for laparoscopic cholecystectomy. After induction with propofol, fentanyl 100 mcg, and rocuronium, anesthesia is maintained with sevoflurane (end-tidal 2.3%) in air/O2 at FGF 2 L/min; no additional opioids have been given. Ten minutes later, just before incision, his BP is 78/46 mm Hg (MAP 57), HR 58 bpm, SpO2 99%, EtCO2 34 mm Hg, and processed EEG (BIS) is 32. The surgeon plans to incise in 2 minutes. Which is the most appropriate next step to improve blood pressure while maintaining adequate anesthesia?",
    "answers": [
      {
        "text": "Reduce end-tidal sevoflurane to ~0.8–1.0 MAC and administer fentanyl 1 mcg/kg IV",
        "isCorrect": true,
        "explanation": "This balances hypnosis/analgesia: lowering volatile dose reverses vasodilation/myocardial depression driving hypotension, while an opioid blunts surgical nociception so anesthetic depth remains adequate. With a BIS of 32 and high ET sevo (age-adjusted >1 MAC), dose reduction plus opioid is the most direct way to restore MAP without under-anesthetizing."
      },
      {
        "text": "Administer phenylephrine 100 mcg IV and maintain the current anesthetic",
        "isCorrect": false,
        "explanation": "A vasopressor can transiently raise MAP, but maintaining excessive anesthetic depth (BIS 32, high ET sevo) perpetuates the root cause of hypotension. This approach risks masking volatile overdose and does not optimize balanced anesthesia."
      },
      {
        "text": "Increase sevoflurane to 2 MAC to ensure immobility at incision",
        "isCorrect": false,
        "explanation": "Further increasing volatile deepens vasodilation and myocardial depression, worsening hypotension. Adequate analgesia with reduced volatile is safer than escalating hypnotic dose when MAP is already low."
      },
      {
        "text": "Give 500 mL lactated Ringer’s and wait for recovery",
        "isCorrect": false,
        "explanation": "Crystalloid alone is slow and unlikely to correct volatile-induced hypotension in the next 2 minutes. It also fails to address excessive anesthetic depth and impending nociceptive stimulus."
      },
      {
        "text": "Switch to propofol TIVA (e.g., 150 mcg/kg/min) and discontinue sevoflurane",
        "isCorrect": false,
        "explanation": "Propofol also reduces SVR and contractility and often worsens hypotension, particularly immediately post-induction and in patients on ACE inhibitors. Swapping one vasodilatory hypnotic for another does not fix the hemodynamic problem or provide balanced analgesia."
      }
    ],
    "didactic": "Volatile anesthetics and propofol both decrease MAP via vasodilation and dose-dependent myocardial depression; opioids reduce MAC and blunt sympathetic responses with minimal effect on SVR. In hypotension with clear evidence of excessive depth (e.g., low BIS, high end-tidal volatile), first reduce the hypnotic/volatile dose and add analgesia rather than treating solely with vasopressors. Balanced anesthesia leverages adjuncts (opioids, ketamine, dexmedetomidine, regional) to allow lower hypnotic/volatile doses and more stable hemodynamics. A practical approach is to target ~0.7–1.0 age-adjusted MAC for hypnosis and add opioid just before noxious stimuli; consider low-dose vasopressor support if MAP remains low after correcting depth. For multiple agents, approximate total anesthetic effect with MAC fractions: $\\text{MAC}_{\\text{fraction}}\\approx\\sum \\tfrac{ET\\%}{\\text{MAC}_{\\text{agent}}}$; excessive combined fractions correlate with hypotension. Rule of thumb: if MAP is low and BIS is low, lighten the anesthetic and add analgesia; if MAP is low with appropriate depth, use vasoactive support and assess volume/reserve.",
    "educationalObjective": "Mitigate hypotension from volatiles or propofol using balanced anesthesia (opioids, adjuncts) and vasoactive support."
  },
  {
    "id": "Core.6.3.9",
    "category": "General Anesthesia & Postop",
    "subcategory": "Maintenance: inhaled vs TIVA",
    "difficulty": "hard",
    "questionText": "A 55-year-old man with biopsy-proven malignant hyperthermia susceptibility undergoes laparoscopic colectomy using TIVA: propofol TCI (target effect-site $C_e$ 3.5 mcg/mL, Schnider model) and remifentanil 0.15 mcg/kg/min. He is paralyzed with a rocuronium infusion (0/4 TOF at the orbicularis). For the first 90 minutes, the processed EEG index is 40–50. During pneumoperitoneum, the index rises to 70–75 with increased EMG activity; HR and BP remain stable on phenylephrine 0.5 mcg/min. End-tidal agent reads 0.0 MAC. The hand IV site looks slightly puffy and cool; the propofol syringe and pump display appear to be running normally. Which action best minimizes the immediate risk of intraoperative awareness in this patient?\n",
    "answers": [
      {
        "text": "Deliver a propofol 1 mg/kg IV bolus via a confirmed patent IV and re-establish a dedicated hypnotic infusion (replace the infiltrated line).",
        "isCorrect": true,
        "explanation": "A prompt propofol bolus through a verified patent IV rapidly restores hypnosis (propofol $t_{1/2ke0}\\approx2$–3 min) and addresses the most likely cause—failed drug delivery from IV infiltration. Re-establishing a reliable, dedicated line prevents recurrent underdosing and best reduces awareness risk."
      },
      {
        "text": "Increase remifentanil to 0.3 mcg/kg/min while maintaining the current propofol target.",
        "isCorrect": false,
        "explanation": "Opioids reduce nociception but do not ensure unconsciousness; raising remifentanil treats sympathetic responses yet does not correct inadequate hypnotic delivery. This choice risks awake paralysis if propofol is not reaching the patient."
      },
      {
        "text": "Administer midazolam 2 mg IV and continue the current infusions unchanged.",
        "isCorrect": false,
        "explanation": "A small benzodiazepine dose may provide anterograde amnesia but has unreliable and delayed hypnotic effect in this setting; it does not fix a delivery failure. Relying on midazolam while propofol is not reaching the patient risks awareness."
      },
      {
        "text": "Give an additional 50 mg rocuronium to suppress EMG and drive the processed EEG index <60.",
        "isCorrect": false,
        "explanation": "Neuromuscular blockade can reduce EMG artifact and lower the index numerically without increasing hypnosis. This masks movement and may falsely reassure while the patient remains conscious if hypnotic delivery is inadequate."
      },
      {
        "text": "Add N2O 50% to the carrier gas and continue the current TIVA rates.",
        "isCorrect": false,
        "explanation": "N2O is MH-safe but provides limited hypnotic effect and may worsen bowel distension in colorectal surgery. It does not address the likely infiltration and is insufficient to reliably prevent awareness during inadequate propofol delivery."
      }
    ],
    "didactic": "Awareness risk is higher with TIVA because there is no continuous end-tidal measure of hypnotic depth; prevention hinges on validated propofol regimens and rigorous delivery assurance. Use a dedicated IV for hypnotic infusion, visible tubing, anti-free-flow valves, appropriate occlusion alarms, and frequent site checks; infiltration may not trigger pump alarms. When light anesthesia is suspected during TIVA, the safest immediate step is to deliver a propofol bolus via a confirmed patent IV and promptly restore a reliable infusion; typical maintenance is propofol 100–200 mcg/kg/min or TCI $C_e$ 3–5 mcg/mL with an opioid. Processed EEG targets of 40–60 are useful adjuncts, but interpret with context: EMG, electrocautery, ketamine, and N2O can artifactually raise or alter the index, while neuromuscular blockade can lower it without increasing hypnosis. Remember propofol effect-site equilibration is rapid ($t_{1/2ke0}\\approx2$–3 min), enabling effective rescue boluses of 0.5–1 mg/kg. Opioids and neuromuscular blockers do not prevent awareness; benzodiazepines are adjuncts, not a fix for delivery failure.",
    "educationalObjective": "Prevent awareness during TIVA with validated infusion regimens, vigilant pump checks, and processed EEG when appropriate."
  },
  {
    "id": "Core.6.3.10",
    "category": "General Anesthesia & Postop",
    "subcategory": "Maintenance: inhaled vs TIVA",
    "difficulty": "hard",
    "questionText": "A 58-year-old man with a 7-cm frontal meningioma and 6-mm midline shift undergoes craniotomy. After bone flap removal, the dura appears tense and bulging. He is maintained on sevoflurane 1.2 MAC in air/O2 with a remifentanil infusion; head is elevated, PEEP is 0 cm H2O, and ventilation targets ETCO2 29–30 mm Hg (ABG PaCO2 31 mm Hg). Hemodynamics are stable (BP 128/72 mm Hg, HR 66 bpm). The surgeon requests a \"softer\" brain to facilitate dural opening.\n\nWhich change to the anesthetic maintenance regimen would best reduce intracranial pressure (ICP) and improve brain relaxation in this patient?",
    "answers": [
      {
        "text": "Discontinue sevoflurane and maintain anesthesia with a propofol-based TIVA plus opioid",
        "isCorrect": true,
        "explanation": "Propofol lowers $CMRO_2$, causes cerebral vasoconstriction, and reduces $CBF$ and cerebral blood volume, thereby decreasing ICP, while preserving CO2 reactivity and autoregulation. Converting to propofol (or adding a propofol infusion and reducing volatile to ≤0.5 MAC) reliably improves brain relaxation in mass-lesion cases."
      },
      {
        "text": "Increase sevoflurane from 1.2 MAC to 1.8 MAC to further reduce $CMRO_2$",
        "isCorrect": false,
        "explanation": "At ≥1 MAC, volatile-induced cerebral vasodilation uncouples flow from metabolism, increasing $CBF$ and cerebral blood volume, which can raise ICP despite lower $CMRO_2$. Higher MAC also impairs autoregulation, worsening brain swelling."
      },
      {
        "text": "Switch to isoflurane at 1.0 MAC for its cerebroprotective profile",
        "isCorrect": false,
        "explanation": "All modern volatiles dose-dependently vasodilate cerebral vessels and can increase ICP; isoflurane is not superior to propofol for brain relaxation. Propofol better preserves autoregulation and lowers $CBF$/ICP via vasoconstriction."
      },
      {
        "text": "Add 50% N2O and reduce sevoflurane to 0.7 MAC to maintain depth with less volatile",
        "isCorrect": false,
        "explanation": "N2O increases $CBF$ and ICP via cerebral vasodilation and may worsen brain tension; it also risks pneumocephalus expansion. Reducing sevoflurane does not offset nitrous’ ICP-raising effect."
      },
      {
        "text": "Keep sevoflurane at 1.2 MAC and increase the remifentanil infusion substantially",
        "isCorrect": false,
        "explanation": "Opioids have minimal direct effect on $CMRO_2$ and $CBF$ and do not reliably lower ICP. Leaving the volatile unchanged maintains the primary driver of cerebral vasodilation and elevated ICP in this setting."
      }
    ],
    "didactic": "Volatile agents produce dose-dependent decreases in $CMRO_2$ but also direct cerebral vasodilation that increases $CBF$ and cerebral blood volume, raising ICP; at ≥~1 MAC this vasodilation can uncouple flow from metabolism. In contrast, propofol reduces $CMRO_2$ and causes cerebral vasoconstriction, lowering $CBF$ and ICP while preserving CO2 reactivity and cerebral autoregulation—properties that improve brain relaxation in mass lesions. A practical rule: for intracranial pathology with elevated ICP, prefer propofol-based TIVA or keep volatile ≤0.5 MAC and supplement with opioid/propofol to maintain depth. Avoid N2O because it increases $CBF$/ICP and can expand trapped air. CO2 reactivity is typically preserved with both propofol and volatiles, but excessive hyperventilation is a temporizing measure and risks ischemia; targeting PaCO2 ~30–35 mm Hg is common. Remember $CPP = MAP - ICP$; strategies that reduce ICP without compromising MAP best preserve cerebral perfusion. Volatiles also depress evoked potentials in a dose-dependent fashion, whereas propofol-based TIVA better supports neurophysiologic monitoring.",
    "educationalObjective": "Tailor maintenance for neurosurgery by comparing effects of volatiles versus propofol on CMRO₂, CBF, and ICP."
  },
  {
    "id": "Core.6.3.11",
    "category": "General Anesthesia & Postop",
    "subcategory": "Maintenance: inhaled vs TIVA",
    "difficulty": "medium",
    "questionText": "A 72-year-old man (ASA III) is undergoing open inguinal hernia repair under general anesthesia with a circle system. Ten minutes after induction and just after skin incision, his BP rises from 110/65 to 160/85 mm Hg and HR from 65 to 95 bpm with tearing noted. He is mechanically ventilated (EtCO2 35 mm Hg). Fresh gas flow (FGF) is 1 L/min (50% O2/air). The sevoflurane vaporizer is set at 2.0%, and the monitor displays end-tidal sevoflurane 1.1% with age-adjusted MAC 0.8. Fentanyl 100 mcg was given 20 minutes earlier.\n\nWhich of the following is the most appropriate next step to rapidly achieve adequate anesthetic depth?",
    "answers": [
      {
        "text": "Increase FGF to 6–8 L/min and raise the sevoflurane dial to target an age-adjusted end-tidal MAC of about 1.0–1.2 while monitoring hemodynamics.",
        "isCorrect": true,
        "explanation": "This directly titrates to brain-effect by using end-tidal MAC-age and speeds alveolar concentration change via higher FGF (shorter circuit time constant, $\\tau=V/\\text{FGF}$). It addresses inadequate volatile depth promptly and safely."
      },
      {
        "text": "Increase the sevoflurane dial to 3.5% while keeping FGF at 1 L/min until BP and HR normalize.",
        "isCorrect": false,
        "explanation": "Focusing on dial setting alone ignores that at low FGF the alveolar/end-tidal concentration will rise slowly; once it finally equilibrates, depth may overshoot and cause hypotension. Titration should be guided by end-tidal MAC-age, with FGF increased to change ET quickly."
      },
      {
        "text": "Administer labetalol 10 mg IV to treat hypertension without changing the anesthetic.",
        "isCorrect": false,
        "explanation": "This treats the symptom but leaves inadequate anesthetic depth (ET MAC-age 0.8) and risks awareness. First correct volatile depth using end-tidal MAC-age; adjuncts for hemodynamics can follow if needed."
      },
      {
        "text": "Give fentanyl 50 mcg IV and maintain current vaporizer and flows.",
        "isCorrect": false,
        "explanation": "Opioid can blunt nociception, but the volatile depth is subtherapeutic for this 72-year-old (ET MAC-age 0.8). Correcting age-adjusted ET MAC promptly is primary; opioid can be added as needed once volatile depth is adequate."
      },
      {
        "text": "Wait 3–5 minutes for the current dial setting to equilibrate before intervening.",
        "isCorrect": false,
        "explanation": "At FGF 1 L/min, the circle time constant is long ($\\tau=V/\\text{FGF}$), so end-tidal concentration will change slowly. Given active sympathetic responses, delaying intervention is unsafe; increase FGF and titrate to ET MAC-age now."
      }
    ],
    "didactic": "End-tidal volatile concentration is the best readily available proxy for brain partial pressure; titration should be based on end-tidal MAC adjusted for age and clinical signs, not vaporizer dial setting. MAC decreases roughly 6% per decade after age 40, so older adults require less agent; a practical target during moderate stimulation is ET MAC-age ≈0.8–1.2. When a rapid change in anesthetic depth is needed, increase both vaporizer concentration and fresh gas flow to accelerate alveolar concentration change; the circle system time constant follows $\\tau = V/\\text{FGF}$, so higher FGF shortens $\\tau$. Hemodynamic or somatic signs (tachycardia, hypertension, lacrimation, movement) suggest inadequate depth or analgesia and should prompt adjustment of end-tidal MAC-age before relying on antihypertensives. Uptake factors (cardiac output, solubility, alveolar ventilation) affect how quickly end-tidal approaches the dialed concentration, reinforcing the need to use the measured ET value. When multiple agents are used (e.g., N2O plus volatile), MAC fractions are additive; titrate the sum to the clinical context.",
    "educationalObjective": "Titrate volatile depth using end-tidal MAC adjusted for age and clinical signs rather than dial setting alone."
  },
  {
    "id": "Core.6.3.12",
    "category": "General Anesthesia & Postop",
    "subcategory": "Maintenance: inhaled vs TIVA",
    "difficulty": "hard",
    "questionText": "A 40-year-old, 80-kg patient is undergoing laparoscopic cholecystectomy with a circle system. After denitrogenation for 10 minutes at 4 L/min with FiO2 0.5, you reduce fresh gas flow (FGF) to 0.5 L/min using O2/air (FiO2 0.5) and sevoflurane 2.2%. Twenty minutes later, continuous gas monitoring shows: inspired O2 falling from 0.50 to 0.32, inspired N2 rising to 0.12, end-tidal CO2 35 mm Hg, and stable tidal volumes without evidence of a circuit leak; SpO2 remains 100% on PEEP 5 cm H2O. You wish to continue low-flow anesthesia. Which adjustment is most appropriate to maintain safe oxygenation now?\n\n",
    "answers": [
      {
        "text": "Increase FiO2 to 0.8 while maintaining FGF at 0.5 L/min",
        "isCorrect": true,
        "explanation": "At low flows, oxygen delivery to the circuit equals $FiO_2 \\times FGF$. With FGF 0.5 L/min, raising FiO2 to 0.8 provides 0.4 L/min (400 mL/min) of O2, exceeding adult $\\dot V O_2$ (~200–250 mL/min) and countering dilution from tissue N2 washout, while preserving low-flow anesthesia."
      },
      {
        "text": "Increase FGF to 2 L/min for the remainder of the case while keeping FiO2 0.5",
        "isCorrect": false,
        "explanation": "This would increase O2 delivery and wash out N2, but unnecessarily abandons low-flow anesthesia; the problem can be solved by increasing FiO2 at the same low FGF. Brief re-denitrogenation is reasonable if needed, but maintaining high FGF for the rest of the case is not required."
      },
      {
        "text": "Add 50% N2O at the same FGF to maintain MAC while reducing O2 needs",
        "isCorrect": false,
        "explanation": "N2O reduces volatile MAC but does not reduce metabolic O2 consumption and displaces O2 in the carrier gas. At low flows, waning N2O uptake later in the case can further lower inspired O2, worsening the problem."
      },
      {
        "text": "Increase sevoflurane concentration to 3.5% while maintaining current FGF and FiO2",
        "isCorrect": false,
        "explanation": "Changing volatile concentration does not increase O2 delivery ($FiO_2 \\times FGF$). The falling inspired O2 is due to O2 supply being near $\\dot V O_2$ and dilution by N2 washout, not inadequate anesthetic depth."
      },
      {
        "text": "Replace the CO2 absorbent and perform a system leak test before changing gas settings",
        "isCorrect": false,
        "explanation": "There is no evidence of absorbent exhaustion (ETCO2 normal) or a significant leak (stable volumes/pressures). Immediate correction of inspired O2 is safer; leak checks and absorbent changes are not the primary issue causing the FiO2 decline."
      }
    ],
    "didactic": "In low-flow anesthesia, oxygen delivery to the circuit is $\\text{O2 inflow} = FiO_2 \\times FGF$ (in L/min), which must exceed the patient’s metabolic O2 consumption ($\\dot V O_2$ ~200–250 mL/min in adults) with a safety margin. Early in maintenance, ongoing tissue N2 washout can dilute circuit gases and drive inspired O2 down, especially when $FiO_2 \\times FGF$ approaches $\\dot V O_2$ (e.g., 0.5 L/min × 0.5 = 250 mL/min). Practical rules: when FGF \\le 0.5–0.6 L/min, set FiO2 high (often 0.7–1.0) and closely track inspired O2; use continuous agent and O2 analyzers, and ensure a leak-free circle. If inspired O2 drifts down, first increase FiO2 (and/or briefly increase FGF to re-denitrogenate) rather than abandoning low-flow. N2O does not spare O2 consumption and can worsen FiO2 trends at low flow as its uptake wanes. With modern, non–strong-base absorbents (e.g., Amsorb), sevoflurane is safe at low flows; the limiting factor is oxygen supply, not compound A.",
    "educationalObjective": "Use low fresh gas flows safely during volatile maintenance with continuous gas monitoring and leak-free circuits."
  },
  {
    "id": "Core.6.4.1",
    "category": "General Anesthesia & Postop",
    "subcategory": "PACU complications and management",
    "difficulty": "easy",
    "questionText": "A 72-year-old man with benign prostatic hyperplasia and well-controlled hypertension undergoes laparoscopic inguinal hernia repair under general anesthesia. He received neostigmine 3 mg with glycopyrrolate 0.6 mg for reversal and 2 L of crystalloid; no neuraxial anesthesia was used. Ninety minutes after arrival to the PACU, his BP is 182/96 mm Hg and HR is 112 bpm. He is afebrile, SpO2 98% on 2 L/min nasal cannula, and RR 16/min. He is alert, denies incisional pain, and repeatedly states he “really needs to urinate.” Exam reveals a tender, distended suprapubic area. A bedside bladder scan measures 850 mL. Which of the following is the most appropriate immediate intervention to control his hypertension and tachycardia?",
    "answers": [
      {
        "text": "Straight catheterization to decompress the bladder",
        "isCorrect": true,
        "explanation": "Bladder distention triggers a sympathetic surge (tachycardia and hypertension); prompt decompression directly treats the cause and rapidly normalizes hemodynamics. Volumes >400–600 mL on bladder scan typically warrant catheterization, especially in high-risk patients (BPH, anticholinergics, opioids)."
      },
      {
        "text": "Labetalol 10 mg IV",
        "isCorrect": false,
        "explanation": "This treats the numbers but not the cause; masking the sympathetic response without relieving obstruction leaves the precipitant unaddressed and risks urinary complications."
      },
      {
        "text": "Hydromorphone 0.5 mg IV",
        "isCorrect": false,
        "explanation": "Opioids are appropriate for pain-mediated hypertension, but this patient denies incisional pain and has classic urinary retention. Opioids may worsen retention and add sedation/respiratory risk."
      },
      {
        "text": "Dexmedetomidine infusion 0.2–0.4 mcg/kg/h",
        "isCorrect": false,
        "explanation": "Useful for withdrawal-related sympathetic activation, but the presentation (suprapubic fullness, large bladder volume) indicates urinary retention, which sedation will not correct."
      },
      {
        "text": "Administer an additional 500 mL crystalloid bolus and observe",
        "isCorrect": false,
        "explanation": "Additional fluids can worsen bladder distention. In established postoperative urinary retention, timely decompression is indicated rather than watchful waiting."
      }
    ],
    "didactic": "In the PACU, new-onset hypertension and tachycardia should prompt a search for reversible sympathetic stimuli: pain, hypoxia/hypercarbia, shivering, bladder distention, or withdrawal. Postoperative urinary retention is common with BPH, anticholinergics (e.g., glycopyrrolate), opioids, and large fluid loads. Bladder scan volumes >400–600 mL generally merit catheterization; decompression rapidly reduces the sympathetic surge and improves vitals. Treat the cause first rather than reflexively administering antihypertensives or sedatives, which may mask symptoms and delay definitive care. Opioids are appropriate when pain is the driver but can worsen retention. For suspected withdrawal, targeted agents (e.g., benzodiazepines for alcohol, clonidine/dexmedetomidine for sympatholysis) are preferred. A practical rule: identify and reverse the stimulus; treat the numbers only if hemodynamics remain unsafe after addressing the cause.",
    "educationalObjective": "Control hypertension and tachycardia due to pain, bladder distention, or withdrawal with targeted therapy."
  },
  {
    "id": "Core.6.4.2",
    "category": "General Anesthesia & Postop",
    "subcategory": "PACU complications and management",
    "difficulty": "medium",
    "questionText": "A 54-year-old man (95 kg, BMI 32) is in the PACU 15 minutes after laparoscopic cholecystectomy under general anesthesia with rocuronium for neuromuscular blockade. The last rocuronium dose (20 mg) was given 35 minutes before extubation. No reversal was administered. He is arousable but weak with shallow respirations (RR 8/min), intermittent upper-airway obstruction relieved by a jaw thrust, SpO2 94% on 6 L/min via simple face mask, and nasal capnography shows elevated EtCO2. Pupils are mid-size and reactive. Quantitative acceleromyography at the adductor pollicis shows a TOF count of 4/4 with a TOF ratio of $0.45$. Hemodynamics are stable. Which intervention is the most appropriate to reverse the underlying cause of his hypoventilation?",
    "answers": [
      {
        "text": "Administer sugammadex 2 mg/kg IV now",
        "isCorrect": true,
        "explanation": "A TOF ratio $<0.9$ after rocuronium indicates residual blockade; with TOF count 4 and TOF ratio $0.45$ (moderate block), sugammadex $2\\,\\text{mg/kg}$ rapidly restores neuromuscular transmission to TOF ratio $\\ge 0.9$ within minutes."
      },
      {
        "text": "Administer sugammadex 4 mg/kg IV now",
        "isCorrect": false,
        "explanation": "$4\\,\\text{mg/kg}$ is indicated for deep block (TOF count 0 with post-tetanic count 1–2). It will work but is not the most appropriate dose for moderate residual block and represents unnecessary overtreatment."
      },
      {
        "text": "Administer neostigmine 50 mcg/kg IV with glycopyrrolate 10 mcg/kg",
        "isCorrect": false,
        "explanation": "While neostigmine can reverse shallow–moderate block when TOF count is 4, it is slower and less reliable at a TOF ratio of $\\approx 0.45$ and has a ceiling effect; in a symptomatic PACU patient after rocuronium, sugammadex provides faster, more predictable reversal."
      },
      {
        "text": "Apply BiPAP and observe",
        "isCorrect": false,
        "explanation": "Noninvasive ventilation may temporize hypoventilation but does not treat residual neuromuscular blockade and risks aspiration in a weak patient; definitive reversal is indicated."
      },
      {
        "text": "Administer naloxone 0.4 mg IV",
        "isCorrect": false,
        "explanation": "Opioid-induced hypoventilation would not explain a quantitative TOF ratio of $0.45$. Naloxone would not correct neuromuscular transmission and may precipitate pain and hypertension."
      }
    ],
    "didactic": "Residual neuromuscular blockade is common and clinically important; safe recovery requires a quantitative TOF ratio $\\ge 0.9$ (ideally $\\ge 1.0$ with acceleromyography). Clinical tests (head lift, tidal volume) are insensitive to residual block. Depth-specific reversal is key: for rocuronium/vecuronium, give sugammadex $2\\,\\text{mg/kg}$ for moderate block (TOF count $\\ge 2$), $4\\,\\text{mg/kg}$ for deep block (TOF count 0 with PTC 1–2), and $16\\,\\text{mg/kg}$ for immediate reversal after large intubating doses. Neostigmine $40$–$70\\,\\mu\\text{g/kg}$ with an antimuscarinic (e.g., glycopyrrolate $10$–$20\\,\\mu\\text{g/kg}$) requires a TOF count of 4 and has a ceiling effect with slower, less predictable recovery; it should not be used for deep block. In a symptomatic PACU patient, provide airway support and oxygen while administering the appropriate reversal based on quantitative monitoring. Dose sugammadex to actual body weight and avoid in severe renal failure when possible, as the drug–complex is renally excreted.",
    "educationalObjective": "Detect residual neuromuscular blockade with quantitative monitoring and administer appropriate reversal or support ventilation."
  },
  {
    "id": "Core.6.4.3",
    "category": "General Anesthesia & Postop",
    "subcategory": "PACU complications and management",
    "difficulty": "medium",
    "questionText": "A 64-year-old man is 30 minutes post-extubation in the PACU after an uneventful laparoscopic cholecystectomy. He received fentanyl 200 mcg and hydromorphone 0.8 mg during the case. He is somnolent, arouses to voice, answers briefly, and falls back asleep. Vitals: BP 138/78 mm Hg, HR 58/min, RR 6/min, SpO2 86% on room air. Pupils are 2 mm and reactive; lungs are clear without crackles or wheeze; there is no chest pain. Nasal capnography shows ETCO2 56 mm Hg with low-amplitude waveforms. An ABG on room air shows: pH 7.25, PaCO2 60 mm Hg, PaO2 55 mm Hg. Using the alveolar gas equation $P_{AO_2}=FiO_2(P_b-P_{H_2O})-\\frac{PaCO_2}{R}$, his A–a gradient is approximately normal for age (expected ≈ age/4 + 4 ≈ 20 mm Hg).\n\nWhich intervention is the most appropriate next step in management?",
    "answers": [
      {
        "text": "Titrate IV naloxone in 20–40 mcg boluses to restore adequate ventilation while monitoring for acute pain and renarcotization",
        "isCorrect": true,
        "explanation": "Somnolence, bradypnea, miotic pupils, elevated PaCO2, and a near-normal A–a gradient indicate opioid-induced hypoventilation. Targeted reversal with small, titrated doses of naloxone addresses the cause (ventilatory depression) rather than only treating hypoxemia."
      },
      {
        "text": "Initiate CPAP at 10 cm H2O with 40% O2 to treat presumed postoperative atelectasis",
        "isCorrect": false,
        "explanation": "Atelectasis causes V/Q mismatch with an increased A–a gradient; CPAP can help when that is the mechanism. Here the normal A–a gradient and marked hypercapnia point to pure hypoventilation, which CPAP alone will not correct."
      },
      {
        "text": "Administer IV furosemide 20 mg for suspected cardiogenic pulmonary edema",
        "isCorrect": false,
        "explanation": "Pulmonary edema presents with crackles, pink frothy sputum, and an elevated A–a gradient on ABG. Clear lungs and a normal A–a gradient make edema unlikely; diuresis does not address opioid-induced ventilatory depression."
      },
      {
        "text": "Order CT pulmonary angiography to evaluate for pulmonary embolism",
        "isCorrect": false,
        "explanation": "Acute PE typically increases dead space (low ETCO2 relative to PaCO2) and raises the A–a gradient; patients are usually tachycardic and tachypneic. Immediate stabilization and reversal of hypoventilation take precedence, and the data do not support PE here."
      },
      {
        "text": "Perform alveolar recruitment maneuvers and increase PEEP to improve oxygenation",
        "isCorrect": false,
        "explanation": "Recruitment/PEEP treats atelectasis-related shunt/V–Q mismatch (elevated A–a gradient). The primary problem is opioid-induced hypoventilation with a normal A–a gradient; improving oxygenation without restoring ventilation risks worsening hypercapnia."
      }
    ],
    "didactic": "A stepwise approach to PACU hypoxemia distinguishes hypoventilation from V/Q mismatch, shunt, and edema. The A–a gradient helps: hypoventilation has a normal A–a gradient, while V/Q mismatch, shunt (atelectasis), edema, and PE elevate it. Use the alveolar gas equation $P_{AO_2}=FiO_2(P_b-P_{H_2O})-\\frac{PaCO_2}{R}$ (with $R\\approx0.8$) and the rule of thumb for expected A–a: ≈ age/4 + 4 (mm Hg). Opioid-induced hypoventilation presents with somnolence, bradypnea, elevated PaCO2, and often miotic pupils; treatment is restoration of ventilation—titrate naloxone in small aliquots (e.g., 20–40 mcg IV) to avoid abrupt pain and hypertension, with monitoring for renarcotization. Atelectasis is the most common postoperative cause of hypoxemia but typically raises the A–a gradient and responds to recruitment/CPAP, incentive spirometry, and early mobilization. PE often shows tachycardia, pleuritic pain, increased dead space (low ETCO2 with normal or rising PaCO2), and an increased A–a gradient; pulmonary edema features crackles and responds to PEEP and, when cardiogenic, diuresis. Always provide supportive oxygen and airway maneuvers, but target therapy to the mechanism suggested by physiology.",
    "educationalObjective": "Evaluate hypoxemia using a stepwise differential (atelectasis, hypoventilation, PE, edema) and targeted treatments."
  },
  {
    "id": "Core.6.4.4",
    "category": "General Anesthesia & Postop",
    "subcategory": "PACU complications and management",
    "difficulty": "medium",
    "questionText": "A 78-year-old man with hypertension and mild cognitive impairment undergoes laparoscopic cholecystectomy under sevoflurane anesthesia. He received acetaminophen 1 g and fentanyl 100 mcg intraoperatively; neuromuscular blockade was reversed and extubation was uneventful. Ten minutes after PACU arrival he is agitated, pulling at his IV, and not following commands. Vitals: BP 165/95 mm Hg, HR 105/min, RR 18/min, SpO2 97% on 3 L/min O2 by nasal cannula. Nasal capnography shows EtCO2 38 mm Hg. Point-of-care glucose is 110 mg/dL; temperature is 36.6°C. He grimaces with light palpation near the trocar sites and moans when repositioned. Pupils are equal/reactive; no focal deficits; Foley is draining clear urine. Which of the following is the most appropriate initial management to address his condition?",
    "answers": [
      {
        "text": "Provide verbal reorientation, ensure glasses/hearing aids are in place, and titrate small IV opioid doses (e.g., fentanyl 25 mcg) to treat pain while avoiding benzodiazepines",
        "isCorrect": true,
        "explanation": "This presentation is consistent with emergence delirium likely exacerbated by pain. First-line management is nonpharmacologic reorientation and correction of reversible precipitants (pain, sensory deprivation), using small, titrated opioids while avoiding deliriogenic sedatives."
      },
      {
        "text": "Administer IV midazolam 2 mg to calm agitation",
        "isCorrect": false,
        "explanation": "Benzodiazepines are deliriogenic in older adults and can worsen or prolong delirium; they are reserved for specific indications (e.g., alcohol withdrawal). This choice targets symptoms but exacerbates the underlying problem."
      },
      {
        "text": "Start a dexmedetomidine infusion at 0.2–0.7 mcg/kg/h for sedation",
        "isCorrect": false,
        "explanation": "Dexmedetomidine is helpful when agitation endangers safety or persists after nonpharmacologic measures and analgesia, but it is not the initial step for typical emergence delirium. It also carries bradycardia/hypotension risk in this patient."
      },
      {
        "text": "Give haloperidol 5 mg IV now and apply physical restraints",
        "isCorrect": false,
        "explanation": "High-dose haloperidol increases risk of QT prolongation and extrapyramidal effects and is not first-line. If needed for refractory agitation, use low doses (e.g., 0.5–1 mg IV) after addressing pain and employing reorientation."
      },
      {
        "text": "Obtain an emergent noncontrast head CT",
        "isCorrect": false,
        "explanation": "In the absence of focal deficits, trauma, or unexplained vital sign derangements, immediate neuroimaging is low yield. Reversible PACU causes (pain, hypoxia/hypercarbia, hypoglycemia, retention) should be addressed first."
      }
    ],
    "didactic": "Emergence delirium in the PACU often reflects a combination of acute brain dysfunction and reversible precipitants such as pain, hypoxia/hypercarbia, and sensory deprivation. Initial management prioritizes ABCs and correctable causes: ensure adequate oxygenation/ventilation (SpO2 > 94%, EtCO2 near baseline), check glucose, treat pain with multimodal and titrated IV opioids, and provide reorientation with familiar aids (glasses, hearing aids). Avoid deliriogenic medications—especially benzodiazepines, anticholinergics, and meperidine—unless specifically indicated. If agitation persists or threatens safety despite these steps, consider non-deliriogenic sedation with dexmedetomidine (e.g., 0.2–0.7 mcg/kg/h) or low-dose antipsychotics (haloperidol 0.5–1 mg IV) while monitoring QTc and hemodynamics. Hypoactive delirium presents with inattention and lethargy; management is similar—reorientation, sleep hygiene, early mobilization, and pain control—while minimizing sedatives. Practical rule: treat pain first, talk first, and sedate last, using the least deliriogenic agent when necessary.",
    "educationalObjective": "Identify emergence delirium or hypoactive delirium and manage with reorientation, pain control, and minimal deliriogenic drugs."
  },
  {
    "id": "Core.6.4.5",
    "category": "General Anesthesia & Postop",
    "subcategory": "PACU complications and management",
    "difficulty": "medium",
    "questionText": "A 56-year-old man (BMI 36) with obstructive sleep apnea (uses home CPAP) undergoes laparoscopic cholecystectomy under general anesthesia. Intraoperatively he received fentanyl 200 mcg and hydromorphone 0.6 mg, with the last opioid given 30 minutes before PACU arrival. In PACU: BP 145/85 mm Hg, HR 90 bpm, RR 10/min with shallow breaths, SpO2 99% on 2 L/min nasal cannula, and end-tidal CO2 monitoring has not yet been applied. On the Pasero Opioid-Induced Sedation Scale he is a 2 (slightly drowsy, easily aroused). When awakened, he reports pain 7/10. The nurse asks you to start a PCA.\n\nWhich of the following is the most appropriate next step to initiate analgesia while minimizing the risk of oversedation in this patient?",
    "answers": [
      {
        "text": "Start hydromorphone PCA demand-only (0.2 mg/dose, 10-min lockout, no basal infusion; reasonable 4-h limit), add scheduled non-opioids (e.g., IV acetaminophen ± ketorolac if no contraindication), and institute continuous capnography in addition to pulse oximetry.",
        "isCorrect": true,
        "explanation": "For an opioid-naïve, OSA patient on supplemental O2 with borderline ventilation, demand-only PCA plus multimodal analgesia reduces opioid requirements and avoids background opioid. Continuous capnography detects hypoventilation earlier than oximetry when supplemental O2 is used, enhancing safety."
      },
      {
        "text": "Start hydromorphone PCA with a 0.2 mg demand dose and a 0.4 mg/h basal infusion; pulse oximetry alone is adequate monitoring.",
        "isCorrect": false,
        "explanation": "Basal infusions increase the risk of opioid-induced ventilatory depression, especially in opioid-naïve or OSA patients. Relying on pulse oximetry alone while on supplemental O2 can delay recognition of hypoventilation."
      },
      {
        "text": "Administer an additional hydromorphone 1 mg IV loading dose to \"get ahead of pain,\" then start demand-only PCA; monitor with pulse oximetry.",
        "isCorrect": false,
        "explanation": "Stacking more opioid in a patient who is drowsy with RR 10/min increases risk of respiratory depression. Supplemental O2 may mask hypoventilation on oximetry, so further loading is unsafe and capnography is preferred."
      },
      {
        "text": "Stop supplemental oxygen to better detect hypoventilation on pulse oximetry, then start morphine PCA demand-only with a low lockout interval.",
        "isCorrect": false,
        "explanation": "Withholding oxygen to \"unmask\" hypoventilation is unsafe in OSA and may precipitate hypoxemia; monitoring should be improved (capnography), not oxygen withdrawn. A shorter lockout invites dose stacking if the patient is somnolent but in pain."
      },
      {
        "text": "Defer PCA initiation and use a ketamine infusion (0.2 mg/kg/h) as the sole analgesic until fully awake; routine oximetry is sufficient.",
        "isCorrect": false,
        "explanation": "Low-dose ketamine is an effective adjunct but is rarely used as sole analgesia for moderate postoperative pain. It should complement, not replace, opioid-sparing multimodal therapy, and high-risk patients still benefit from capnography."
      }
    ],
    "didactic": "Opioid-naïve patients with OSA are at heightened risk of opioid-induced ventilatory impairment, particularly when residual intraoperative opioids are present. Avoid background (basal) PCA infusions in such patients; use demand-only dosing with typical settings (e.g., hydromorphone 0.2 mg/dose, 8–10 min lockout, reasonable hourly or 4-h limits). Combine PCA with multimodal analgesia (scheduled acetaminophen; NSAIDs if not contraindicated; consider regional/local, gabapentinoids, or low-dose ketamine as adjuncts) to lower opioid requirements. Supplemental O2 can mask hypoventilation on pulse oximetry, so continuous capnography is recommended for high-risk patients or those receiving supplemental O2. Monitor sedation and respiration frequently early after PACU arrival; increasing sedation often precedes respiratory depression. Practical physiology: hypoventilation reduces alveolar ventilation $\\dot V_A = (V_T - V_D) \\times f$, causing $\\uparrow\\,PaCO_2$ well before desaturation on O2. Resume the patient’s home CPAP when resting or asleep, and have naloxone readily available for oversedation.",
    "educationalObjective": "Initiate multimodal analgesia and PCA safely in PACU, including monitoring for oversedation."
  },
  {
    "id": "Core.6.4.6",
    "category": "General Anesthesia & Postop",
    "subcategory": "PACU complications and management",
    "difficulty": "medium",
    "questionText": "A 68-year-old woman is in the PACU 20 minutes after total knee arthroplasty performed with a combined spinal-epidural. An epidural infusion of ropivacaine 0.2% was started at 6 mL/hr in the OR. She reports lightheadedness. Vitals: BP 72/40 mm Hg, HR 48/min, RR 14/min, SpO2 99% on 2 L/min NC, T 36.6°C. She is warm and well perfused with brisk capillary refill; lungs are clear; surgical dressing is dry. Sensory block to cold is at T4. Point-of-care ultrasound shows an IVC diameter of 1.8 cm with <15% respiratory variation and normal LV systolic function without B-lines. Estimated blood loss was 150 mL; she received 1.5 L crystalloid intraoperatively and has made 200 mL urine. Which of the following is the most appropriate immediate management for her hypotension?\n\nNote: $MAP = CO \\times SVR$",
    "answers": [
      {
        "text": "Administer 500 mL lactated Ringer’s bolus",
        "isCorrect": false,
        "explanation": "Misconception: equating all postoperative hypotension with hypovolemia. Minimal IVC collapsibility (<15%) and warm extremities argue against fluid responsiveness; additional crystalloid is unlikely to raise MAP and may cause fluid overload without addressing neuraxial vasodilation."
      },
      {
        "text": "Give 100 mcg phenylephrine IV bolus",
        "isCorrect": false,
        "explanation": "Phenylephrine increases SVR but can worsen reflex or neuraxial-related bradycardia and reduce CO. In this vasodilatory, bradycardic state from high sympathetic block, a mixed α/β agent is preferred to support both SVR and HR/CO."
      },
      {
        "text": "Give 8 mg ephedrine IV bolus",
        "isCorrect": true,
        "explanation": "Neuraxial sympathectomy has produced vasodilation (low SVR) and relative venous pooling with bradycardia; ultrasound suggests she is not fluid responsive. Ephedrine’s mixed α/β effects increase SVR and HR/CO, countering both components and improving $MAP = CO \\times SVR$ more appropriately than a pure α-agonist."
      },
      {
        "text": "Start norepinephrine at 0.05 mcg/kg/min",
        "isCorrect": false,
        "explanation": "Norepinephrine is appropriate for refractory vasoplegia or distributive shock, but a rapid-acting bolus pressor is the immediate first step for transient spinal/epidural-induced hypotension; an infusion may be considered if hypotension persists after boluses and epidural adjustment."
      },
      {
        "text": "Administer 10 mg furosemide IV",
        "isCorrect": false,
        "explanation": "This assumes cardiogenic pulmonary edema, which is unsupported here (clear lungs, normal LV function, warm extremities). Diuresis would reduce preload further and likely worsen hypotension."
      }
    ],
    "didactic": "Postoperative hypotension requires rapid classification into hypovolemic, vasodilatory, or cardiogenic patterns using history, exam, and point-of-care data. Spinal/epidural sympathectomy decreases SVR and venous return, often with bradycardia from unopposed vagal tone; patients appear warm with wide pulse pressures and preserved oxygenation. When ultrasound suggests the patient is not fluid responsive (e.g., IVC diameter ~1.5–2.0 cm with low collapsibility in a spontaneously breathing patient), vasopressors are preferred over empiric fluids. Choice of agent matters: ephedrine (mixed α/β) is favored when hypotension coexists with bradycardia because it supports both SVR and CO, whereas phenylephrine (pure α) may exacerbate bradycardia and reduce CO. Norepinephrine infusions are reserved for persistent or severe vasoplegia (e.g., refractory neuraxial block, sepsis) after initial boluses and addressing reversible causes (e.g., reducing or holding the epidural). Remember $MAP = CO \\times SVR$; target the limiting variable while avoiding therapies (excess fluid or diuretics) that worsen the underlying physiology.",
    "educationalObjective": "Manage hypotension by distinguishing hypovolemia, vasodilation, and cardiogenic causes and giving appropriate fluids or vasoactives."
  },
  {
    "id": "Core.6.4.7",
    "category": "General Anesthesia & Postop",
    "subcategory": "PACU complications and management",
    "difficulty": "easy",
    "questionText": "A 62-year-old man is in the PACU 10 minutes after an uncomplicated laparoscopic cholecystectomy under sevoflurane anesthesia with fentanyl. He is awake, complaining of feeling cold, and has vigorous shivering. Vitals: T 35.2 °C, HR 108/min, BP 160/88 mm Hg, RR 20/min, SpO2 93% on 2 L/min nasal cannula. He has a history of stable coronary artery disease. You apply a forced-air warming blanket and warm IV fluids. Which of the following is the most appropriate initial pharmacologic therapy to control his shivering and reduce oxygen consumption?",
    "answers": [
      {
        "text": "Administer IV meperidine 12.5–25 mg",
        "isCorrect": true,
        "explanation": "Meperidine has a unique anti-shivering effect (kappa-opioid and central monoaminergic/α2 actions) at low doses, rapidly suppressing postanesthetic shivering and reducing the associated 2–3× increase in $\\dot{V}_{O2}$. It is first-line in PACU and pairs well with active warming."
      },
      {
        "text": "Administer IV clonidine 75 mcg",
        "isCorrect": false,
        "explanation": "Clonidine (α2-agonist) lowers the shivering threshold and can be effective, but onset may be slower and it risks hypotension/bradycardia; meperidine is generally preferred as initial therapy in PACU."
      },
      {
        "text": "Administer IV naloxone 0.04 mg",
        "isCorrect": false,
        "explanation": "Naloxone reverses analgesia and can exacerbate sympathetic activation; it does not treat thermoregulatory shivering and may worsen pain and myocardial oxygen demand."
      },
      {
        "text": "Administer IV ondansetron 4 mg",
        "isCorrect": false,
        "explanation": "5-HT3 antagonists have inconsistent, modest benefit for shivering and are not first-line. They may be considered adjuncts but are inferior to meperidine for rapid control."
      },
      {
        "text": "Administer IV flumazenil 0.2 mg",
        "isCorrect": false,
        "explanation": "Flumazenil reverses benzodiazepines and has no specific anti-shivering effect. Postanesthetic shivering is thermoregulatory, most often from hypothermia/redistribution, not benzodiazepine-related."
      }
    ],
    "didactic": "Postanesthetic shivering is common in the PACU, usually from hypothermia and central thermoregulatory reset after volatile anesthetics and redistribution. It can increase oxygen consumption and CO2 production by 2–3×, raising myocardial oxygen demand—important in patients with limited cardiac reserve. First-line management is active rewarming (forced-air warming, warmed IV fluids) plus an effective anti-shivering drug. Meperidine 12.5–25 mg IV rapidly suppresses shivering via kappa-opioid and central monoaminergic/α2 mechanisms with minimal sedation at low doses. α2-agonists (e.g., clonidine ~1–2 mcg/kg IV or dexmedetomidine) also reduce the shivering threshold but may cause hypotension/bradycardia. Other agents (tramadol, magnesium, 5-HT3 antagonists) have variable efficacy and are typically adjuncts. Use caution with meperidine in the elderly, renal failure, or patients on serotonergic drugs due to normeperidine accumulation and serotonin syndrome risk.",
    "educationalObjective": "Recognize and treat shivering with active warming and drugs such as meperidine or clonidine."
  },
  {
    "id": "Core.6.4.8",
    "category": "General Anesthesia & Postop",
    "subcategory": "PACU complications and management",
    "difficulty": "hard",
    "questionText": "A 24-year-old man undergoes intramedullary nailing of a femoral shaft fracture under general anesthesia with sevoflurane and a single dose of succinylcholine for rapid-sequence induction. He remains intubated and is transferred to the PACU on volume-controlled ventilation (VT 7 mL/kg IBW, RR 12/min, FiO2 0.4, PEEP 5 cm H2O). Fifteen minutes later, the end-tidal CO2 rises from 36 to 58 mm Hg despite increasing RR to 22/min; arterial blood gas shows pH 7.18, PaCO2 72 mm Hg. Heart rate is 148/min, BP 165/95 mm Hg, temperature 39.6°C, and diffuse rigidity is noted with cola-colored urine in the Foley bag. Serum K+ just resulted at 6.1 mEq/L.\n\nWhich of the following is the most appropriate immediate management step?",
    "answers": [
      {
        "text": "Administer dantrolene $2.5\\ \\text{mg/kg}$ IV immediately and hyperventilate with 100% O2 while initiating active cooling",
        "isCorrect": true,
        "explanation": "Rising $\\text{ETCO}_2$ unresponsive to increased minute ventilation, generalized rigidity, hyperthermia, acidosis, and hyperkalemia after volatile/succinylcholine exposure are classic for malignant hyperthermia. Immediate therapy is dantrolene $2.5\\ \\text{mg/kg}$ IV (repeat to effect, up to $10\\ \\text{mg/kg}$), 100% O2 with aggressive hyperventilation, and active cooling, along with treatment of hyperkalemia and acidosis."
      },
      {
        "text": "Start an esmolol infusion to control adrenergic hyperactivity (suspected thyroid storm)",
        "isCorrect": false,
        "explanation": "Thyroid storm presents with fever and tachyarrhythmias but typically lacks severe hypercarbia, muscle rigidity, and hyperkalemia. Beta-blockade does not treat the pathologic sarcoplasmic $\\text{Ca}^{2+}$ release of malignant hyperthermia and would delay life-saving dantrolene."
      },
      {
        "text": "Administer propylthiouracil followed by iodine and hydrocortisone",
        "isCorrect": false,
        "explanation": "This sequence is appropriate for thyroid storm (thionamide first, then iodine after 1 hour, plus glucocorticoids), not for malignant hyperthermia. The patient’s refractory hypercarbia, rigidity, and recent succinylcholine/volatile exposure point away from thyroid storm."
      },
      {
        "text": "Treat the hyperthermia with acetaminophen and surface cooling alone",
        "isCorrect": false,
        "explanation": "In malignant hyperthermia, heat generation is non–pyrogen mediated from uncontrolled skeletal muscle metabolism; antipyretics are ineffective. Cooling is adjunctive but must not delay dantrolene and definitive MH management."
      },
      {
        "text": "Administer IV calcium chloride immediately for hyperkalemia as the primary intervention",
        "isCorrect": false,
        "explanation": "Calcium can temporize membrane instability in life-threatening hyperkalemia, but it does not address the cause. In malignant hyperthermia, prioritize dantrolene and hyperventilation with 100% O2; treat hyperkalemia concurrently (e.g., insulin/dextrose, bicarbonate)."
      }
    ],
    "didactic": "Malignant hyperthermia (MH) is triggered by volatile anesthetics and succinylcholine and classically presents with rapidly rising $\\text{ETCO}_2$ despite increased minute ventilation, tachycardia, generalized rigidity, mixed metabolic–respiratory acidosis, hyperkalemia, and hyperthermia (often a late sign). Immediate management is disease-specific: stop triggers, hyperventilate with 100% O2, and give dantrolene $2.5\\ \\text{mg/kg}$ IV, repeating to effect (up to $10\\ \\text{mg/kg}$), followed by maintenance dosing (e.g., $1\\ \\text{mg/kg}$ every 4–6 h for 24 h) due to risk of recrudescence. Initiate active cooling, treat hyperkalemia (insulin/dextrose, bicarbonate; avoid calcium channel blockers with dantrolene), correct acidosis, and manage arrhythmias with amiodarone or lidocaine. By contrast, thyroid storm presents with fever, agitation, and tachyarrhythmias without marked hypercarbia or rigidity; treatment is beta-blockade (e.g., esmolol), a thionamide (PTU or methimazole), iodine given after the thionamide, glucocorticoids, volume resuscitation, and cooling (avoid aspirin). A practical rule: “Unexplained rising $\\text{ETCO}_2$ + rigidity + acidosis/hyperkalemia after volatile/succinylcholine = MH until proven otherwise—give dantrolene now.” Early recognition and protocolized therapy markedly reduce morbidity and mortality.",
    "educationalObjective": "Recognize postoperative malignant hyperthermia or thyroid storm and initiate disease-specific protocols promptly."
  },
  {
    "id": "Core.6.4.9",
    "category": "General Anesthesia & Postop",
    "subcategory": "PACU complications and management",
    "difficulty": "medium",
    "questionText": "A 38-year-old nonsmoking woman with a history of motion sickness undergoes laparoscopic cholecystectomy under sevoflurane anesthesia with perioperative opioids. She received dexamethasone 8 mg IV at induction and ondansetron 4 mg IV at skin closure. In the PACU 20 minutes after arrival she is actively retching despite promethazine 12.5 mg IV given 20 minutes ago. Vitals: BP 122/70 mm Hg, HR 84 bpm, RR 14/min, SpO2 98% on room air; she is alert and protecting her airway. A preoperative ECG showed $QT_c = 430\\,\\text{ms}$. Which of the following is the most appropriate next step to treat her PONV?",
    "answers": [
      {
        "text": "Administer haloperidol 1 mg IV",
        "isCorrect": true,
        "explanation": "After inadequate response to prophylaxis with a 5-HT3 antagonist and steroid and failed rescue with an H1 antihistamine, a different class is indicated; low-dose haloperidol (0.5–1 mg IV) is effective for refractory PONV with minimal sedation when $QT_c$ is not prolonged."
      },
      {
        "text": "Repeat ondansetron 4 mg IV now",
        "isCorrect": false,
        "explanation": "Repeating a 5-HT3 antagonist shortly after prophylaxis offers limited benefit due to class redundancy; guidelines favor switching to a different class for rescue within 6 hours."
      },
      {
        "text": "Apply a transdermal scopolamine patch",
        "isCorrect": false,
        "explanation": "Scopolamine has a delayed onset (hours), making it suboptimal for acute rescue of active emesis in the PACU."
      },
      {
        "text": "Administer propofol 20 mg IV for its antiemetic effect",
        "isCorrect": false,
        "explanation": "Small propofol boluses can transiently reduce nausea but provide short-lived benefit and risk oversedation/airway events; pharmacologic rescue with a different antiemetic class is preferred."
      },
      {
        "text": "Give aprepitant 40 mg PO now",
        "isCorrect": false,
        "explanation": "NK1 antagonists are effective for prophylaxis when given preoperatively; oral aprepitant has delayed onset and limited utility for immediate PACU rescue."
      }
    ],
    "didactic": "Rescue therapy for PONV should use an agent from a different pharmacologic class than those used for prophylaxis, especially within the first 6 hours postoperatively. After 5-HT3 antagonist and corticosteroid prophylaxis, effective rescue options include dopamine antagonists (droperidol, haloperidol, metoclopramide) or antihistamines/anticholinergics. Low-dose haloperidol (0.5–1 mg IV) is a reasonable choice for refractory PONV, providing meaningful relief with minimal sedation; monitor for QT prolongation and extrapyramidal symptoms, particularly if $QT_c$ > 450–470 ms or with other QT-prolonging drugs. Transdermal scopolamine is useful for prevention or delayed PONV but has a slow onset, limiting value in acute rescue. Repeating the same class (e.g., ondansetron after recent ondansetron) is inferior to class switching. Adjuncts include minimizing opioids, ensuring euvolemia, and considering isopropyl alcohol aromatherapy for short-term relief while definitive rescue takes effect.",
    "educationalObjective": "Treat PONV in PACU with agents from a different class than prophylaxis and consider haloperidol in refractory cases."
  },
  {
    "id": "Core.6.4.10",
    "category": "General Anesthesia & Postop",
    "subcategory": "PACU complications and management",
    "difficulty": "easy",
    "questionText": "A 62-year-old man with obesity (BMI 38) and known OSA (uses home CPAP) undergoes laparoscopic cholecystectomy under general anesthesia with an endotracheal tube. He was extubated in the OR after full neuromuscular reversal and followed simple commands. Ten minutes after PACU arrival, he becomes somnolent and snores loudly with paradoxical abdominal breathing. Vitals: BP 138/82 mm Hg, HR 92 bpm, RR 8/min with shallow breaths, SpO2 88% on 6 L/min simple face mask. The PACU nurse briefly improves the snoring with head extension, but obstruction recurs as soon as support is released. There are no visible secretions or blood. Which is the most appropriate next step to relieve this upper airway obstruction?",
    "answers": [
      {
        "text": "Perform a two-handed jaw thrust and insert an oropharyngeal airway",
        "isCorrect": true,
        "explanation": "This directly relieves tongue-base/oropharyngeal collapse and splints the airway in a deeply sedated patient. It is the next escalation after simple head repositioning, with CPAP reserved if obstruction persists."
      },
      {
        "text": "Increase supplemental O2 to 15 L/min via nonrebreather mask",
        "isCorrect": false,
        "explanation": "Raising FiO2 treats hypoxemia but does not address the mechanical obstruction; delay in relieving obstruction risks worsening hypercapnia and hypoventilation."
      },
      {
        "text": "Administer naloxone 0.4 mg IV",
        "isCorrect": false,
        "explanation": "Opioid reversal may be needed if hypoventilation persists, but the priority is to relieve mechanical obstruction first. Additionally, 0.4 mg is an excessive initial dose and risks severe pain and sympathetic surge; titrate in 0.04 mg increments if used."
      },
      {
        "text": "Apply CPAP at 10 cm H2O via tight-fitting mask",
        "isCorrect": false,
        "explanation": "CPAP is appropriate if obstruction continues after airway maneuvers and adjuncts, especially in OSA. Applying CPAP to a still-collapsed airway may be ineffective and can cause gastric insufflation if the airway isn’t first opened."
      },
      {
        "text": "Proceed to endotracheal intubation",
        "isCorrect": false,
        "explanation": "Reintubation is premature when obstruction is likely due to soft-tissue collapse and should follow failure of basic maneuvers, airway adjuncts, and noninvasive support."
      }
    ],
    "didactic": "Upper airway obstruction in the PACU commonly results from tongue-base and soft-tissue collapse in sedated patients, especially with OSA and obesity, and presents with snoring, paradoxical breathing, and desaturation. Management is stepwise: first optimize positioning (sniffing, head tilt–chin lift) and apply a firm jaw thrust while delivering supplemental O2. If obstruction recurs or persists, insert an airway adjunct—use an oropharyngeal airway for deeply sedated/unconscious patients and a nasopharyngeal airway if gag reflex is present or OPA is not tolerated. If still obstructed, escalate to noninvasive support with CPAP (about 5–10 cm H2O) via a tight-fitting mask, which can splint the pharynx open; combine with jaw support as needed. Consider bag-mask ventilation and titrated opioid reversal (e.g., naloxone 0.04–0.08 mg IV increments) only after establishing airway patency. Reintubate if oxygenation/ventilation cannot be maintained despite these measures. Recognize laryngospasm as a separate cause (inspiratory stridor/silence) and treat with jaw thrust with CPAP; if refractory, give a small dose of propofol or succinylcholine.",
    "educationalObjective": "Treat upper airway obstruction in PACU with repositioning, jaw thrust, oral/nasal airway, and escalate to CPAP if needed."
  },
  {
    "id": "Core.6.5.1",
    "category": "General Anesthesia & Postop",
    "subcategory": "PONV prevention and treatment",
    "difficulty": "medium",
    "questionText": "A 34-year-old nonsmoking woman with a history of severe motion sickness and prior postoperative vomiting presents for elective laparoscopic cholecystectomy under volatile-based general anesthesia. The case is expected to last 90 minutes with planned postoperative opioids. Preoperative ECG shows QTc 430 ms, and she has no diabetes. You aim to minimize PONV in this high-risk patient (Apfel 4/4). Which prophylactic regimen is MOST appropriate?\n\n",
    "answers": [
      {
        "text": "After induction, give dexamethasone 8 mg IV; within 30 minutes of closure, give droperidol 0.625 mg IV and ondansetron 4 mg IV.",
        "isCorrect": true,
        "explanation": "Correct. This combines three different classes (glucocorticoid, dopamine antagonist, 5-HT3 antagonist) with evidence-based timing: dexamethasone at induction and ondansetron/droperidol near the end of surgery. This multimodal approach provides additive efficacy for high-risk patients without duplicating mechanisms."
      },
      {
        "text": "At induction, give ondansetron 4 mg IV and apply a scopolamine patch; withhold dexamethasone to avoid transient hyperglycemia.",
        "isCorrect": false,
        "explanation": "Incorrect. Ondansetron is more effective when administered near the end of surgery, and scopolamine requires several hours to become effective if applied perioperatively. Omitting dexamethasone in a non-diabetic high-risk patient sacrifices proven benefit."
      },
      {
        "text": "At induction, give droperidol 1.25 mg IV alone; treat any postoperative nausea in the PACU with ondansetron as needed.",
        "isCorrect": false,
        "explanation": "Incorrect. Single-agent prophylaxis is inadequate for Apfel 3–4 risk. Droperidol is best used as part of a multimodal regimen; relying on rescue rather than prevention increases PONV incidence."
      },
      {
        "text": "At induction, give palonosetron 0.075 mg IV and dexamethasone 8 mg IV; repeat ondansetron 4 mg IV at closure.",
        "isCorrect": false,
        "explanation": "Incorrect. This duplicates the 5-HT3 class without proven synergy; adding a different class (e.g., droperidol) provides greater incremental benefit in high-risk patients. Palonosetron’s long half-life also makes subsequent ondansetron redundant."
      }
    ],
    "didactic": "High-risk PONV (e.g., Apfel score 3–4: female sex, non-smoker, history of PONV/motion sickness, postoperative opioids) warrants multimodal prophylaxis using different drug classes. Recommended combinations include a 5-HT3 antagonist (e.g., ondansetron 4 mg IV), dexamethasone (4–8 mg IV), and a dopamine antagonist (e.g., droperidol 0.625–1.25 mg IV). Optimal timing enhances efficacy: give dexamethasone after induction, and administer ondansetron and droperidol within the last 30 minutes of the case. Avoid duplicating 5-HT3 antagonists, as this provides little added benefit compared with adding another mechanistic class. Low-dose droperidol is effective; consider QT risk but it is generally safe at 0.625–1.25 mg IV in patients with normal QTc. Scopolamine patches are effective when placed preoperatively (ideally ≥2–4 hours before) and are less reliable if applied intraoperatively. For rescue, choose an agent from a different class than those used for prophylaxis.",
    "educationalObjective": "Administer multimodal prophylaxis by combining drug classes (5-HT3 antagonist, dexamethasone, droperidol) in moderate–high risk."
  },
  {
    "id": "Core.6.5.2",
    "category": "General Anesthesia & Postop",
    "subcategory": "PONV prevention and treatment",
    "difficulty": "medium",
    "questionText": "A 5-year-old (20 kg) is scheduled for adenotonsillectomy for obstructive sleep apnea. The case is expected to last 45 minutes under sevoflurane with endotracheal intubation; the plan is to minimize opioids (acetaminophen and surgeon’s local infiltration). He had severe vomiting after a prior anesthetic. To reduce postoperative nausea and vomiting risk in this high-risk pediatric procedure, which prophylactic regimen is most appropriate?",
    "answers": [
      {
        "text": "Dexamethasone 0.15 mg/kg IV after induction plus ondansetron 0.1 mg/kg IV given ~15–30 minutes before emergence",
        "isCorrect": true,
        "explanation": "Multimodal prophylaxis with a steroid and a 5-HT3 antagonist is recommended for high-risk pediatric cases (e.g., tonsillectomy), with dexamethasone early (slower onset) and ondansetron near the end (shorter half-life). This timing and dosing optimize antiemetic effect while minimizing side effects."
      },
      {
        "text": "Ondansetron 0.1 mg/kg IV after induction; avoid dexamethasone due to bleeding risk",
        "isCorrect": false,
        "explanation": "Avoiding dexamethasone reflects an overestimation of bleeding risk; standard doses do not meaningfully increase postoperative hemorrhage in tonsillectomy. Early ondansetron is suboptimally timed and may wear off by emergence."
      },
      {
        "text": "Metoclopramide 0.1 mg/kg IV after induction plus dimenhydrinate 1 mg/kg IV at the end of the case",
        "isCorrect": false,
        "explanation": "While sometimes used, this combination is less effective than 5-HT3 antagonist plus steroid for pediatric tonsillectomy and carries more sedation/anticholinergic effects. It is not first-line in high-risk pediatric PONV."
      },
      {
        "text": "Dexamethasone 0.5 mg/kg IV at the end of surgery plus ondansetron 0.1 mg/kg IV at induction",
        "isCorrect": false,
        "explanation": "Both agents are mistimed: dexamethasone should be given early for delayed onset benefit, and ondansetron works best close to emergence. A higher dexamethasone dose may increase side effects without superior antiemesis."
      },
      {
        "text": "Transdermal scopolamine patch preoperatively plus ondansetron 0.1 mg/kg IV at the end of the case",
        "isCorrect": false,
        "explanation": "Scopolamine has limited evidence and unfavorable side effects in young children and requires hours for onset. It is not a preferred prophylactic agent in pediatric tonsillectomy."
      }
    ],
    "didactic": "Pediatric strabismus repair and adenotonsillectomy carry among the highest PONV risks in children, often warranting multimodal prophylaxis. The most evidence-supported regimen is a 5-HT3 antagonist (ondansetron $0.1\\ \\text{mg/kg}$, max 4 mg) administered within 30 minutes of emergence plus dexamethasone (commonly $0.15$–$0.5\\ \\text{mg/kg}$, max 8–10 mg) given at induction to account for its slower onset. Practical rule: give the steroid early and give the 5-HT3 late. Additional risk-reduction strategies include minimizing opioids, avoiding or limiting N2O, ensuring adequate hydration, and considering propofol-based TIVA, which lowers PONV compared with volatile anesthetics. In tonsillectomy, standard-dose dexamethasone reduces PONV and improves pain without a meaningful increase in postoperative hemorrhage risk. For rescue, choose an agent from a different class than those used prophylactically (e.g., droperidol $0.015\\ \\text{mg/kg}$ IV or low-dose metoclopramide).",
    "educationalObjective": "Apply special strategies in pediatrics (ondansetron + dexamethasone) and high-risk procedures (strabismus, tonsillectomy)."
  },
  {
    "id": "Core.6.5.3",
    "category": "General Anesthesia & Postop",
    "subcategory": "PONV prevention and treatment",
    "difficulty": "medium",
    "questionText": "A 28-year-old nonsmoking woman undergoes laparoscopic cholecystectomy with general anesthesia. She receives dexamethasone 8 mg IV after induction and ondansetron 4 mg IV at skin closure. Thirty minutes after arrival to the PACU she reports severe nausea with one episode of emesis. Vitals are stable (BP 122/74 mm Hg, HR 88/min, SpO2 98% on room air) and her pre- and postoperative ECGs show normal QTc. Which of the following is the most appropriate rescue antiemetic now?",
    "answers": [
      {
        "text": "Droperidol 0.625 mg IV",
        "isCorrect": true,
        "explanation": "Best rescue is a different pharmacologic class when prophylaxis fails within $6$ h. Low-dose droperidol (D2 antagonist) has rapid onset and strong efficacy for treatment of PONV after 5-HT3 antagonist prophylaxis."
      },
      {
        "text": "Ondansetron 4 mg IV (repeat dose)",
        "isCorrect": false,
        "explanation": "Incorrect because it repeats the same 5-HT3 mechanism used for prophylaxis and is less effective within $6$ h; it also adds QT risk without added benefit."
      },
      {
        "text": "Transdermal scopolamine patch",
        "isCorrect": false,
        "explanation": "Incorrect for immediate rescue; anticholinergic patches have delayed onset (several hours) and are more suitable for prophylaxis than acute treatment."
      },
      {
        "text": "Metoclopramide 10 mg IV",
        "isCorrect": false,
        "explanation": "Different class but less effective than butyrophenone dopamine antagonists for established PONV; reasonable if droperidol/haloperidol are contraindicated, but not the best option here."
      },
      {
        "text": "Aprepitant 40 mg PO",
        "isCorrect": false,
        "explanation": "An NK1 antagonist primarily for preoperative prophylaxis with slow onset; it is not useful for immediate rescue in the PACU."
      }
    ],
    "didactic": "If PONV occurs despite prophylaxis, rescue therapy should use an agent from a different class; repeating the same mechanism within about $6$ h (e.g., another 5-HT3 antagonist dose after ondansetron) is discouraged due to limited incremental efficacy and additive adverse effects (e.g., QT prolongation). Effective rescue options after 5-HT3 prophylaxis include dopamine antagonists such as droperidol 0.625–1.25 mg IV or haloperidol 0.5–1 mg IV, which have rapid onset and strong antiemetic efficacy. Metoclopramide 10 mg IV offers modest benefit and is reasonable if other dopamine antagonists are contraindicated. Anticholinergic scopolamine patches and NK1 antagonists (e.g., aprepitant) are mainly prophylactic; scopolamine has a delayed onset (hours), and aprepitant works best when given preoperatively. Always consider patient-specific contraindications: avoid QT-prolonging agents in patients with significant QTc prolongation or torsades risk, and avoid dopamine antagonists in Parkinson disease. Practical rule: prophylaxis fails early → switch class for rescue; late ($>6$ h) PONV may be treated with a repeat 5-HT3 antagonist dose if previously effective.",
    "educationalObjective": "Choose a rescue antiemetic from a different class when prophylaxis fails and avoid repeating the same mechanism."
  },
  {
    "id": "Core.6.5.4",
    "category": "General Anesthesia & Postop",
    "subcategory": "PONV prevention and treatment",
    "difficulty": "easy",
    "questionText": "A 29-year-old woman (BMI 24 kg/m^2), nonsmoker, with a history of severe motion sickness presents for outpatient laparoscopic cholecystectomy under general anesthesia. She is expected to require postoperative opioids for analgesia. Vitals are normal. Using the simplified Apfel PONV risk score, which prophylaxis strategy is most appropriate for this patient?",
    "answers": [
      {
        "text": "Ondansetron 4 mg IV near the end of the case only",
        "isCorrect": false,
        "explanation": "With an Apfel score of 4 (female, nonsmoker, prior motion sickness/PONV, expected postoperative opioids) the predicted PONV risk is ~80%; single-agent prophylaxis is inadequate for very high risk."
      },
      {
        "text": "Dexamethasone 8 mg IV after induction only",
        "isCorrect": false,
        "explanation": "Dexamethasone is effective but monotherapy is insufficient in a patient with an Apfel score of 4; guidelines favor multimodal prophylaxis with at least two different classes."
      },
      {
        "text": "Dexamethasone 8 mg IV after induction plus ondansetron 4 mg IV near the end of the case",
        "isCorrect": true,
        "explanation": "An Apfel score of 4 (~80% risk) warrants multimodal prophylaxis. Combining agents from different classes and timing them appropriately (dexamethasone at induction, 5-HT3 antagonist at case end) provides superior protection."
      },
      {
        "text": "Transdermal scopolamine patch alone placed preoperatively",
        "isCorrect": false,
        "explanation": "Scopolamine is useful, especially for motion sickness and PONV, but as monotherapy it is inadequate at very high risk; it is better used as part of a multimodal regimen."
      },
      {
        "text": "Droperidol 0.625 mg IV near the end of the case only",
        "isCorrect": false,
        "explanation": "Low-dose droperidol is effective, but monotherapy is not sufficient for an Apfel score of 4; at least two agents from different classes are recommended."
      }
    ],
    "didactic": "The simplified Apfel score assigns 1 point each for female sex, nonsmoking status, prior PONV or motion sickness, and planned postoperative opioids; risk increases roughly linearly: 0→~10%, 1→~20%, 2→~40%, 3→~60%, 4→~80%. Patients with scores ≥3 warrant multimodal prophylaxis using at least two antiemetics from different classes, timed for peak effect (e.g., dexamethasone 4–8 mg IV at induction plus ondansetron 4 mg IV at the end). Additional risk-reduction strategies include avoiding emetogenic anesthetics (minimize volatile agents, avoid $\\mathrm{N_2O}$), using propofol TIVA, and reducing postoperative opioids with multimodal analgesia. If prophylaxis fails, rescue therapy should come from a different class than those already given. Typical effective doses: ondansetron 4 mg IV, dexamethasone 4–8 mg IV, droperidol 0.625–1.25 mg IV, and transdermal scopolamine 1.5 mg applied preoperatively. Stratifying prophylaxis intensity to the Apfel score prevents overtreatment of low-risk patients and undertreatment of high-risk patients.",
    "educationalObjective": "Identify PONV risk using simplified scores (e.g., Apfel) and stratify prophylaxis intensity."
  },
  {
    "id": "Core.6.5.5",
    "category": "General Anesthesia & Postop",
    "subcategory": "PONV prevention and treatment",
    "difficulty": "easy",
    "questionText": "A 28-year-old nonsmoking woman undergoes outpatient laparoscopic cholecystectomy under general anesthesia. She received dexamethasone 8 mg at induction and ondansetron 4 mg at closure. In the PACU 20 minutes later she reports moderate nausea without vomiting. Vitals: BP 122/70 mm Hg, HR 78 bpm, RR 14, SpO2 98% on 2 L/min O2 via nasal cannula. She declines additional sedating medications and wants to be discharged promptly. Which intervention is the most appropriate low-risk adjunct to provide rapid symptom relief?\n\n",
    "answers": [
      {
        "text": "Have the patient take several deep inhalations of isopropyl alcohol vapor from an alcohol pad held beneath the nares.",
        "isCorrect": true,
        "explanation": "Isopropyl alcohol inhalation provides rapid, short-term reduction in nausea intensity in the PACU with minimal risk and no sedation, making it an ideal nonpharmacologic adjunct alongside antiemetics."
      },
      {
        "text": "Apply an elastic acupressure band over the P6 (Neiguan) point on the volar wrist.",
        "isCorrect": false,
        "explanation": "P6 acupressure is low-risk and can reduce PONV, but its onset as a rescue measure is less immediate and effect less consistent than isopropyl alcohol inhalation for rapid PACU relief; it is often used prophylactically or as an adjunct started earlier."
      },
      {
        "text": "Place a transdermal scopolamine patch behind the ear.",
        "isCorrect": false,
        "explanation": "Scopolamine is pharmacologic and has a delayed onset (typically 2–4 hours) with anticholinergic side effects; it is unsuitable for rapid relief in the immediate PACU setting."
      },
      {
        "text": "Offer peppermint-flavored chewing gum to stimulate gastric motility.",
        "isCorrect": false,
        "explanation": "Chewing gum is not an established treatment for PONV and may pose aspiration risk in the PACU; its primary evidence relates to postoperative ileus rather than acute nausea."
      },
      {
        "text": "Increase supplemental oxygen to FiO2 = 1.0 via face mask.",
        "isCorrect": false,
        "explanation": "High inspired O2 has not reliably reduced PONV and is unlikely to help a normoxic patient (SpO2 98%); the misconception is that oxygen itself treats nausea absent hypoxemia."
      }
    ],
    "didactic": "Nonpharmacologic strategies are useful low-risk complements to antiemetics for PONV. Isopropyl alcohol aromatherapy (sniffing an alcohol pad for a few deep breaths, repeated as needed) provides rapid, short-term relief of nausea intensity in the PACU without sedation or interactions, making it ideal for immediate rescue. P6 (Neiguan) acupressure—located 2–3 fingerbreadths proximal to the distal wrist crease between the palmaris longus and flexor carpi radialis tendons—reduces PONV and can be used as an adjunct, but its rescue effect is less immediate than alcohol inhalation; applying bands preoperatively or early postoperatively may enhance benefit. Peppermint oil aromatherapy is another low-risk option with mixed but generally favorable evidence for nausea relief; it can be considered when available. Transdermal scopolamine is best placed preoperatively for prophylaxis due to a 2–4 hour onset and anticholinergic side effects. In normoxic patients, increasing FiO2 does not reliably treat nausea. Practical approach: for acute PACU nausea after standard antiemetics, start with isopropyl alcohol inhalation and consider adding P6 acupressure while arranging further pharmacologic rescue from a different class if needed.",
    "educationalObjective": "Integrate nonpharmacologic adjuncts (acupressure P6, aromatherapy) as low-risk complements to drugs."
  },
  {
    "id": "Core.6.5.6",
    "category": "General Anesthesia & Postop",
    "subcategory": "PONV prevention and treatment",
    "difficulty": "medium",
    "questionText": "A 32-year-old nonsmoking woman with a history of severe motion sickness undergoes ambulatory laparoscopic cholecystectomy under general anesthesia. She received multimodal PONV prophylaxis: aprepitant 80 mg PO 2 hours preop, dexamethasone 8 mg IV after induction, palonosetron 0.075 mg IV at closure, and a transdermal scopolamine patch placed preoperatively. In PACU she is comfortable and will be discharged with a short course of oxycodone PRN. You want to minimize post-discharge nausea and vomiting (PDNV) and provide effective rescue therapy.\n\nWhich discharge prescription and instructions are MOST appropriate?",
    "answers": [
      {
        "text": "Metoclopramide 10 mg PO every 6–8 hours as needed for nausea, avoid driving if sedated or restless, keep the scopolamine patch on for 72 hours (remove earlier if blurry vision/urinary retention), and call/return if unable to keep fluids or if two doses fail.",
        "isCorrect": true,
        "explanation": "Best choice: use a different receptor class for rescue (dopamine antagonist) given long-acting 5-HT3 (palonosetron), NK1 (aprepitant), steroid, and anticholinergic already on board. Instructions align with patch duration and emphasize safety/escalation."
      },
      {
        "text": "Ondansetron 4 mg PO every 6 hours as needed for nausea, remove the scopolamine patch after 24 hours.",
        "isCorrect": false,
        "explanation": "Misconception: “more 5-HT3 is better.” Palonosetron has a long $t_{1/2}\\approx40$ h and sustained receptor binding, so additional 5-HT3 offers limited early benefit; removing scopolamine at 24 h prematurely reduces protection (patch lasts ~72 h)."
      },
      {
        "text": "Replace the transdermal scopolamine patch daily for 3 days and avoid any other antiemetics.",
        "isCorrect": false,
        "explanation": "Misconception: maximizing anticholinergic therapy. The patch delivers drug over ~72 h and is not replaced daily; relying solely on anticholinergic therapy neglects effective rescue from a different class and increases anticholinergic adverse effects."
      },
      {
        "text": "No outpatient antiemetic is needed because palonosetron covers nausea for 72 hours.",
        "isCorrect": false,
        "explanation": "Misconception: long-acting prophylaxis obviates rescue. High PDNV-risk patients still benefit from an at-home rescue plan; breakthrough symptoms can occur despite prophylaxis."
      },
      {
        "text": "Promethazine 25 mg PO every 4 hours around the clock for 48 hours, caution about drowsiness.",
        "isCorrect": false,
        "explanation": "Misconception: scheduled sedating antihistamines are superior. Routine around-the-clock dosing increases sedation and respiratory depression risk with opioids; rescue should be PRN and from a different class with clear escalation triggers."
      }
    ],
    "didactic": "High PDNV-risk patients (e.g., female, age <50, opioid use, PACU nausea) benefit from long-acting prophylaxis plus a home rescue plan. Key durations: palonosetron $t_{1/2}\\approx40$ h with efficacy up to ~72 h; transdermal scopolamine releases drug for ~72 h; aprepitant provides sustained NK1 blockade over ~24 h. Rescue therapy should use a different class than prophylaxis—if 5-HT3 was used (especially palonosetron), choose a dopamine antagonist (e.g., metoclopramide 10 mg PO q6–8 h PRN or prochlorperazine 10 mg PO q6–8 h PRN) rather than another 5-HT3 early after surgery. Provide clear instructions: leave the scopolamine patch on for 72 h (remove earlier if blurry vision, confusion, or urinary retention), avoid driving if sedated or with akathisia, and seek care if unable to keep liquids or if symptoms persist after 1–2 rescue doses. Rule of thumb: if prophylaxis fails within ~6 h, switch classes; if >6 h and a short-acting 5-HT3 was used, repeating a 5-HT3 may be reasonable—palonosetron is an exception due to its long receptor occupancy.",
    "educationalObjective": "Plan for PDNV after ambulatory surgery with long-acting prophylaxis and clear rescue instructions."
  },
  {
    "id": "Core.6.5.7",
    "category": "General Anesthesia & Postop",
    "subcategory": "PONV prevention and treatment",
    "difficulty": "hard",
    "questionText": "A 46-year-old woman with congenital long QT syndrome (on nadolol) undergoes laparoscopic cholecystectomy under general anesthesia. She received dexamethasone 8 mg IV at induction and ondansetron 4 mg IV at skin closure. In the PACU 20 minutes later she has severe nausea. Vitals: BP 128/72 mm Hg, HR 55/min (sinus), SpO2 99% on 2 L/min O2. An ECG shows $QT_c = 540\\,$ms (baseline preop $QT_c = 500\\,$ms). Labs just resulted: $K^+ = 3.2\\,\\text{mEq/L}$, $Mg^{2+} = 1.6\\,\\text{mg/dL}$. Which medication is the most appropriate immediate treatment for her nausea?",
    "answers": [
      {
        "text": "Propofol 20 mg IV bolus",
        "isCorrect": true,
        "explanation": "Propofol has rapid-onset antiemetic effects at subhypnotic doses and does not meaningfully prolong $QT_c$; it is preferred for rescue in patients with marked $QT_c$ prolongation and recent exposure to other QT-prolonging antiemetics. Electrolyte repletion (target $K^+ > 4.0\\,\\text{mEq/L}$, $Mg^{2+} > 2.0\\,\\text{mg/dL}$) should also be performed, but propofol is the safest immediate antiemetic choice here."
      },
      {
        "text": "Haloperidol 1 mg IV",
        "isCorrect": false,
        "explanation": "Haloperidol prolongs $QT_c$ and increases torsades de pointes risk, especially in patients with baseline $QT_c > 500$ ms, bradycardia, hypokalemia, or concurrent QT-prolonging agents (e.g., ondansetron). Using it now compounds multiple risk factors."
      },
      {
        "text": "Metoclopramide 10 mg IV",
        "isCorrect": false,
        "explanation": "Metoclopramide (a dopamine antagonist) can prolong $QT_c$ and has dose-dependent risk of arrhythmia and extrapyramidal effects. In a patient with $QT_c = 540$ ms and low $K^+$/$Mg^{2+}$, this adds avoidable proarrhythmic risk."
      },
      {
        "text": "Promethazine 12.5 mg IV",
        "isCorrect": false,
        "explanation": "Phenothiazines (e.g., promethazine, prochlorperazine) can prolong $QT_c$ and cause hypotension; they are not preferred in marked $QT_c$ prolongation, especially after another QT-prolonging antiemetic has been given."
      },
      {
        "text": "Ondansetron 4 mg IV (repeat dose)",
        "isCorrect": false,
        "explanation": "5-HT3 antagonists variably prolong $QT_c$ (ondansetron most notably). Re-dosing in a patient with $QT_c = 540$ ms, bradycardia, and hypokalemia increases torsades risk and offers limited additional efficacy so soon after the initial dose."
      }
    ],
    "didactic": "Marked $QT_c$ prolongation (e.g., $QT_c > 500$ ms) substantially increases torsades de pointes risk, which is further amplified by bradycardia, hypokalemia, hypomagnesemia, and stacking multiple QT-prolonging drugs. Among antiemetics, 5-HT3 antagonists (especially ondansetron), dopamine antagonists (droperidol, haloperidol, metoclopramide), and phenothiazines (promethazine, prochlorperazine) can prolong $QT_c$; avoid combining them in susceptible patients. Safer choices include propofol for rescue (10–20 mg IV boluses), dexamethasone, scopolamine, and NK1 antagonists (e.g., aprepitant), with palonosetron having minimal QT effect if a 5-HT3 agent is needed for prophylaxis. For patients at risk, correct electrolytes to $K^+ > 4.0\\,\\text{mEq/L}$ and $Mg^{2+} > 2.0\\,\\text{mg/dL}$, maintain normothermia and normocapnia, and avoid bradycardia. If torsades occurs, give magnesium sulfate 2 g IV and treat per ACLS, with overdrive pacing or isoproterenol when indicated. A practical rule: in the PACU with prolonged $QT_c$, choose propofol for immediate rescue and reserve QT-neutral/prophylactic agents for subsequent prevention.",
    "educationalObjective": "Recognize and manage QT prolongation risk when combining antiemetics or in susceptible patients."
  },
  {
    "id": "Core.6.5.8",
    "category": "General Anesthesia & Postop",
    "subcategory": "PONV prevention and treatment",
    "difficulty": "medium",
    "questionText": "A 29-year-old ASA II woman (nonsmoker) with prior severe postoperative nausea and vomiting (PONV) and motion sickness presents for laparoscopic cholecystectomy. After 45 minutes, she is anesthetized with sevoflurane (≈1.1 MAC) in 50% N2O/50% O2 at 2 L/min; she has received fentanyl 100 mcg and 300 mL lactated Ringer’s. The surgeon anticipates another 60 minutes for cholangiography. Due to a formulary shortage, you have already given the only antiemetic available and cannot add others. To reduce her baseline PONV risk independent of additional antiemetic drugs, which intraoperative change is MOST effective?",
    "answers": [
      {
        "text": "Convert to propofol-based TIVA (e.g., propofol 100–150 mcg/kg/min) with air/O2 and discontinue both sevoflurane and N2O",
        "isCorrect": true,
        "explanation": "Propofol TIVA removes the emetogenic stimulus of volatile agents and eliminates N2O, producing one of the largest single modifiable reductions in baseline PONV risk—particularly in high-risk, laparoscopic cases."
      },
      {
        "text": "Maintain volatile anesthesia but avoid further opioids by substituting multimodal analgesia (e.g., ketamine 0.3 mg/kg and IV lidocaine infusion)",
        "isCorrect": false,
        "explanation": "Opioid-sparing strategies lower PONV risk, but the continued presence of volatile anesthetic and N2O leaves major emetogenic drivers in place. The magnitude of risk reduction is smaller than with switching to propofol TIVA."
      },
      {
        "text": "Administer a 1 L bolus of lactated Ringer’s to correct fasting deficit and promote euvolemia",
        "isCorrect": false,
        "explanation": "Adequate hydration modestly reduces PONV, especially for laparoscopic intra-abdominal procedures, but its effect is less than eliminating volatile/N2O with TIVA."
      },
      {
        "text": "Increase N2O to 70% to reduce sevoflurane requirement (lower MAC)",
        "isCorrect": false,
        "explanation": "N2O is independently emetogenic; increasing its fraction typically increases PONV risk despite lowering volatile MAC."
      },
      {
        "text": "Place a transdermal scopolamine patch now",
        "isCorrect": false,
        "explanation": "This adds pharmacologic prophylaxis rather than reducing baseline risk and has delayed onset (hours), offering little immediate benefit in an ongoing case; the prompt also restricts adding antiemetics."
      }
    ],
    "didactic": "Baseline PONV risk can be lowered by modifying the anesthetic technique and perioperative physiology before adding antiemetic drugs. Volatile anesthetics and N2O are emetogenic; switching to propofol TIVA removes these triggers and provides a risk reduction comparable to or greater than a single antiemetic, with additive benefit when combined with prophylaxis. Avoiding N2O is particularly helpful in long or laparoscopic procedures. Opioid-sparing multimodal analgesia (acetaminophen, NSAIDs, low-dose ketamine 0.2–0.5 mg/kg, IV lidocaine, regional blocks) reduces postoperative opioid exposure, further lowering PONV risk. Adequate hydration (e.g., targeting euvolemia with balanced crystalloids) provides a modest additional reduction. Practical approach in high-risk patients (e.g., high Apfel score): use propofol TIVA when feasible, avoid N2O, minimize opioids with multimodal analgesia, and ensure hydration; then layer pharmacologic prophylaxis as available.",
    "educationalObjective": "Reduce baseline risk with TIVA, opioid-sparing analgesia, hydration, and avoidance of nitrous when feasible."
  },
  {
    "id": "Core.6.5.9",
    "category": "General Anesthesia & Postop",
    "subcategory": "PONV prevention and treatment",
    "difficulty": "easy",
    "questionText": "A 35-year-old woman (nonsmoker) with a history of severe postoperative nausea and vomiting (PONV) presents for a 2-hour laparoscopic cholecystectomy under general anesthesia. You plan to use volatile anesthesia and perioperative opioids. Immediately after induction, your nurse asks when to administer dexamethasone and ondansetron for optimal PONV prophylaxis. To maximize efficacy in the PACU, which timing strategy is best?",
    "answers": [
      {
        "text": "Administer dexamethasone 8 mg IV and ondansetron 4 mg IV together at induction",
        "isCorrect": false,
        "explanation": "Giving ondansetron at induction is too early; with a $t_{1/2}$ of ~3–4 h and onset within minutes, its effect may wane by early PACU for a 2-hour case. This reflects the misconception that all antiemetics should be front-loaded at induction."
      },
      {
        "text": "Administer dexamethasone 8 mg IV at induction and ondansetron 4 mg IV 15–30 minutes before emergence",
        "isCorrect": true,
        "explanation": "Dexamethasone has a delayed onset (approximately 1–2 h), so induction dosing aligns peak effect with the early postoperative period. Ondansetron has a rapid onset and shorter duration; dosing near case end best covers the immediate PACU window when emetogenic stimuli peak."
      },
      {
        "text": "Administer both dexamethasone 8 mg IV and ondansetron 4 mg IV at the end of surgery",
        "isCorrect": false,
        "explanation": "Dosing dexamethasone at the end misses its delayed onset and offers minimal benefit in early PACU. This stems from the misconception that all agents should be given when the patient is most symptomatic rather than timed to pharmacodynamics."
      },
      {
        "text": "Administer ondansetron 4 mg IV at induction and dexamethasone 8 mg IV at the end of surgery",
        "isCorrect": false,
        "explanation": "This reverses optimal timing: early ondansetron may wear off by PACU, while late dexamethasone has not yet taken effect. The error is misunderstanding that glucocorticoids require early administration, whereas 5-HT3 antagonists are most effective when given near emergence."
      },
      {
        "text": "Administer dexamethasone 8 mg IV at induction and repeat ondansetron 4 mg IV every 30 minutes intraoperatively",
        "isCorrect": false,
        "explanation": "Repeated ondansetron dosing intraoperatively is not evidence-based, increases QTc risk, and offers no added efficacy. The misconception is that more frequent dosing improves prophylaxis rather than proper timing."
      }
    ],
    "didactic": "Antiemetic timing should match pharmacodynamics and the emetogenic timeline. Dexamethasone has a delayed onset (~1–2 h) with long duration (~24 h), so give it at induction to align effect with the early postoperative period. 5-HT3 antagonists (e.g., ondansetron) have rapid onset (minutes), peak within 30–60 minutes, and a $t_{1/2}$ of ~3–4 h; administer 15–30 minutes before emergence to cover the PACU when gut serotonin release and vagal activation are highest. Practical rule: steroid early, 5-HT3 late. Scopolamine transdermal requires preoperative placement (≥2–4 h), and droperidol or haloperidol are typically given near case end; neurokinin-1 antagonists (e.g., aprepitant) are given preop (1–3 h). For high-risk patients, combine classes with proper timing and minimize emetogenic triggers (volatile agents, nitrous oxide, opioids) when feasible.",
    "educationalObjective": "Time antiemetics correctly (e.g., dexamethasone at induction; ondansetron near case end) to maximize efficacy."
  },
  {
    "id": "Core.6.5.10",
    "category": "General Anesthesia & Postop",
    "subcategory": "PONV prevention and treatment",
    "difficulty": "medium",
    "questionText": "A 36-year-old woman with a history of severe motion sickness and prior postoperative nausea and vomiting (PONV) is scheduled for outpatient laparoscopic cholecystectomy at 07:30. She will be discharged the same day and faces a 90-minute, winding car ride home. Anesthesia will be TIVA with propofol and fentanyl; dexamethasone will be given after induction and ondansetron at closure. She asks about using a scopolamine patch to help with the ride home. She has no glaucoma, urinary retention, or cognitive impairment.\n\nWhich of the following is the most appropriate use of transdermal scopolamine for this patient?",
    "answers": [
      {
        "text": "Instruct her to apply a transdermal scopolamine patch the evening before surgery (or ≥4 hours preop) and keep it on for up to 72 hours, with counseling about dry mouth, blurred vision/mydriasis from ocular contamination, urinary retention, and confusion in susceptible patients.",
        "isCorrect": true,
        "explanation": "Transdermal scopolamine has an onset of 2–4 hours (peak ~6 hours) and provides sustained antiemetic effect for motion-related nausea; proper timing and counseling about anticholinergic side effects are essential."
      },
      {
        "text": "Apply the patch in pre-op holding 30 minutes before induction to provide immediate protection during the car ride home.",
        "isCorrect": false,
        "explanation": "Onset is not immediate; applying ≤1 hour before surgery provides little early benefit for the ride home and underestimates the delayed onset (2–4 hours)."
      },
      {
        "text": "Place the patch in the PACU and instruct her to remove it after 6 hours to minimize urinary retention risk.",
        "isCorrect": false,
        "explanation": "PACU placement is too late for the car ride, and routine early removal is unnecessary; urinary retention is possible but managed by patient selection and counseling, not arbitrary early removal."
      },
      {
        "text": "Avoid scopolamine because concomitant TIVA markedly increases the risk of oversedation and respiratory depression.",
        "isCorrect": false,
        "explanation": "Scopolamine may cause mild sedation or confusion, but it does not meaningfully potentiate respiratory depression with TIVA; its main risks are anticholinergic effects and CNS delirium in susceptible patients."
      },
      {
        "text": "Place a scopolamine patch the morning of surgery but cut it in half to reduce side effects while preserving antiemetic efficacy.",
        "isCorrect": false,
        "explanation": "Do not cut transdermal patches; it disrupts drug delivery and does not solve the timing problem. The patch still requires several hours for effect even at a reduced dose."
      }
    ],
    "didactic": "Transdermal scopolamine is a central M1-antagonist particularly effective for vestibular (motion-related) nausea and for reducing late PONV in ambulatory patients. The standard 1.5 mg patch delivers approximately 1 mg over 72 hours and has an onset of 2–4 hours with peak effect around 6 hours; therefore, it should be applied the evening before or at least several hours preoperatively if early protection is desired. It complements 5-HT3 antagonists and dexamethasone by targeting a different pathway and is poor for rescue of established nausea due to its slow onset. Anticholinergic adverse effects include dry mouth, blurred vision/mydriasis (often from hand-to-eye transfer), tachycardia, urinary retention, and confusion or delirium—use caution in older adults, patients with narrow-angle glaucoma, and those with significant prostatic hypertrophy. Counsel patients to wash hands after handling the patch and to remove it if troublesome side effects occur; unilateral mydriasis after accidental ocular exposure is benign and resolves with time. Practical rule: for motion-sensitive, high-risk outpatients, apply the patch ≥4 hours preop and leave in place up to 72 hours to cover the car ride home and the vulnerable first postoperative day.",
    "educationalObjective": "Use transdermal scopolamine for motion-related nausea with attention to timing and anticholinergic side effects."
  },
  {
    "id": "Core.6.6.1",
    "category": "General Anesthesia & Postop",
    "subcategory": "RSI and aspiration risk",
    "difficulty": "hard",
    "questionText": "A 56-year-old man (BMI 35) with small-bowel obstruction and frequent emesis is brought for emergent laparotomy. After thorough preoxygenation ($\\mathrm{FiO_2}=1.0$), you perform RSI with propofol and succinylcholine. Cricoid pressure has been applied by a trained assistant since loss of consciousness. On the first laryngoscopy attempt, you obtain a Cormack–Lehane grade 3 view; external laryngeal manipulation does not help. SpO$_2$ falls from 100% to 86% over 45 seconds. You pause to ventilate but note poor chest rise, high mask pressures, and minimal capnography while cricoid pressure is maintained. The stomach is not distended, and there is no visible regurgitation in the oropharynx.\n\nWhich immediate action is the most appropriate to restore oxygenation while minimizing overall harm?",
    "answers": [
      {
        "text": "Release cricoid pressure completely and initiate gentle bag-mask ventilation with PEEP using 100% O2",
        "isCorrect": true,
        "explanation": "When cricoid pressure impedes ventilation or intubation with desaturation, it should be released to prioritize oxygenation; aspiration risk is outweighed by the imminent risk of hypoxemia. Releasing CP facilitates bag-mask ventilation and is supported by airway guidelines."
      },
      {
        "text": "Increase cricoid pressure to 40 N and attempt another laryngoscopy without ventilating",
        "isCorrect": false,
        "explanation": "Increasing force commonly worsens the glottic view and further impedes ventilation; it does not reliably occlude the esophagus due to lateral displacement. Persisting with intubation during desaturation violates the oxygenation-first principle."
      },
      {
        "text": "Maintain cricoid pressure and insert a supraglottic airway to oxygenate",
        "isCorrect": false,
        "explanation": "Cricoid pressure frequently obstructs insertion and seating of supraglottic devices and reduces seal pressure. If an SGA is chosen, CP should be eased or released to allow placement and ventilation."
      },
      {
        "text": "Maintain cricoid pressure and attempt a bougie-assisted intubation as the next step",
        "isCorrect": false,
        "explanation": "Bougie use may help a poor view, but oxygenation takes priority when SpO$_2$ is falling and mask ventilation is ineffective. Continuing intubation attempts under CP in a desaturating patient increases hypoxemia risk."
      },
      {
        "text": "Convert the assistant’s cricoid pressure to firm external laryngeal manipulation while keeping the airway closed to ventilation",
        "isCorrect": false,
        "explanation": "External laryngeal manipulation (bimanual) can improve the view, but it does not address the current failure to ventilate. With worsening hypoxemia, restoring ventilation by easing or releasing CP is indicated first."
      }
    ],
    "didactic": "Cricoid pressure aims to compress the esophagus against the vertebral body to reduce passive regurgitation, typically at ~10 N while awake and ~30 N after loss of consciousness. Its efficacy is inconsistent: the esophagus may be lateral to the cricoid, and CP can worsen the laryngoscopic view, impede bag-mask ventilation, and hinder supraglottic airway or gastric tube insertion. Airway safety prioritizes oxygenation; if CP interferes with laryngoscopy or ventilation, it should be adjusted (lightened, repositioned) and, if needed, released—especially in a cannot-intubate/cannot-ventilate or desaturation scenario. Maintain CP only until the endotracheal cuff is inflated and placement is confirmed by sustained ETCO$_2$; do not let CP delay lifesaving ventilation. If active vomiting or forceful retching occurs, release CP to avoid esophageal rupture while suctioning and positioning (e.g., head-down). Practical rule: lighten CP first to assess improvement; if ineffective and oxygenation is threatened, release completely to restore ventilation.",
    "educationalObjective": "Apply and manage cricoid pressure correctly, including when to ease or release it to improve laryngoscopy or ventilation."
  },
  {
    "id": "Core.6.6.2",
    "category": "General Anesthesia & Postop",
    "subcategory": "RSI and aspiration risk",
    "difficulty": "medium",
    "questionText": "A 62-year-old man with a high-grade small-bowel obstruction presents for urgent laparotomy. He has had multiple episodes of bilious emesis and abdominal distension. An NG tube placed in the ED has drained 1.2 L and is currently clamped for transport. In the OR he is hemodynamically stable, alert, and supine. You plan a rapid-sequence induction with a cuffed ETT. Which of the following is the best next step to reduce aspiration risk before induction?",
    "answers": [
      {
        "text": "Remove the NG tube to avoid interference with laryngoscopy and proceed with standard supine RSI",
        "isCorrect": false,
        "explanation": "Removing the NG tube eliminates the ability to decompress the stomach immediately prior to induction, increasing residual volume and aspiration risk; supine positioning also increases intragastric pressure."
      },
      {
        "text": "Place the patient $20^\\circ$ head-up and actively suction the NG tube immediately before RSI",
        "isCorrect": true,
        "explanation": "Head-up positioning reduces regurgitation by lowering intragastric pressure and increasing barrier pressure, and immediate NG suction decreases gastric volume—both key in small-bowel obstruction."
      },
      {
        "text": "Keep the patient supine and apply cricoid pressure during preoxygenation to prevent regurgitation",
        "isCorrect": false,
        "explanation": "Cricoid pressure does not reduce gastric volume and may worsen mask ventilation or glottic view; supine positioning increases aspiration risk compared with head-up."
      },
      {
        "text": "Provide several large-tidal-volume mask breaths to deepen anesthesia prior to intubation",
        "isCorrect": false,
        "explanation": "Positive-pressure mask ventilation with high inspiratory pressures increases gastric insufflation and intragastric pressure, worsening aspiration risk."
      },
      {
        "text": "Administer IV ranitidine and metoclopramide 5 minutes pre-induction",
        "isCorrect": false,
        "explanation": "H2 blockers require ≥30–60 minutes to meaningfully reduce acid secretion, and metoclopramide is not useful (and may be harmful) in mechanical obstruction; neither addresses the immediate large gastric volume."
      }
    ],
    "didactic": "Aspiration risk is driven primarily by gastric volume and the gradient favoring regurgitation (barrier pressure). Barrier pressure can be conceptualized as $\\text{LES pressure} - \\text{intragastric pressure}$; positioning $20$–$30^\\circ$ head-up lowers intragastric pressure and reduces passive regurgitation. In conditions with probable large residual gastric volume—bowel obstruction, active vomiting, or severe symptomatic gastroparesis—gastric decompression with NG/OG suction immediately before induction is indicated. During RSI, avoid or minimize mask ventilation; if absolutely necessary, keep inspiratory pressure $<12$–$15$ cm H2O to limit gastric insufflation. Pharmacologic measures are adjuncts: nonparticulate antacids (e.g., sodium citrate) raise pH rapidly, whereas H2 blockers/PPIs require time and metoclopramide is for gastroparesis, not mechanical obstruction. Cricoid pressure has mixed evidence and should not delay intubation or impair ventilation; prioritize head-up positioning, active decompression, prompt intubation, and cuff inflation.",
    "educationalObjective": "Assess and reduce aspiration risk in gastroparesis, bowel obstruction, or severe GERD, including gastric decompression when indicated."
  },
  {
    "id": "Core.6.6.3",
    "category": "General Anesthesia & Postop",
    "subcategory": "RSI and aspiration risk",
    "difficulty": "medium",
    "questionText": "A 35-year-old man (90 kg) presents for emergent laparotomy for peritonitis and small-bowel distention 10 days after a 20% TBSA flame burn to the trunk and thighs. He is awake, in moderate pain, and has received an NG tube but continues to belch gastric contents. Vitals: BP 132/78 mm Hg, HR 105/min, SpO2 99% on room air. Labs: K+ 4.6 mEq/L, Cr 0.9 mg/dL. You plan a true RSI (no mask ventilation) with video laryngoscopy; the cart stocks sugammadex. Airway exam is routine. Which neuromuscular blocker strategy is most appropriate to optimize RSI conditions while minimizing catastrophic complications in this patient?",
    "answers": [
      {
        "text": "Administer succinylcholine 1.5 mg/kg for RSI",
        "isCorrect": false,
        "explanation": "Burns >24–48 hours upregulate extrajunctional ACh receptors; succinylcholine can cause dangerous hyperkalemia even with a normal baseline K+. Using succinylcholine here risks malignant arrhythmias."
      },
      {
        "text": "Administer rocuronium 1.2 mg/kg IV and have sugammadex 16 mg/kg immediately available for rescue",
        "isCorrect": true,
        "explanation": "High-dose rocuronium (1.0–1.2 mg/kg) provides intubating conditions in ~60 s and avoids succinylcholine-induced hyperkalemia in subacute burns; burn-related resistance favors the higher dose. Sugammadex 16 mg/kg can rapidly reverse profound block if a can’t intubate, can’t ventilate scenario occurs, and normal renal function supports its use."
      },
      {
        "text": "Administer rocuronium 0.6 mg/kg to shorten duration and reduce apnea time",
        "isCorrect": false,
        "explanation": "A 0.6 mg/kg dose has slower onset and inferior RSI conditions, increasing aspiration risk; burn patients are relatively resistant to nondepolarizers, further delaying onset. Shorter duration is not helpful if intubating conditions are inadequate."
      },
      {
        "text": "Give a defasciculating dose of rocuronium (0.03 mg/kg) followed by succinylcholine 1.0 mg/kg",
        "isCorrect": false,
        "explanation": "Precurarization does not prevent succinylcholine-induced hyperkalemia and can delay onset or worsen intubating conditions. Succinylcholine remains contraindicated after subacute burns."
      },
      {
        "text": "Administer vecuronium 0.1 mg/kg to avoid hyperkalemia",
        "isCorrect": false,
        "explanation": "Vecuronium has a slower onset than high-dose rocuronium and is suboptimal for RSI. It avoids hyperkalemia but sacrifices rapid, reliable intubating conditions needed in a full-stomach patient."
      }
    ],
    "didactic": "For RSI, succinylcholine (1.0–1.5 mg/kg) provides the fastest onset (~30–60 s) but is contraindicated in conditions that upregulate extrajunctional ACh receptors (e.g., burns after 24–48 h, denervation, stroke, prolonged immobilization, neuromuscular disease) due to risk of severe hyperkalemia. High-dose rocuronium (1.0–1.2 mg/kg) achieves similar intubating conditions at ~60 s but with longer duration (typically 45–70 min); burn-related resistance to nondepolarizers supports using the higher end of dosing. Sugammadex forms tight complexes with aminosteroid NMBs; 16 mg/kg can immediately reverse profound block shortly after 1.2 mg/kg rocuronium and is the recommended dose for CICV rescue. Avoid relying on sugammadex in severe renal failure because clearance of the rocuronium–sugammadex complex is impaired; otherwise, it is appropriate to have it drawn up for RSI rescue. Neostigmine cannot rapidly reverse deep blockade and is not suitable for immediate rescue. Practical rule: if succinylcholine is contraindicated, use rocuronium 1.2 mg/kg and plan for sugammadex 16 mg/kg rescue when renal function is adequate.",
    "educationalObjective": "Choose succinylcholine versus high-dose rocuronium for RSI and plan for sugammadex rescue when appropriate."
  },
  {
    "id": "Core.6.6.4",
    "category": "General Anesthesia & Postop",
    "subcategory": "RSI and aspiration risk",
    "difficulty": "medium",
    "questionText": "A 57-year-old man with a small-bowel obstruction (repeated vomiting), BMI 42, and obstructive sleep apnea presents for urgent laparotomy. He is preoxygenated in the ramped position to an end-tidal O2 of 90% and undergoes RSI with etomidate and succinylcholine while cricoid pressure is applied. Thirty-five seconds after loss of consciousness, SpO2 falls from 100% to 88%, and the video laryngoscope is not yet ready; you anticipate at least 30–45 more seconds before intubation can be attempted. Which of the following is the most appropriate immediate step to prevent hypoxemia while minimizing aspiration risk?",
    "answers": [
      {
        "text": "Begin two-person mask ventilation with 100% O2 using a tight jaw-thrust seal, limiting peak inspiratory pressure to $\\le 12\\ \\text{cm H2O}$ (PEEP 0–5) with small tidal volumes.",
        "isCorrect": true,
        "explanation": "Gentle mask ventilation prevents critical hypoxemia in patients with low FRC while keeping peak pressure below the approximate esophageal opening pressure, thereby minimizing gastric insufflation and aspiration risk. A two-hand seal and jaw thrust allow effective ventilation at low pressures."
      },
      {
        "text": "Avoid any ventilation and proceed directly to laryngoscopy as soon as the equipment arrives, accepting transient desaturation.",
        "isCorrect": false,
        "explanation": "“No-ventilation” RSI increases the risk of severe hypoxemia in obese or hypoxemic patients who desaturate rapidly; in this context, the benefit of gentle low-pressure ventilation outweighs the small incremental aspiration risk."
      },
      {
        "text": "Provide rapid mask ventilation with high flows targeting a peak inspiratory pressure of $25\\ \\text{cm H2O}$ to quickly restore SpO2.",
        "isCorrect": false,
        "explanation": "High peak pressures ($\\gtrsim 15$–$20\\ \\text{cm H2O}$) increase gastric insufflation and aspiration risk. Oxygenation should be restored using low-pressure breaths rather than forceful ventilation."
      },
      {
        "text": "Insert a laryngeal mask airway to re-oxygenate and then intubate through it once stabilized.",
        "isCorrect": false,
        "explanation": "An LMA is not preferred in a full-stomach RSI because it can increase aspiration risk and delays definitive airway control; mask ventilation at low pressures is faster and safer here."
      },
      {
        "text": "Maintain firm cricoid pressure and rely on apneic oxygenation via high-flow nasal cannula, avoiding any mask ventilation.",
        "isCorrect": false,
        "explanation": "Apneic oxygenation can prolong safe apnea but is not a rescue for rapidly falling SpO2; once desaturation is underway, active ventilation is needed. Cricoid pressure alone does not improve oxygenation."
      }
    ],
    "didactic": "Gentle mask ventilation during RSI is justified when the risk of rapid desaturation is high (obesity, pregnancy, pediatrics, preexisting hypoxemia) or when intubation is delayed. To minimize gastric insufflation, keep peak inspiratory pressure below the esophageal opening pressure (roughly $15$–$20\\ \\text{cm H2O}$); many adopt a conservative target of $\\le 12$–$15\\ \\text{cm H2O}$. Use a two-person mask seal with jaw thrust, 100% O2, small tidal volumes (about $4$–$6\\ \\text{mL/kg}$ IBW), and a slow rate (6–8/min); if using PEEP, ensure $\\text{Peak} = \\text{PEEP} + \\text{Driving pressure} \\le 12$–$15\\ \\text{cm H2O}$. Head-up/ramped positioning increases FRC and improves preoxygenation; consider nasal apneic oxygenation as an adjunct but not as a rescue once SpO2 is falling. If cricoid pressure impedes ventilation or laryngoscopy, it should be adjusted or released. The key principle is that insufflation risk is pressure-driven, so prioritize low peak airway pressures while promptly restoring oxygenation.",
    "educationalObjective": "Decide when gentle mask ventilation during RSI is justified to prevent hypoxemia and how to limit insufflation."
  },
  {
    "id": "Core.6.6.5",
    "category": "General Anesthesia & Postop",
    "subcategory": "RSI and aspiration risk",
    "difficulty": "medium",
    "questionText": "A 58-year-old man presents for urgent laparotomy for small-bowel obstruction after 24 hours of bilious emesis and abdominal distension. He last ate 10 hours ago but has had persistent vomiting. Vitals: BP 148/82 mm Hg, HR 105/min, SpO2 97% on room air. Airway exam: Mallampati IV, inter-incisor distance 2 cm, thyromental distance ~5 cm, limited neck extension from ankylosing spondylitis, and a thick beard. The surgical team is ready and requests rapid induction. Which airway management strategy is MOST appropriate to minimize aspiration risk while maximizing patient safety?\n\n",
    "answers": [
      {
        "text": "Awake flexible bronchoscopy–guided endotracheal intubation after topicalization and minimal sedation, followed by induction of anesthesia",
        "isCorrect": true,
        "explanation": "Severe aspiration risk (small-bowel obstruction, ongoing emesis) plus multiple predictors of a difficult airway (limited mouth opening, limited neck extension, beard) favors an awake intubation to maintain spontaneous ventilation and airway reflexes until the airway is secured. This approach minimizes the risk of a \"can’t intubate, can’t oxygenate\" scenario that would be more dangerous under paralysis."
      },
      {
        "text": "Standard rapid sequence induction with cricoid pressure, no mask ventilation, and succinylcholine",
        "isCorrect": false,
        "explanation": "RSI minimizes time with an unprotected airway in full-stomach patients, but it is unsafe here given strong predictors of both difficult laryngoscopy and difficult mask ventilation. Paralysis before securing the airway increases the risk of failed ventilation and hypoxemia; cricoid pressure can also worsen glottic view."
      },
      {
        "text": "Modified RSI with gentle mask ventilation and rocuronium to mitigate desaturation risk",
        "isCorrect": false,
        "explanation": "Modified RSI (gentle BMV ≤15 cm H2O) is useful when desaturation risk is high and the airway is expected to be straightforward. In this case, the major problem is a predicted difficult airway; adding paralysis still risks a failed airway while gastric insufflation may worsen aspiration risk in obstruction."
      },
      {
        "text": "Inhalational induction maintaining spontaneous ventilation, then intubation after deep anesthesia",
        "isCorrect": false,
        "explanation": "A prolonged inhalational induction in an adult with a full stomach increases time with an unprotected airway and risks regurgitation/aspiration. It also does not mitigate the anticipated difficult laryngoscopy and may lead to loss of airway reflexes without a secured airway."
      },
      {
        "text": "Supraglottic airway placement after IV induction as a bridge, then intubation through the device after gastric decompression",
        "isCorrect": false,
        "explanation": "Supraglottic airways do not reliably protect against aspiration, especially in small-bowel obstruction, and insertion may be limited by the 2-cm mouth opening. Using an SGA as a bridge in this setting exposes the patient to unnecessary aspiration risk."
      }
    ],
    "didactic": "RSI is indicated when aspiration risk is high (e.g., small-bowel obstruction, trauma, pregnancy ≥20 weeks, symptomatic GERD/hiatal hernia, obesity, diabetes gastroparesis, or inadequate NPO) and the airway is expected to be straightforward. When hypoxemia risk is prominent but the airway is not predicted to be difficult, a modified RSI with gentle mask ventilation (keep inspiratory pressure ≤$12$–$15$ cm H2O), head-up positioning, and apneic oxygenation can balance oxygenation and aspiration concerns. When high aspiration risk coexists with a predicted difficult airway (difficult laryngoscopy, difficult mask ventilation, limited mouth opening, cervical immobility), an awake intubation that preserves spontaneous ventilation and airway reflexes is safest. Practical steps include aggressive preoxygenation ($3$–$5$ min at FiO2 $=1.0$), ramped positioning, pharmacologic prophylaxis if time allows (nonparticulate antacid, H2 blocker, metoclopramide), and gastric decompression. Use rocuronium $1.2$ mg/kg (or succinylcholine $1$–$1.5$ mg/kg) for RSI when chosen, and limit positive-pressure ventilation pressures to reduce insufflation. Apply cricoid pressure only if it does not impede ventilation or laryngoscopy; release if it worsens the view. A simple rule: full stomach + easy airway → RSI; full stomach + high desaturation risk but easy airway → modified RSI; full stomach + difficult airway → awake intubation.",
    "educationalObjective": "Identify clinical indications for rapid sequence induction (RSI) and when modified RSI or awake intubation is safer."
  },
  {
    "id": "Core.6.6.6",
    "category": "General Anesthesia & Postop",
    "subcategory": "RSI and aspiration risk",
    "difficulty": "hard",
    "questionText": "A 28-year-old man with blunt polytrauma (SBP 92/56 mm Hg, HR 118/min, SpO2 97% on nonrebreather) is rushed to the OR for emergent laparotomy after a positive FAST. He is agitated, last ate 1 hour before the crash, and has midline cervical tenderness; CT of the cervical spine is pending. You remove the anterior portion of the cervical collar and perform rapid-sequence induction with manual in-line stabilization (MILS), apneic oxygenation via nasal cannula at 15 L/min, and a hyperangulated video laryngoscope. An assistant applies cricoid pressure at induction. On laryngoscopy you see only the epiglottis (Cormack–Lehane III) despite optimal blade positioning, and SpO2 drifts to 94%. Suction is ready at the bedside. Which is the best immediate action to facilitate tracheal intubation while minimizing aspiration risk and cervical spine motion?",
    "answers": [
      {
        "text": "Ask the assistant to release or reduce cricoid pressure, apply optimal external laryngeal manipulation, and pass a bougie under video guidance while maintaining MILS.",
        "isCorrect": true,
        "explanation": "Cricoid pressure often worsens the glottic view and is not proven to prevent aspiration; reducing/releasing it improves exposure. Using a bougie with VL under MILS increases first-pass success without additional cervical motion."
      },
      {
        "text": "Increase cricoid pressure and switch to direct laryngoscopy while maintaining the head in sniffing position.",
        "isCorrect": false,
        "explanation": "More cricoid pressure commonly degrades the view and distorts the airway. Sniffing position and switching to DL increase cervical motion and violate spine precautions."
      },
      {
        "text": "Insert an orogastric tube now to decompress the stomach before reattempting laryngoscopy.",
        "isCorrect": false,
        "explanation": "OG/NG placement before securing the airway can provoke regurgitation and delay intubation. Gastric decompression should occur after the cuffed ETT is in place."
      },
      {
        "text": "Abort and awaken the patient for awake flexible bronchoscopy after cervical spine imaging.",
        "isCorrect": false,
        "explanation": "This unstable trauma patient requires an emergent airway and laparotomy; awakening delays life-saving care. RSI with VL and MILS is appropriate; optimize the current attempt by addressing cricoid pressure."
      },
      {
        "text": "Provide positive-pressure mask ventilation with 25–30 cm H2O inspiratory pressures to restore oxygenation before retrying.",
        "isCorrect": false,
        "explanation": "High mask pressures increase gastric insufflation and aspiration risk. If ventilation is needed, use two-handed mask, PEEP, and keep inspiratory pressure $\\le 20$ cm H2O; here, improving the view and intubating promptly is preferable."
      }
    ],
    "didactic": "In trauma RSI with suspected cervical spine injury, maintain manual in-line stabilization (MILS), remove the anterior collar for access, and favor video laryngoscopy to minimize cervical motion compared to direct laryngoscopy. Cricoid pressure has not been shown to reliably prevent aspiration and frequently worsens the laryngoscopic view; it should be reduced or released if it impedes ventilation or intubation, and replaced with optimal external laryngeal manipulation. First-pass success is critical—adjuncts such as a bougie markedly improve success under difficult views with VL while preserving neutral neck position. If oxygenation deteriorates, gentle two-handed mask ventilation is acceptable using PEEP and keeping inspiratory pressure $\\le 20$ cm H2O (near or below lower esophageal sphincter pressure of $\\sim$20–25 cm H2O) to limit gastric insufflation; prioritize suction readiness and apneic oxygenation. Gastric decompression should be performed after securing a cuffed endotracheal tube. Practical sequence: preoxygenate (consider HFNC for apneic oxygenation), MILS with anterior collar off, VL, avoid or loosen cricoid if it degrades the view, apply external laryngeal manipulation, use a bougie early, and have a clear failed-airway plan.",
    "educationalObjective": "Integrate cervical spine precautions and aspiration risk mitigation in the trauma patient requiring RSI."
  },
  {
    "id": "Core.6.6.7",
    "category": "General Anesthesia & Postop",
    "subcategory": "RSI and aspiration risk",
    "difficulty": "hard",
    "questionText": "A 32-year-old G2P1 at 39 weeks with BMI 36 presents for a category-1 emergency cesarean delivery under general anesthesia due to persistent fetal bradycardia. She ate a full meal 2 hours ago. There is no functioning neuraxial catheter. In the OR, standard monitors are applied; BP is 115/70 mm Hg and HR 105 bpm. When placed flat, she reports lightheadedness and the NIBP transiently drops to 90/55 mm Hg. A wedge is unavailable, but the table can be tilted and a second provider is present. You have ~2 minutes before induction. \n\nWhich combination of positioning and airway management steps is most appropriate now to minimize aspiration risk while maintaining maternal oxygenation and hemodynamics?",
    "answers": [
      {
        "text": "Ramped 20–30° head-up with manual left uterine displacement; administer 30 mL 0.3 M sodium citrate; 3 minutes of 100% O2 with 5 cm H2O PEEP plus 10–15 L/min nasal cannula for apneic oxygenation; RSI with cricoid pressure and permissive mask ventilation at ≤20 cm H2O until laryngoscopy",
        "isCorrect": true,
        "explanation": "This approach concurrently mitigates aortocaval compression (LUD), improves preoxygenation (head-up, PEEP, apneic oxygenation), and reduces aspiration risk (nonparticulate antacid, cricoid pressure), while allowing gentle ventilation under ≤20 cm H2O to prevent gastric insufflation."
      },
      {
        "text": "Flat supine; RSI with firm cricoid pressure; no mask ventilation before laryngoscopy to minimize aspiration risk",
        "isCorrect": false,
        "explanation": "Supine positioning worsens aortocaval compression and hypotension, and strict no-mask ventilation increases hypoxemia risk in term parturients with reduced FRC and high O2 consumption."
      },
      {
        "text": "15° Trendelenburg with right-hip bump; RSI with cricoid pressure; avoid PEEP during preoxygenation to prevent gastric insufflation",
        "isCorrect": false,
        "explanation": "Head-down increases regurgitation risk and worsens oxygenation; lack of PEEP reduces preoxygenation efficacy. Aortocaval compression may persist despite a hip bump."
      },
      {
        "text": "Ramped head-up with manual left uterine displacement; omit cricoid pressure to avoid obstructing the view; RSI without cricoid pressure",
        "isCorrect": false,
        "explanation": "While cricoid pressure can be released if it impedes laryngoscopy or ventilation, obstetric RSI still recommends its application at induction to reduce regurgitation risk in a full-stomach patient."
      },
      {
        "text": "Ramped head-up with manual left uterine displacement; preoxygenate, then provide mask ventilation with inspiratory pressures of 30–35 cm H2O; RSI with cricoid pressure",
        "isCorrect": false,
        "explanation": "High mask pressures promote gastric insufflation by exceeding barrier pressure; gentle ventilation with inspiratory pressures ≤20 cm H2O is preferred to balance oxygenation and aspiration risk."
      }
    ],
    "didactic": "Term pregnancy increases aspiration risk via decreased lower esophageal sphincter tone and increased intra-gastric pressure, while reduced FRC and higher VO2 shorten safe apnea time. Best practice for obstetric RSI integrates: left uterine displacement (manual or ~15° tilt) to relieve aortocaval compression; ramped 20–30° head-up positioning to increase FRC; and optimized preoxygenation (100% O2, PEEP ~5 cm H2O, and apneic oxygenation via nasal cannula at 10–15 L/min). Give a nonparticulate antacid (30 mL 0.3 M sodium citrate) immediately before induction; H2 blockers and metoclopramide help when time allows. Apply cricoid pressure at loss of consciousness and maintain until ETT placement is confirmed, but release if it impedes ventilation or laryngoscopy. Gentle mask ventilation is appropriate in parturients to prevent hypoxemia, keeping inspiratory pressure ≤20 cm H2O to minimize gastric insufflation; conceptually, barrier pressure is $P_{LES} - P_{gastric}$, and higher mask pressures erode this margin. Practical rule: LUD + head-up + PEEP + apneic oxygenation + cricoid (with readiness to adjust) yields the safest balance of oxygenation and aspiration precautions in the full-stomach obstetric patient.",
    "educationalObjective": "Manage the full-stomach obstetric patient with left uterine displacement and aspiration precautions."
  },
  {
    "id": "Core.6.6.8",
    "category": "General Anesthesia & Postop",
    "subcategory": "RSI and aspiration risk",
    "difficulty": "easy",
    "questionText": "A 45-year-old woman (BMI 40) with a small-bowel obstruction and repeated emesis is brought for emergent laparotomy. Vitals: BP 152/88, HR 110, RR 22, SpO2 98% on room air. You plan a rapid-sequence induction. The anesthesia machine is checked and functional. You have 3 minutes before the surgeons are ready, and you want to maximize her safe apnea time. Several team members make suggestions as you begin preoxygenation.\n\nWhich intervention will most effectively prolong her safe apnea time before RSI?",
    "answers": [
      {
        "text": "Preoxygenate in a 25° head-up position using a two-hand mask seal with 100% O2 at FGF 10–15 L/min and 5–10 cm H2O CPAP for ~3 minutes (target end-tidal O2 ≥ 90%)",
        "isCorrect": true,
        "explanation": "Head-up positioning increases FRC, and CPAP helps prevent atelectasis, both increasing the alveolar O2 reservoir. A tight mask seal with high FGF speeds denitrogenation and minimizes room-air entrainment, achieving EtO2 ≥ 0.9 and maximally prolonging safe apnea time."
      },
      {
        "text": "Preoxygenate supine for 5 minutes with 100% O2 at FGF 2 L/min using a relaxed one-hand mask seal",
        "isCorrect": false,
        "explanation": "Supine positioning reduces FRC in obese patients, and low FGF plus a loose seal entrain room air, limiting denitrogenation. Time alone cannot overcome ineffective technique; alveolar O2 stores will be suboptimal."
      },
      {
        "text": "Apply cricoid pressure throughout preoxygenation to minimize regurgitation risk",
        "isCorrect": false,
        "explanation": "Early cricoid pressure can worsen mask seal and increase airway resistance, degrading preoxygenation. Cricoid is applied at loss of consciousness for RSI, not during the preoxygenation phase."
      },
      {
        "text": "Use a 50% N2O/50% O2 mixture for preoxygenation to maintain spontaneous respirations",
        "isCorrect": false,
        "explanation": "N2O displaces alveolar O2 and reduces O2 stores, shortening safe apnea time; it also worsens bowel distension in SBO. Preoxygenation should use 100% O2."
      },
      {
        "text": "Have the patient take five vital capacity breaths of 100% O2 and proceed immediately",
        "isCorrect": false,
        "explanation": "The 5-VC breath technique is less effective in obese or tachypneic patients and is inferior to 3 minutes of normal tidal breathing with optimized positioning and seal. It provides insufficient denitrogenation in this context."
      }
    ],
    "didactic": "Safe apnea time is primarily determined by the ratio of O2 stores to O2 consumption: $\\text{Safe apnea time} \\approx \\dfrac{\\text{O2 stores}}{\\dot V_{O2}}$. Alveolar O2 is the largest immediately accessible store and is roughly $\\text{FRC} \\times F_{AO2}$; thus maneuvers that increase functional residual capacity (FRC) and alveolar $F_{O2}$ prolong safe apnea time. In obese patients, a 20–30° head-up (reverse Trendelenburg) position increases FRC and improves preoxygenation; adding CPAP/PEEP (5–10 cm H2O) further prevents atelectasis and augments FRC. A tight two-hand mask seal with high fresh gas flow (≥10–15 L/min) hastens denitrogenation and minimizes air entrainment; target an end-tidal O2 (EtO2) ≥ 0.9 before induction. Avoid N2O during preoxygenation, as it dilutes alveolar O2 and increases bowel distension. Typical $\\dot V_{O2}$ is ~3 mL/kg/min (≈200–250 mL/min in adults), so increasing alveolar O2 content by even 1 L can add several minutes of safe apnea. Optional adjuncts like high-flow nasal cannula for apneic oxygenation can further delay desaturation but do not replace proper preoxygenation with head-up positioning and a tight seal.",
    "educationalObjective": "Optimize preoxygenation with head-up positioning and tight-seal techniques to prolong safe apnea time."
  },
  {
    "id": "Core.6.6.9",
    "category": "General Anesthesia & Postop",
    "subcategory": "RSI and aspiration risk",
    "difficulty": "medium",
    "questionText": "A 62-year-old man with small-bowel obstruction undergoes emergent RSI. During laryngoscopy, copious nonparticulate gastric fluid is seen in the oropharynx. You immediately suction the mouth and quickly intubate. After cuff inflation, endotracheal suctioning yields scant thin fluid without particulate matter. On volume-controlled ventilation ($V_T$ 6 mL/kg IBW, RR 14, $FiO_2$ 1.0, $PEEP$ 0), SpO2 remains 86–88%, peak inspiratory pressure is 35 cm H2O, and coarse crackles are heard bilaterally; hemodynamics are stable. Which is the most appropriate next step in intraoperative management?",
    "answers": [
      {
        "text": "Increase $PEEP$ to 8–10 cm H2O to recruit alveoli and improve oxygenation",
        "isCorrect": true,
        "explanation": "Aspiration pneumonitis causes alveolar flooding and surfactant dysfunction with increased shunt; early application of $PEEP$ (e.g., 8–10 cm H2O) recruits atelectatic units, reduces $Q_s/Q_t$, and improves oxygenation. Recruitment maneuvers may be considered with hemodynamic monitoring."
      },
      {
        "text": "Start prophylactic broad-spectrum antibiotics to prevent aspiration pneumonia",
        "isCorrect": false,
        "explanation": "Chemical (Mendelson) pneumonitis is typically sterile; prophylactic antibiotics do not improve outcomes. Reserve antibiotics for clinical infection (e.g., fever, leukocytosis, purulent secretions, new infiltrate after 48–72 h) or known contaminated/colonized aspirate."
      },
      {
        "text": "Perform routine flexible bronchoscopy with bronchoalveolar lavage",
        "isCorrect": false,
        "explanation": "Bronchoscopy is indicated when particulate material or lobar obstruction is suspected. Routine lavage after nonparticulate aspiration offers no benefit and may worsen injury by dispersing contents distally."
      },
      {
        "text": "Administer methylprednisolone 125 mg IV to attenuate lung inflammation",
        "isCorrect": false,
        "explanation": "Systemic corticosteroids have not shown benefit in aspiration pneumonitis and may increase infection risk. Supportive ventilatory care is preferred."
      },
      {
        "text": "Reduce ventilatory support by switching to zero $PEEP$ to avoid barotrauma",
        "isCorrect": false,
        "explanation": "ZEEP promotes alveolar collapse and worsens shunt in aspiration injury. Lung-protective ventilation includes low $V_T$ with adequate $PEEP$ to maintain recruitment and oxygenation."
      }
    ],
    "didactic": "Immediate management of intraoperative aspiration is airway-first: suction the oropharynx, rapidly secure the trachea, then suction the ETT, deliver 100% $O_2$, and optimize patient positioning (head-up if feasible). Oxygenation typically improves with lung-protective ventilation (low $V_T$ ~6 mL/kg IBW) and application of $PEEP$ (often 5–10 cm H2O) to recruit flooded/atelectatic alveoli and reduce shunt ($Q_s/Q_t$). Flexible bronchoscopy is reserved for suspected particulate aspiration or lobar obstruction; routine lavage after nonparticulate aspiration is not recommended. Prophylactic antibiotics and steroids are not indicated for chemical pneumonitis; start antibiotics only if secondary bacterial infection develops or if contaminated gastric contents are suspected. Obtain a chest radiograph and consider ABG to guide support; aspiration pneumonitis usually evolves within hours and often improves over 24–48 hours with supportive care. Practical rule: suction, secure airway, oxygenate with $PEEP$, consider bronchoscopy for solids, and reserve antibiotics for infection.",
    "educationalObjective": "Outline post-aspiration management: suctioning, oxygenation, PEEP, bronchoscopy as needed, and antibiotics only for infection."
  },
  {
    "id": "Core.6.6.10",
    "category": "General Anesthesia & Postop",
    "subcategory": "RSI and aspiration risk",
    "difficulty": "hard",
    "questionText": "A 56-year-old man (BMI 35) with small-bowel obstruction and repeated vomiting presents for emergent laparotomy. After 3 minutes of preoxygenation at $FiO_2=1.0$, you perform RSI using ketamine and rocuronium $1.2\\,\\text{mg/kg}$ with cricoid pressure. First-pass video laryngoscopy is unsuccessful (copious secretions, Cormack–Lehane 3b); a bougie attempt fails. Two-person mask ventilation with an oral airway, jaw thrust, and 100% O2 yields poor chest rise and no capnography; $SpO_2$ falls from 98% to 82% over 30 seconds. You have a second-generation SGA and a scalpel–bougie cricothyrotomy kit immediately available. What is the most appropriate next step to re-establish oxygenation?",
    "answers": [
      {
        "text": "Insert a second-generation SGA immediately and release cricoid pressure if it impedes placement or ventilation",
        "isCorrect": true,
        "explanation": "Oxygenation takes precedence over aspiration risk in a failed RSI. A second-generation SGA provides the fastest path to oxygenation and permits gastric drainage; cricoid pressure should be lightened or released if it obstructs SGA placement or ventilation."
      },
      {
        "text": "Proceed directly to scalpel–bougie cricothyrotomy without attempting an SGA",
        "isCorrect": false,
        "explanation": "Front-of-neck access is indicated once both mask ventilation and SGA oxygenation fail (true CICO). Because an SGA has not yet been attempted and is immediately available, cricothyrotomy is premature."
      },
      {
        "text": "Administer sugammadex 16 mg/kg to reverse rocuronium and allow the patient to awaken",
        "isCorrect": false,
        "explanation": "Reversal does not restore oxygenation and delays definitive action; hypoxemia may worsen during the time to effect. The priority is to re-oxygenate promptly via SGA or, if that fails, front-of-neck access."
      },
      {
        "text": "Attempt another laryngoscopy with the same device using more external laryngeal manipulation",
        "isCorrect": false,
        "explanation": "Repeated laryngoscopy in a rapidly desaturating RSI delays oxygenation and increases airway trauma. Guidelines recommend pivoting to a rescue oxygenation strategy (SGA) rather than persisting with laryngoscopy."
      },
      {
        "text": "Continue two-person mask ventilation while maintaining cricoid pressure to minimize aspiration",
        "isCorrect": false,
        "explanation": "Cricoid pressure can worsen mask ventilation and SGA insertion. Persisting with ineffective mask ventilation risks severe hypoxemia; prioritize establishing oxygenation, releasing cricoid if it impedes it."
      }
    ],
    "didactic": "In a failed RSI with rapidly declining $SpO_2$, switch immediately to a predefined rescue pathway that prioritizes oxygenation. The ASA difficult airway algorithm supports early use of a second-generation SGA to restore ventilation even in aspiration-risk patients, as hypoxemia is more immediately life-threatening than aspiration; the SGA’s gastric channel allows decompression to mitigate risk. Cricoid pressure can obstruct mask ventilation, laryngoscopy, and SGA placement—lighten or release it if it impairs oxygenation. If both face mask and SGA oxygenation fail (true CICO), proceed without delay to emergency front-of-neck access (e.g., scalpel–bougie cricothyrotomy). Avoid repeated laryngoscopy attempts that delay oxygenation and increase trauma, and do not rely on pharmacologic reversal to solve a mechanical airway problem. Rapid desaturation is expected in obesity and sepsis due to reduced $FRC$ and increased $V_{O2}$, so decisive action within seconds is critical.",
    "educationalObjective": "Recognize failed RSI and initiate a predefined rescue pathway prioritizing oxygenation (SGA or front-of-neck access)."
  },
  {
    "id": "Core.6.6.11",
    "category": "General Anesthesia & Postop",
    "subcategory": "RSI and aspiration risk",
    "difficulty": "medium",
    "questionText": "A 32-year-old man with a penetrating open-globe injury presents for emergent repair. He ate 2 hours ago and is in severe pain and distress. Planned management is a rapid-sequence induction with rocuronium to avoid raising intraocular pressure. Vitals: BP 92/58 mm Hg, HR 118/min, SpO2 98% on face mask. He has no known medical history and a normal neurologic exam. You aim to minimize increases in intraocular and intracranial pressure while maintaining hemodynamic stability during induction.\n\nWhich IV induction agent is the best choice for this RSI?",
    "answers": [
      {
        "text": "Etomidate 0.3 mg/kg IV",
        "isCorrect": true,
        "explanation": "Best choice. Etomidate provides rapid hypnosis with minimal cardiovascular depression and decreases CBF, CMRO2, ICP, and IOP—ideal for an open globe with borderline hypotension. Single-dose adrenal suppression is clinically negligible in this context."
      },
      {
        "text": "Ketamine 1.5 mg/kg IV",
        "isCorrect": false,
        "explanation": "Common misconception: ketamine is always best for hypotension. While ketamine’s sympathomimetic effects can support BP and contemporary data show it does not increase ICP in ventilated TBI, it can modestly increase IOP—undesirable in open-globe injuries—so it is not the optimal choice here."
      },
      {
        "text": "Propofol 2 mg/kg IV",
        "isCorrect": false,
        "explanation": "Propofol reduces ICP and IOP but frequently causes hypotension due to vasodilation and negative inotropy, which could worsen perfusion in an already borderline BP RSI."
      },
      {
        "text": "Thiopental 4 mg/kg IV",
        "isCorrect": false,
        "explanation": "Thiopental lowers CMRO2, CBF, ICP, and IOP but can produce significant vasodilation and myocardial depression, risking hypotension in this patient."
      },
      {
        "text": "Midazolam 0.2 mg/kg IV",
        "isCorrect": false,
        "explanation": "Misconception: benzodiazepines are safer hemodynamically. At induction doses, midazolam has a slower onset, can still depress BP, and provides less predictable conditions for RSI compared with etomidate."
      }
    ],
    "didactic": "Induction agent choice for RSI must balance hemodynamics with neuro-ocular physiology. Etomidate (0.2–0.3 mg/kg) is hemodynamically stable and reduces CBF, CMRO2, ICP, and IOP, making it well-suited for open-globe injuries and suspected elevated ICP. Ketamine (1–2 mg/kg) supports BP via sympathetic stimulation and is generally safe in TBI when ventilated, but it may increase IOP modestly, so it is less desirable for open-globe cases; its direct myocardial depressant effect can also emerge in catecholamine-depleted shock. Propofol and thiopental lower ICP/IOP but often worsen hypotension, compromising cerebral perfusion pressure ($CPP = MAP - ICP$). Midazolam has slower onset and can cause hypotension at induction doses, making it suboptimal for RSI. Practical rule: in borderline hypotension with ocular or intracranial concerns, choose etomidate; in profound shock without ocular constraints, ketamine is reasonable.",
    "educationalObjective": "Select induction agents for RSI based on hemodynamics and intracranial/ocular considerations."
  },
  {
    "id": "Core.6.6.12",
    "category": "General Anesthesia & Postop",
    "subcategory": "RSI and aspiration risk",
    "difficulty": "medium",
    "questionText": "A 54-year-old man (BMI 42) with a small-bowel obstruction and ongoing emesis presents for emergent laparotomy. He is tachypneic but comfortable in a 25° head-up position; SpO2 96% on room air, HR 105, BP 148/86. You preoxygenate with a tight-fitting mask at FiO2 1.0 for 3 minutes and confirm end-tidal O2 of 0.88. You plan a rapid-sequence induction with cricoid pressure and no mask ventilation. To maximize the time to desaturation during laryngoscopy without increasing aspiration risk, which intra-laryngoscopy intervention is best?",
    "answers": [
      {
        "text": "Apply heated, humidified high-flow nasal cannula at 60 L/min and FiO2 1.0 throughout laryngoscopy",
        "isCorrect": true,
        "explanation": "HFNC at 40–70 L/min provides effective apneic oxygenation by delivering high FiO2, flushing pharyngeal dead space, and generating modest nasopharyngeal pressure, which together extend safe apnea time without positive-pressure ventilation. It does not mitigate CO2 rise but maximizes O2 delivery while preserving RSI principles."
      },
      {
        "text": "Leave a standard nasal cannula at 15 L/min in place during laryngoscopy",
        "isCorrect": false,
        "explanation": "Conventional nasal cannula apneic oxygenation at 10–15 L/min improves time to desaturation, but its effect is smaller than HFNC because it provides less pharyngeal washout and minimal pressure support; thus it is not the most effective option."
      },
      {
        "text": "Perform gentle mask ventilation with PEEP 10 cm H2O while maintaining cricoid pressure",
        "isCorrect": false,
        "explanation": "Although gentle ventilation can improve oxygenation, it introduces positive pressure and gastric insufflation risk in a patient with high aspiration risk, conflicting with classic RSI principles; the question asks for an option that does not increase aspiration risk."
      },
      {
        "text": "Increase the anesthesia machine fresh gas flow to 15 L/min O2 during laryngoscopy",
        "isCorrect": false,
        "explanation": "Raising FGF only increases flow to the breathing circuit; during laryngoscopy the patient is not connected, so this does not deliver oxygen to the airway and will not extend safe apnea time."
      },
      {
        "text": "Intermittently press the oxygen flush valve during laryngoscopy",
        "isCorrect": false,
        "explanation": "The oxygen flush delivers high flow to the circuit, not the patient, and provides no apneic oxygenation when the patient is not connected; it also risks barotrauma if inadvertently delivered while connected."
      }
    ],
    "didactic": "Apneic oxygenation exploits ongoing O2 uptake (~250 mL/min) to draw O2 from the pharynx into alveoli even without ventilation; safe apnea time roughly scales with O2 stores (FRC × alveolar O2 fraction) divided by VO2. HFNC (40–70 L/min, FiO2 1.0) is superior to standard nasal cannula because it provides continuous high FiO2, flushes CO2-rich nasopharyngeal gas, and generates low-level CPAP (≈2–5 cm H2O with mouth closed), all of which slow desaturation without applying positive-pressure breaths. Standard nasal cannula at 10–15 L/min also helps and is better than nothing, but the effect size is smaller than HFNC. Apneic oxygenation does not prevent hypercapnia: PaCO2 typically rises ~6 mm Hg in the first minute and ~3–6 mm Hg/min thereafter. Shunt physiology (obesity, pregnancy, atelectasis) reduces the benefit but does not negate it; maximizing preoxygenation (head-up, FiO2 1.0, EtO2 ≥ 0.8) and leaving HFNC in place during laryngoscopy can meaningfully extend safe apnea time. Positive-pressure mask ventilation may improve oxygenation but increases gastric insufflation risk in classic RSI; nasal apneic oxygenation achieves the goal without that trade-off.",
    "educationalObjective": "Use apneic oxygenation (e.g., nasal cannula/HFNC) during laryngoscopy to extend safe apnea time."
  }
]