[
  {
    "id": "Core.3.1.1",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "Discharge criteria and follow-up",
    "difficulty": "easy",
    "questionText": "A 45-year-old ASA II patient undergoes outpatient knee arthroscopy under general anesthesia with an LMA and an adductor canal block. Ninety minutes after arrival to PACU, he is awake, oriented, and conversing. Pain is 3/10 after oral oxycodone–acetaminophen, and he reports mild nausea without emesis after ondansetron. Vitals: BP 128/78 mm Hg (preop 120/75), HR 88/min (preop 80), RR 16/min, SpO2 94% on room air. He stands and ambulates ~20 feet with crutches and assistance without dizziness. The surgical dressing has scant spotting. His spouse is present to drive him home and remain with him.\n\nBased on standardized discharge scoring for ambulatory surgery, what is the most appropriate next step?",
    "answers": [
      {
        "text": "Admit for overnight observation because he requires assistance to ambulate",
        "isCorrect": false,
        "explanation": "Independent ambulation is not required; PADS awards 1 point for ambulation with assistance when appropriate for the surgery. Total score still meets the ≥9 discharge threshold."
      },
      {
        "text": "Continue PACU observation because his room-air SpO2 is below 95%",
        "isCorrect": false,
        "explanation": "PADS does not include oxygen saturation, and a clinically stable SpO2 of 94% on room air is typically acceptable. Prolonged observation solely to reach 95% is unnecessary if other discharge criteria are met."
      },
      {
        "text": "Discharge home now with written instructions and a responsible adult escort",
        "isCorrect": true,
        "explanation": "His Post-Anesthesia Discharge Scoring System (PADS) score is 9: vital signs within 20% (2), ambulation with assistance (1), minimal nausea (2), mild pain (2), minimal bleeding (2). A PADS ≥9 supports safe home discharge when an escort is present and the patient is clinically stable."
      },
      {
        "text": "Delay discharge until he achieves a perfect Aldrete score of 10",
        "isCorrect": false,
        "explanation": "The (modified) Aldrete score is primarily used for Phase I recovery/transfer readiness (threshold commonly ≥9), whereas home discharge relies on PADS. A perfect Aldrete score is not required for discharge home."
      },
      {
        "text": "Administer additional IV opioids to reduce pain to 0/10 before discharge",
        "isCorrect": false,
        "explanation": "Pain must be adequately controlled, not eliminated; aggressive opioid dosing risks sedation and nausea. PADS gives full points for mild pain controlled with oral medications."
      }
    ],
    "didactic": "Two commonly used tools guide discharge after ambulatory anesthesia: the modified Aldrete score (Phase I recovery/transfer) and the Post-Anesthesia Discharge Scoring System (PADS) for home discharge. PADS components are: vital signs (relative to baseline), ambulation, nausea/vomiting, pain, and surgical bleeding. Typical scoring grants 2 points for: vital signs within 20% of baseline, steady gait, minimal/no nausea, mild pain controlled with oral meds, and minimal bleeding; 1 point is assigned for ambulation with assistance and moderate symptoms. A PADS threshold ≥9 generally supports safe discharge home when a responsible adult escort is available. Practical tips: ensure the patient is alert, hemodynamically stable, tolerating oral intake, and not requiring parenteral opioids or ongoing IV therapies; room-air oxygenation should be clinically adequate (commonly SpO2 >92%). Remember that Aldrete ≥9 often moves patients from Phase I to Phase II, but PADS drives the home-discharge decision.",
    "educationalObjective": "Apply Aldrete or Post-Anesthesia Discharge Scoring System (PADS) thresholds for safe discharge."
  },
  {
    "id": "Core.3.1.2",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "Discharge criteria and follow-up",
    "difficulty": "medium",
    "questionText": "A 55-year-old man with obstructive sleep apnea (uses CPAP), hypertension, and stage 3 chronic kidney disease (eGFR 45 mL/min/1.73 m²) undergoes outpatient knee arthroscopy with an adductor canal block and local infiltration. He received intraoperative acetaminophen and no NSAIDs. In PACU, pain is 4/10 at rest and 6/10 with movement; vitals are stable and he is tolerating PO. He prefers to avoid opioids if possible and has reliable home support.\n\nWhich discharge medication plan and counseling best control pain while minimizing opioid use and risk?",
    "answers": [
      {
        "text": "Acetaminophen 1,000 mg every 8 hours; ketorolac 10 mg every 6 hours for 5 days; withhold opioids to avoid misuse.",
        "isCorrect": false,
        "explanation": "Ketorolac is relatively contraindicated in CKD due to AKI risk, especially for multi-day outpatient use; eliminating any opioid rescue after block wear-off can result in poorly controlled pain and unplanned care."
      },
      {
        "text": "Acetaminophen 1,000 mg every 6 hours scheduled; ibuprofen 600 mg every 6 hours; oxycodone 5 mg, 1–2 tablets every 4 hours as needed, dispense 30 tablets; avoid CPAP the first night to prevent mask discomfort.",
        "isCorrect": false,
        "explanation": "Inappropriate for CKD (systemic NSAID nephrotoxicity) and prescribes an excessive opioid quantity with permissive dosing; advising to avoid CPAP is unsafe in OSA and increases respiratory risk."
      },
      {
        "text": "Acetaminophen 650 mg every 6 hours scheduled (max 3 g/day across all products) plus ice/elevation; oxycodone 5 mg every 6 hours as needed for severe breakthrough only, dispense 5 tablets; resume CPAP whenever sleeping; avoid alcohol/benzodiazepines; add stool softener and provide take-home naloxone; call for uncontrolled pain or excessive sedation.",
        "isCorrect": true,
        "explanation": "Prioritizes scheduled non-opioid therapy safe in CKD, limits opioid to small rescue supply with clear safety counseling (OSA, CPAP, sedative avoidance), and includes bowel regimen and naloxone—an opioid-sparing, risk-mitigating plan aligned with ambulatory best practices."
      },
      {
        "text": "Celecoxib 200 mg twice daily for 7 days; tramadol 50–100 mg every 6 hours as needed, dispense 30 tablets; avoid acetaminophen to reduce hepatotoxicity risk.",
        "isCorrect": false,
        "explanation": "COX-2 inhibitors still carry renal risk in CKD and tramadol is an opioid with serotonergic/respiratory risks; acetaminophen is appropriate and safe in CKD without liver disease."
      },
      {
        "text": "Gabapentin 300 mg three times daily for 7 days; hydrocodone/acetaminophen 5/325 mg every 4 hours as needed, dispense 20 tablets; hold CPAP the first night to reduce nasal dryness.",
        "isCorrect": false,
        "explanation": "Gabapentinoids increase sedation and respiratory depression when combined with opioids, especially in OSA; withholding CPAP is unsafe. Opioid quantity and dosing are not opioid-sparing."
      }
    ],
    "didactic": "Multimodal post-ambulatory analgesia should prioritize scheduled non-opioids and reserve a small quantity of short-acting opioid for rescue only. In CKD (stage 3), acetaminophen is first-line and safe; systemic NSAIDs (including celecoxib and ketorolac) increase AKI risk and are generally avoided or used only with great caution for very short duration. In OSA, avoid sedative co-prescriptions (benzodiazepines, gabapentinoids) and ensure patients use CPAP whenever sleeping; combining gabapentinoids with opioids increases respiratory depression. For minor procedures like knee arthroscopy with regional anesthesia, 0–10 tablets of oxycodone 5 mg is typically sufficient; provide clear limits and discontinue once pain is controlled. Counsel on maximum daily acetaminophen (≤3 g/day in many ambulatory patients) across all products, ice/elevation, and a bowel regimen. Provide opioid risk mitigation: avoid alcohol and other sedatives, secure storage, proper disposal, and consider take-home naloxone when prescribing any opioid, especially in OSA. Arrange a plan for reassessment for uncontrolled pain or excessive sedation as blocks wear off.",
    "educationalObjective": "Control pain with multimodal strategies and provide clear opioid-sparing instructions and limits."
  },
  {
    "id": "Core.3.1.3",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "Discharge criteria and follow-up",
    "difficulty": "medium",
    "questionText": "A 58-year-old man with diagnosed OSA (STOP-Bang 6) who uses home CPAP undergoes ambulatory shoulder arthroscopy under general anesthesia with an LMA. In PACU (2 hours postop), pain is controlled with acetaminophen and ketorolac; no IV opioids were given intraop or in PACU. While dozing on room air, he had two brief episodes of airway obstruction with desaturation to 86–88% that resolved with jaw thrust and brief CPAP. The last event occurred 20 minutes ago. He is currently awake, saturating 95% on room air, and requests discharge.\n\nWhich is the most appropriate disposition before allowing same-day discharge from the ambulatory center?",
    "answers": [
      {
        "text": "Observe for 1 additional hour; if no events, discharge home",
        "isCorrect": false,
        "explanation": "A short event-free interval is insufficient after documented PACU obstruction in an OSA patient; risk persists beyond 1 hour."
      },
      {
        "text": "Continue monitoring for at least 7 hours after the last obstructive or hypoxemic event while breathing room air before considering discharge",
        "isCorrect": true,
        "explanation": "For OSA patients with PACU airway obstruction or hypoxemia on room air, guidelines support extended observation—commonly interpreted as ≥7 hours after the last event in an unstimulated environment before discharge."
      },
      {
        "text": "Discharge now with instructions to use home CPAP while sleeping",
        "isCorrect": false,
        "explanation": "Home CPAP is beneficial, but recent PACU obstructive events on room air necessitate extended on-site monitoring before discharge."
      },
      {
        "text": "Admit for 24-hour respiratory monitoring regardless of subsequent course",
        "isCorrect": false,
        "explanation": "Routine admission is not required solely for brief PACU obstruction in OSA if the patient stabilizes and meets extended observation criteria; admission is more appropriate with persistent events, high opioid burden, or neuraxial morphine."
      },
      {
        "text": "Observe until a total of 3 hours postop, then discharge if stable",
        "isCorrect": false,
        "explanation": "A 3-hour extended PACU time may be reasonable for asymptomatic OSA patients, but does not meet criteria after a hypoxemic/obstructive event."
      }
    ],
    "didactic": "Key ambulatory discharge risks include diagnosed or suspected OSA, neuraxial opioids (especially hydrophilic agents like morphine), and unexpected PACU events such as airway obstruction or hypoxemia. In OSA, event-free observation should be longer than for non-OSA patients; after an obstructive/hypoxemic episode on room air, many follow the pragmatic rule to monitor for approximately 7 hours from the last event in an unstimulated environment before discharge. Practical tips: keep the patient on room air during assessment (supplemental O2 can mask hypoventilation) and consider capnography if O2 is required. Encourage use of the patient’s home CPAP in PACU, prioritize multimodal and regional analgesia to minimize opioids, and avoid sedatives. Neuraxial morphine poses a risk of delayed respiratory depression (often 6–12 hours later); institutional protocols typically require enhanced monitoring for up to 24 hours (e.g., at least hourly in the first 12 hours), making same-day discharge inappropriate. Unexpected PACU events (recurrent obstruction, need for naloxone, or persistent hypoxemia) warrant extended observation or admission depending on severity and trajectory.",
    "educationalObjective": "Define extended observation needs for OSA, late neuraxial opioids, or unexpected events in PACU."
  },
  {
    "id": "Core.3.1.4",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "Discharge criteria and follow-up",
    "difficulty": "easy",
    "questionText": "A 52-year-old man (ASA II) undergoes ambulatory laparoscopic inguinal hernia repair under general anesthesia with an LMA. In PACU he is awake, pain 3/10 on oral acetaminophen and oxycodone, tolerating clear liquids, BP 128/74, HR 78, SpO2 98% on room air. He is being discharged home with an escort.\n\nThe surgeon asks you to give concise discharge counseling on warning signs and how to seek help. Which single instruction best communicates appropriate thresholds and contact pathways for bleeding, fever, refractory vomiting, and dyspnea?\n",
    "answers": [
      {
        "text": "Call 911 or go to the ED immediately for trouble breathing, chest pain, or bleeding that soaks the dressing or does not stop with 10–15 minutes of firm pressure; call our 24/7 number for fever >38.5°C after the first 24 hours or vomiting that prevents you from keeping fluids down.",
        "isCorrect": true,
        "explanation": "Correctly prioritizes airway/respiratory and hemodynamic threats for emergent care and uses appropriate thresholds for non-urgent but concerning issues (fever after 24 h, refractory vomiting) with a 24/7 contact pathway."
      },
      {
        "text": "Text the scheduling line if problems arise; most issues including shortness of breath and bleeding resolve with rest.",
        "isCorrect": false,
        "explanation": "Provides an inappropriate contact pathway and falsely reassures about potentially life-threatening symptoms."
      },
      {
        "text": "Go to the ED for any fever above 37.8°C or any nausea; otherwise, call the clinic if shortness of breath develops.",
        "isCorrect": false,
        "explanation": "Over-triages mild, expected findings (low-grade fever, mild nausea) and dangerously under-triages dyspnea to a clinic call rather than emergency response."
      },
      {
        "text": "Call the surgeon’s office for chest pain, shortness of breath, or uncontrolled bleeding; reserve the ED for persistent vomiting.",
        "isCorrect": false,
        "explanation": "Misclassifies life-threatening symptoms (dyspnea, chest pain, significant bleeding) as routine calls instead of immediate ED/911 activation."
      },
      {
        "text": "If you vomit more than once or notice any bloody spotting on the dressing, return to the ED right away; low-grade fever is expected for 3 days.",
        "isCorrect": false,
        "explanation": "Over-triages minor bleeding and brief nausea while inappropriately reassuring about fever for 3 days, which can miss infection or atelectasis-related complications after 24 h."
      }
    ],
    "didactic": "Effective ambulatory discharge counseling separates time-sensitive emergencies from conditions appropriate for routine follow-up and provides a clear 24/7 contact pathway.\n\n- Urgent/ED or 911: dyspnea, chest pain, or significant bleeding (e.g., dressing saturation or bleeding that fails to stop after 10–15 minutes of firm pressure). These may reflect airway compromise, pulmonary embolism, myocardial ischemia, or hemorrhage.\n- Call the team (24/7 number): fever >38.5°C after the first 24 hours, or vomiting that prevents oral intake despite antiemetics—risks include dehydration and infection. Low-grade fever and mild nausea in the first postoperative day are common and usually self-limited.\n- Practical tips: provide both a direct 24/7 phone number and instructions to call 911 for emergencies; use teach-back to confirm understanding; include written thresholds (temperature cutoffs, time limits for persistent vomiting, and bleeding criteria). Clear, specific guidance reduces unnecessary ED visits while ensuring timely escalation for true red flags.",
    "educationalObjective": "Deliver concise discharge counseling on red flags (bleeding, fever, refractory vomiting, dyspnea) and contact pathways."
  },
  {
    "id": "Core.3.1.5",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "Discharge criteria and follow-up",
    "difficulty": "easy",
    "questionText": "You are covering a busy ambulatory surgery PACU. For routine same-day discharge, your service expects stable vital signs, return of protective airway reflexes, controlled symptoms, and no need for supplemental oxygen. Which patient meets appropriate discharge criteria now?\n\nChoose the best option.",
    "answers": [
      {
        "text": "Awake with stable vitals and $SpO_2$ 95% on room air, pain 8/10 requiring repeat IV opioid dosing in PACU, no nausea",
        "isCorrect": false,
        "explanation": "Uncontrolled pain increases risk of respiratory depression and unplanned post-discharge care; analgesia should be adequately controlled with an oral regimen before discharge."
      },
      {
        "text": "Awake and oriented with stable vitals and $SpO_2$ 96% on room air, persistent nausea with two emesis episodes in PACU, minimal pain",
        "isCorrect": false,
        "explanation": "Ongoing emesis fails symptom-control criteria and raises aspiration/dehydration risk; further antiemetic therapy and observation are indicated before discharge."
      },
      {
        "text": "Arousable to voice but drowsy, weak cough and pooling secretions, $SpO_2$ 96% on room air, stable vitals, pain 3/10, no nausea",
        "isCorrect": false,
        "explanation": "Protective airway reflexes have not fully returned (ineffective cough, poor secretion handling), increasing aspiration risk and precluding discharge."
      },
      {
        "text": "Awake and oriented, speaking in full sentences, effective cough and swallow, hemodynamically stable within 20% of baseline for >20 minutes, $SpO_2$ 95% on room air, pain 3/10 controlled with oral medication, minimal nausea, able to ambulate with assistance, escort present",
        "isCorrect": true,
        "explanation": "This option demonstrates return of protective airway reflexes, stable vitals, adequate symptom control, and maintenance of $SpO_2$ on room air—meeting Aldrete/PADSS-based routine discharge criteria."
      },
      {
        "text": "Awake and oriented with stable vitals, $SpO_2$ 97% on 2 L/min nasal cannula, pain 2/10, no nausea, escort present",
        "isCorrect": false,
        "explanation": "Routine discharge requires adequate oxygenation on room air; a need for supplemental oxygen suggests unresolved respiratory risk unless the patient’s baseline is home oxygen."
      }
    ],
    "didactic": "Ambulatory discharge frameworks (e.g., modified Aldrete or PADSS) prioritize physiologic stability, return of airway protection, and symptom control. Practical criteria include: (1) stable hemodynamics and ventilation for 20–30 minutes, (2) awake enough to maintain airway with effective cough and swallow, (3) adequate oxygenation on room air (e.g., $SpO_2 \\geq 94\\%$ at $FiO_2 = 0.21$), and (4) pain and nausea controlled with an oral regimen, with an escort and clear instructions. Patients who still require supplemental oxygen generally are not ready for routine discharge, unless that is their baseline (home oxygen). For short, low-risk cases, a mandatory void is not required; safe ambulation to baseline is preferred. OSA, heavy opioid/benzodiazepine use, or prolonged procedures may warrant extended observation. Tip: wean oxygen and observe on room air for at least 10–15 minutes to confirm stable $SpO_2$ before discharge.",
    "educationalObjective": "Ensure return of protective reflexes and stable vital signs without supplemental oxygen for routine discharge."
  },
  {
    "id": "Core.3.1.6",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "Discharge criteria and follow-up",
    "difficulty": "medium",
    "questionText": "A 36-year-old nonsmoking woman is recovering in PACU after ambulatory laparoscopic cholecystectomy under sevoflurane anesthesia. She received dexamethasone 8 mg at induction and ondansetron 4 mg at closure. Pain required 100 mcg IV fentanyl in PACU but is now 3/10 on acetaminophen and ibuprofen. She denies current nausea, is hemodynamically stable, and meets discharge criteria. Past history is notable for severe postoperative nausea and vomiting after a prior anesthetic. She will be discharged home this afternoon with a short course of oral oxycodone for breakthrough pain.\n\nWhich discharge plan will most effectively reduce her risk of postdischarge nausea and vomiting (PDNV)?",
    "answers": [
      {
        "text": "Apply a transdermal scopolamine patch now and provide a prescription for ondansetron ODT 4–8 mg every 6–8 h as needed with written rescue instructions",
        "isCorrect": true,
        "explanation": "She has multiple PDNV risk factors (female, <50 years, history of PONV, PACU opioids). A long-acting agent (scopolamine patch with 2–4 h onset, ~72 h duration) plus a home rescue plan and medication (ondansetron ODT) best mitigates PDNV risk."
      },
      {
        "text": "Avoid all opioid prescriptions at discharge and forgo antiemetic prophylaxis",
        "isCorrect": false,
        "explanation": "Opioid-sparing is helpful but often insufficient alone; high-risk patients still require antiemetic strategies and a written rescue plan to prevent PDNV."
      },
      {
        "text": "Discharge with routine instructions only because she already received dual antiemetic prophylaxis",
        "isCorrect": false,
        "explanation": "Intraoperative prophylaxis reduces early PONV but does not reliably cover the 24–72 h postdischarge period; high PDNV-risk patients benefit from long-acting prophylaxis and a home rescue plan."
      },
      {
        "text": "Prescribe aprepitant 40 mg to be taken at the first sign of nausea after discharge",
        "isCorrect": false,
        "explanation": "Aprepitant is most effective as preoperative prophylaxis; it is not a preferred rescue medication once nausea has started and is costly for this purpose."
      },
      {
        "text": "Give another 4 mg IV ondansetron in PACU and discharge without a home antiemetic",
        "isCorrect": false,
        "explanation": "Repeating a short–half-life 5-HT3 antagonist offers little additional protection beyond a few hours and leaves the high-risk period at home uncovered."
      }
    ],
    "didactic": "PDNV is common after ambulatory surgery and peaks in the first 24–48 hours at home. A validated PDNV risk score (female sex, age <50, prior PONV, nausea in PACU, and PACU opioid use) shows risk rising from ~10% (0 factors) to ~60–80% (4–5 factors). High-risk patients warrant long-acting prophylaxis plus a take-home rescue plan. Options with extended coverage include transdermal scopolamine (onset 2–4 h, ~72 h duration) and palonosetron ($t_{1/2} \\approx 40$ h). NK-1 antagonists (e.g., aprepitant) are best given preoperatively. Provide written instructions and prescriptions for rescue (e.g., ondansetron ODT 4–8 mg q6–8h PRN; if ineffective, add a different class such as metoclopramide 10 mg or promethazine 12.5–25 mg), emphasize hydration, opioid-sparing multimodal analgesia, and when to seek care. Practical tip: place scopolamine before discharge and counsel on anticholinergic effects (dry mouth, blurry vision) and to avoid driving or operating machinery.",
    "educationalObjective": "Prevent PDNV with risk-based prophylaxis and provide written rescue plans and prescriptions if needed."
  },
  {
    "id": "Core.3.1.7",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "Discharge criteria and follow-up",
    "difficulty": "easy",
    "questionText": "A 45-year-old man undergoes outpatient knee arthroscopy under general anesthesia with an LMA (sevoflurane maintenance; fentanyl 100 mcg). The procedure lasts 45 minutes. In PACU 90 minutes later, he is awake, oriented, pain 2/10, Aldrete 10, and vital signs are stable. He lives alone and plans to ride an e-scooter home and stop by the leasing office to sign a new apartment lease today.\n\nWhich discharge instruction is most appropriate to provide this patient?",
    "answers": [
      {
        "text": "You may ride your e-scooter home at low speed, but avoid alcohol tonight.",
        "isCorrect": false,
        "explanation": "Operating vehicles or machinery (including scooters) should be avoided for 24 hours after anesthesia due to impaired coordination and reaction time."
      },
      {
        "text": "Because you are fully alert, you may go home alone by rideshare and resume normal activities except driving.",
        "isCorrect": false,
        "explanation": "A responsible adult escort is required after sedation/anesthesia; going home alone by rideshare is not acceptable. Psychomotor impairment persists despite feeling fully alert."
      },
      {
        "text": "Since only short-acting agents were used, these restrictions apply for 6–8 hours rather than 24 hours.",
        "isCorrect": false,
        "explanation": "Short-acting agents still cause residual psychomotor and judgment impairment; most ambulatory anesthesia policies recommend 24-hour restrictions."
      },
      {
        "text": "Leave with a responsible adult, and for the next 24 hours avoid driving, operating machinery (including scooters), drinking alcohol, and making important legal or financial decisions.",
        "isCorrect": true,
        "explanation": "Standard post-sedation/anesthesia instructions include a responsible adult escort and activity restrictions for 24 hours: no driving, machinery, alcohol, or major decisions."
      },
      {
        "text": "Have an adult take you home, but you may sign legal documents as long as you feel clear-headed later today.",
        "isCorrect": false,
        "explanation": "Even if the patient feels clear-headed, judgment and memory can be impaired; important legal/financial decisions should be deferred for 24 hours."
      }
    ],
    "didactic": "After ambulatory anesthesia or moderate-to-deep sedation, residual cognitive and psychomotor impairment outlasts apparent wakefulness. Even with short-acting agents (propofol, sevoflurane, small-dose opioids), attention, reaction time, and memory can be measurably reduced for many hours. Standard discharge guidance includes:\n\n- Must leave with a responsible adult who can accompany the patient home and assist at least the first evening.\n- For 24 hours: no driving, no operating machinery (power tools, bicycles/scooters), no alcohol or sedatives, and avoid important legal/financial decisions or supervising dependents.\n- Provide written instructions and use teach-back to ensure understanding; document the escort’s name/contact.\n\nThese precautions mitigate risks of accidents, impaired consent, and unrecognized complications during the immediate post-anesthesia period.",
    "educationalObjective": "Set adult escort and activity restrictions (no driving, machinery, legal decisions) for 24 hours after sedation/anesthesia."
  },
  {
    "id": "Core.3.2.1",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "MRI and remote safety",
    "difficulty": "medium",
    "questionText": "You are called to the MRI suite for a 55-year-old man (BMI 34) with moderate OSA on home CPAP and severe claustrophobia requiring a 45-minute brain MRI (including DWI/DTI). A prior attempt with midazolam/fentanyl was aborted for motion artifact. Vitals are stable; airway exam is Mallampati III with normal mouth opening. The MRI suite has MR-conditional monitors and infusion pumps with long nonferromagnetic IV tubing, but no MRI-compatible anesthesia machine with vaporizers is available today. The technologist notes scanner noise peaks >100 dB. You need to ensure reliable immobility while maintaining safety in this remote environment. Which anesthetic plan is most appropriate?\n\n",
    "answers": [
      {
        "text": "Ketamine 1 mg/kg IV bolus with a small dose of midazolam; no airway device, headphones only for noise.",
        "isCorrect": false,
        "explanation": "Ketamine can cause nystagmus and involuntary movements that degrade image quality; combining with benzodiazepine increases airway risk in OSA, and headphones alone provide insufficient attenuation."
      },
      {
        "text": "Sevoflurane sedation via simple face mask using an anesthesia machine positioned in Zone IV; use foam earplugs only.",
        "isCorrect": false,
        "explanation": "Volatile sedation by mask risks airway obstruction and motion in OSA and is not feasible here because no MRI-compatible anesthesia machine with vaporizers is available; single hearing protection is suboptimal."
      },
      {
        "text": "Induce general anesthesia with a propofol TIVA (e.g., 100–150 mcg/kg/min) and place an LMA; run the infusion on an MR-conditional pump outside the 5-gauss line using long IV tubing, and provide double hearing protection (foam earplugs plus over-ear headphones).",
        "isCorrect": true,
        "explanation": "This plan provides reliable immobility and airway control in an OSA patient, is feasible without a vaporizer, uses MRI-safe equipment, and includes double hearing protection to mitigate >100 dB scanner noise."
      },
      {
        "text": "Deep sedation with dexmedetomidine (1 mcg/kg over 10 minutes, then 0.7 mcg/kg/hr) via nasal cannula oxygen; because the patient is sedated, hearing protection is optional.",
        "isCorrect": false,
        "explanation": "Dexmedetomidine reduces respiratory depression but may still allow motion in a patient who already failed sedation; hearing protection remains mandatory even under sedation due to high noise exposure."
      },
      {
        "text": "General anesthesia with nitrous oxide and sevoflurane via LMA to speed onset; double hearing protection, no infusion pump needed.",
        "isCorrect": false,
        "explanation": "While an LMA could reduce motion, this plan requires an MRI-compatible anesthesia machine with vaporizers, which is unavailable; nitrous oxide adds unnecessary PONV risk in a remote setting."
      }
    ],
    "didactic": "For brain MRI—especially sequences like DWI/DTI that are highly motion-sensitive—plans that reliably eliminate movement are preferred. In remote MRI environments without a vaporizer-equipped MRI anesthesia machine, propofol TIVA is the most practical approach; securing the airway (e.g., LMA) is prudent for OSA and when deep anesthesia is required far from the head. MR-conditional infusion pumps should be placed outside the 5-gauss line with long nonferromagnetic tubing; continuous capnography ($EtCO_2$) and standard monitors are required for deep sedation/GA. Dexmedetomidine is useful when spontaneous ventilation must be maintained, but it can fail to suppress motion in patients who already failed sedative attempts or for long/high-resolution scans. MRI scanners commonly generate 95–115 dB; use double hearing protection (foam earplugs + over-ear muffs/headphones) to achieve additive attenuation and prevent noise-induced injury regardless of sedation depth. Practical tip: have an airway rescue plan before advancing the patient into the bore, and confirm all equipment (lines, circuits, pumps) is MR-conditional and appropriately positioned.",
    "educationalObjective": "Choose anesthetic techniques minimizing motion (TIVA or dexmedetomidine) and protect hearing with appropriate measures."
  },
  {
    "id": "Core.3.2.2",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "MRI and remote safety",
    "difficulty": "medium",
    "questionText": "You are called to the MRI suite for moderate sedation of a 72-year-old man with severe claustrophobia requiring an urgent brain MRI. The scanner is 3.0T and located in Zone IV; MRI-compatible monitors and infusion pumps are available. Vitals in Zone II: BP 158/82, HR 76, SpO2 98% on room air. The chart lists a prior “cerebral aneurysm clip (1998, outside hospital)” with no device card or model number. The technologist suggests proceeding using low-SAR protocols, or moving to a nearby 1.5T scanner if preferred. A ferromagnetic detection portal is present at the door to Zone IV.\n\nWhich is the most appropriate next step before allowing the patient into Zone IV?",
    "answers": [
      {
        "text": "Proceed after standard screening for external metal and ensuring all staff/equipment entering Zone IV are MR-safe or MR-conditional.",
        "isCorrect": false,
        "explanation": "Zone safety and external screening are necessary but insufficient when an implant’s MR status is unknown; the clip must be verified MR-conditional first."
      },
      {
        "text": "Use a handheld magnet or the ferromagnetic detection portal to confirm the clip is nonferromagnetic and then proceed.",
        "isCorrect": false,
        "explanation": "Ferromagnetic detectors screen for external objects and cannot determine implant safety; magnet \"testing\" of intracranial clips is unsafe and not an accepted practice."
      },
      {
        "text": "Keep the patient in Zone III and obtain documentation identifying the specific clip and confirming MR-conditional status with allowable field strength/SAR; proceed only if all conditions can be met, otherwise pursue alternative imaging.",
        "isCorrect": true,
        "explanation": "Unknown aneurysm clip status is a contraindication to MRI. Proceed only after verifying the exact device and its MR-conditional conditions; if unverifiable, do not scan and select an alternative (e.g., CT/MRA)."
      },
      {
        "text": "Proceed on a 1.5T scanner in low-SAR mode with deep sedation, as clip displacement risk is negligible under these conditions.",
        "isCorrect": false,
        "explanation": "Lower field and SAR reduce risk but do not make unknown implants safe; older clips may be ferromagnetic with significant torque/displacement even at 1.5T. Sedation does not mitigate magnetic forces."
      },
      {
        "text": "Position the patient feet-first and minimize table travel into the bore to reduce magnetic forces on the clip.",
        "isCorrect": false,
        "explanation": "Field strength and spatial gradients within the bore still exert torque/force on ferromagnetic clips; positioning strategies do not substitute for verified MR-conditional status."
      }
    ],
    "didactic": "Key MRI safety steps include controlling access to Zones III–IV, screening every person and object twice, and verifying the MR status of all implants/devices. Implants are categorized as MR-safe, MR-conditional (safe only under specified conditions), or MR-unsafe. For MR-conditional devices, you must confirm the exact model and permitted conditions (e.g., field strength 1.5T vs 3T, SAR limits, spatial gradient, positioning, and monitoring requirements) and ensure they can be met.\n\nForces and torque on ferromagnetic objects increase with magnetic field strength and spatial gradients (approximately: force ∝ $B\\,\\nabla B$, torque ∝ $B^2$), and RF heating increases with $SAR$; thus, “low-SAR” or using 1.5T does not make an unknown clip safe. Many older aneurysm clips (particularly pre–mid-1990s) may be ferromagnetic; if documentation is absent, treat as MR-unsafe until you can identify the device via records or radiographic identification through a validated database. Ferromagnetic detectors only find external items and cannot assess implants; never “test” an intracranial clip with a magnet. Practical tip: document the device model and MR conditions in the anesthetic record and have an alternate imaging plan when verification is not possible.",
    "educationalObjective": "Implement MRI zone safety, screen for ferromagnetic implants/devices, and verify MR-conditional status."
  },
  {
    "id": "Core.3.2.3",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "MRI and remote safety",
    "difficulty": "medium",
    "questionText": "A 6-month-old, 7-kg infant is scheduled for a 75-minute brain MRI under general anesthesia with sevoflurane via LMA, spontaneous ventilation, $FiO_2$ 0.4. The MRI suite is 19°C. MR-conditional ASA monitors are applied. Once the child is positioned in the bore, the capnogram intermittently disappears due to condensation in the long sampling line; SpO2 remains 100%, $EtCO_2$ varies 38–45 mm Hg, and the technologist requests an uninterrupted 40-minute sequence with limited access to the patient.\n\nWhich management plan best meets safety standards for this remote location and addresses the highest physiologic risks for this patient during the upcoming scan?",
    "answers": [
      {
        "text": "Accept intermittent capnography and perform periodic checks between sequences; cover the infant with cotton blankets, as passive insulation is adequate for 60–90 minutes.",
        "isCorrect": false,
        "explanation": "Intermittent ventilation monitoring does not meet standards for general anesthesia, and passive insulation is typically inadequate to prevent infant heat loss in a cold MRI suite."
      },
      {
        "text": "Continue with pulse oximetry and clinical observation, disable capnography to avoid artifacts, and use only passive blankets for warmth to simplify the setup during the long sequence.",
        "isCorrect": false,
        "explanation": "Relying on SpO2 and observation can miss early hypoventilation, and passive warming alone is insufficient in infants during prolonged scans."
      },
      {
        "text": "Remove the LMA and switch to nasal cannula with capnography to reduce airway obstruction risk and potential monitor interference; avoid warming to prevent RF heating.",
        "isCorrect": false,
        "explanation": "Removing a secured airway increases the risk of hypoventilation/apnea in the bore, and appropriately used MR‑conditional warming does not pose a significant RF heating hazard."
      },
      {
        "text": "Troubleshoot and ensure continuous capnography with a dry, secured MR‑compatible sidestream sampling setup, and initiate active MR‑conditional forced‑air warming with continuous core temperature monitoring for the duration of the scan.",
        "isCorrect": true,
        "explanation": "Continuous capnography is required for general anesthesia, and infants undergoing long scans are at high risk of hypothermia—both warrant active warming and continuous core temperature monitoring."
      },
      {
        "text": "Increase $FiO_2$ to 1.0 and rely on pulse oximetry and chest rise; use a humidified circuit to mitigate heat loss rather than active warming devices.",
        "isCorrect": false,
        "explanation": "High $FiO_2$ can delay desaturation and mask hypoventilation, and humidification does not replace the need for active warming and temperature monitoring in infants."
      }
    ],
    "didactic": "In remote locations such as MRI, the same ASA monitoring standards apply as in the OR: continuous ventilation monitoring with capnography is required for general anesthesia and for moderate/deep sedation when feasible. Pulse oximetry alone may not detect apnea or hypoventilation for tens of seconds, particularly at higher $FiO_2$, whereas capnography provides breath‑to‑breath feedback. Infants are highly vulnerable to hypothermia due to a large surface-area–to–mass ratio and limited thermogenic reserve; the cold MRI environment and prolonged immobility further increase risk. For long scans, use continuous core temperature monitoring (esophageal or rectal) and active MR‑conditional forced‑air warming rather than passive insulation alone. Practical tips: use a long sidestream line with the water trap outside the magnet room, secure the sampling line to avoid kinks/condensation, verify audible alarms, and set NIBP cycling appropriately without compromising signal quality. MR‑conditional warming devices should be positioned and routed to avoid ferromagnetic hazards and thermal injury (no coiled cords under blankets). Maintaining continuous capnography and vigilant temperature management improves safety and reduces unplanned scan interruptions.",
    "educationalObjective": "Maintain continuous capnography and vigilant temperature management in infants and long scans."
  },
  {
    "id": "Core.3.2.4",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "MRI and remote safety",
    "difficulty": "hard",
    "questionText": "A 68-year-old man with ischemic cardiomyopathy (EF 25%) and a dual‑chamber MR‑conditional ICD presents for urgent brain MRI to evaluate new focal neurologic deficits. His last device interrogation (2 weeks ago) showed >99% ventricular pacing with complete AV block and no underlying escape rhythm; rate‑responsive features are enabled. The MRI suite has a 1.5 T scanner and MR‑conditional monitors. He will receive light sedation for motion control. Cardiology is available to program the device pre‑ and post‑scan.\n\nWhich pre‑scan device management and monitoring plan is most appropriate for this patient?\n",
    "answers": [
      {
        "text": "Place a clinical magnet over the generator to disable shocks and proceed with standard ECG monitoring during MRI.",
        "isCorrect": false,
        "explanation": "Magnets are unsafe and unreliable in the MRI environment (projectile risk, displacement in the bore) and do not place ICDs into an MRI‑safe pacing mode. Magnet use may suspend ICD shocks but won’t ensure appropriate pacing in a pacemaker‑dependent patient."
      },
      {
        "text": "Proceed without reprogramming because the system is MR‑conditional; ensure scanner SAR limits are respected and monitor with ECG alone.",
        "isCorrect": false,
        "explanation": "MR‑conditional labeling still requires protocolized management: device interrogation, appropriate pacing mode selection, disabling ICD therapies, and MR‑conditional monitoring. ECG alone is often unreliable in MRI due to artifact; additional monitoring and rescue equipment are needed."
      },
      {
        "text": "Turn off the pacemaker function to avoid electromagnetic interference and rely on the patient’s intrinsic rhythm during sedation.",
        "isCorrect": false,
        "explanation": "This patient is pacemaker‑dependent with no escape rhythm; disabling pacing risks profound bradycardia or asystole during the scan."
      },
      {
        "text": "Have cardiology program the device to asynchronous DOO pacing at a fixed rate and disable tachyarrhythmia therapies; use MR‑conditional pulse oximetry and NIBP with external defibrillation/pacing immediately available.",
        "isCorrect": true,
        "explanation": "Pacemaker‑dependent patients should be placed in asynchronous pacing (e.g., DOO/VOO) to avoid inhibition from MRI electromagnetic interference, and ICD tachy therapies must be disabled to prevent inappropriate shocks. MR‑conditional monitors and immediate external defib/pacing capability are required, with pre‑ and post‑scan device interrogation."
      },
      {
        "text": "Program to VVI at the lowest rate while keeping ICD therapies active to treat potential MRI‑induced ventricular arrhythmias.",
        "isCorrect": false,
        "explanation": "VVI at a low rate risks oversensing and pacing inhibition from MRI noise in a dependent patient, and leaving ICD therapies active invites inappropriate shocks due to EMI. ICD detection should be disabled during the scan."
      }
    ],
    "didactic": "Key steps for MRI in patients with pacemakers/ICDs are: confirm MR‑conditional status for the entire system (generator + leads), determine pacemaker dependence, coordinate pre/post interrogation, and ensure proper programming and monitoring in the MRI environment. Pacemaker‑dependent patients should be placed in asynchronous pacing (DOO/VOO/AOO) to prevent inhibition from electromagnetic interference; non‑dependent patients can often be set to ODO or a non‑asynchronous pacing mode with sensing only. For ICDs, tachyarrhythmia detection/therapy must be disabled before the scan and re‑enabled immediately afterward. Use MR‑conditional monitoring (pulse oximetry plethysmography and NIBP; ECG may be artifact‑prone) and have external defibrillation and transcutaneous pacing available with personnel capable of ACLS. Avoid magnets in the MRI suite; magnet responses are device‑specific, unreliable in the bore, and pose safety hazards. Typical MR‑conditional protocols also include field strength and SAR limits (commonly 1.5 T with specified SAR constraints) and continuous observation with a plan for rapid egress if instability occurs.",
    "educationalObjective": "Manage pacemakers/ICDs and other implants per MR-conditional protocols with cardiology support when needed."
  },
  {
    "id": "Core.3.2.5",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "MRI and remote safety",
    "difficulty": "hard",
    "questionText": "A 58-year-old man (BMI 42) with severe OSA on nightly CPAP 12 cm H2O, prior head-and-neck radiation with 2-cm interincisor distance, Mallampati IV, and limited neck extension requires a 60-minute brain MRI with contrast for new-onset headaches. He is claustrophobic and cannot tolerate an awake scan. The MRI suite has only MR-conditional equipment in Zone IV; the anesthesia machine connects via a 3-m circuit extension, the head coil limits airway access, and a table “emergency out” command takes ~15 seconds to bring the patient fully out of the bore. Standard code cart and non-MR laryngoscopes remain in Zone III.\n\nWhich pre-scan plan best mitigates the risk of airway loss inside the scanner and incorporates an appropriate extraction strategy?\n",
    "answers": [
      {
        "text": "Move the patient onto the MRI table, induce general anesthesia, and intubate with a video laryngoscope just outside the bore before sliding into the scanner",
        "isCorrect": false,
        "explanation": "Inducing anesthesia on the MRI table before securing the airway risks loss of airway in a position with constrained access and potential MR-incompatibility of rescue tools. Airway control should be achieved in Zone III (or OR) with full backup available prior to entering Zone IV."
      },
      {
        "text": "Start a dexmedetomidine infusion to avoid respiratory depression and keep a standard steel video laryngoscope on the MRI table for rapid rescue",
        "isCorrect": false,
        "explanation": "Dexmedetomidine does not eliminate airway obstruction risk in OSA and difficult anatomy, and rescue would still be delayed by access limitations. Ferromagnetic laryngoscopy equipment in Zone IV violates MRI safety and is prohibited."
      },
      {
        "text": "Insert a second-generation LMA after IV induction, tape the circuit, and begin scanning with oral airway and jaw-thrust wedge immediately available",
        "isCorrect": false,
        "explanation": "An LMA may ventilate initially but provides limited protection from obstruction or aspiration, and repositioning is constrained by the head coil and bore. Failure would require emergent extraction without a secured airway—high risk in this remote environment."
      },
      {
        "text": "Moderate propofol sedation with supplemental oxygen via nasal cannula and the patient’s CPAP mask strapped under the head coil; increase CPAP if snoring develops",
        "isCorrect": false,
        "explanation": "Sedation in a morbidly obese, difficult-airway patient with OSA risks rapid obstruction and hypoxemia; the head coil restricts access for jaw thrust or mask repositioning, and fitting a CPAP mask under the coil is impractical. This plan lacks a reliable definitive airway and does not address a rehearsed extraction sequence."
      },
      {
        "text": "Perform awake flexible bronchoscopic intubation in Zone III with topical anesthesia and minimal sedation, then move the intubated patient to Zone IV; connect to the MR-conditional ventilator using the extended circuit with capnography, and brief the team on a ‘stop scan–table out–remove coil’ extraction drill before starting",
        "isCorrect": true,
        "explanation": "Awake tracheal intubation secures the airway while maintaining spontaneous ventilation in a high-risk patient before entering the bore, aligning with remote-location safety. A rehearsed extraction plan (stop scan, table out, remove head coil/padding) and continuous $ETCO_2$ monitoring mitigate the limited access inherent to MRI."
      }
    ],
    "didactic": "Key principles for MRI anesthesia with limited airway access:\n\n- Remote location + OSA + difficult airway = secure the airway before entering Zone IV. Awake flexible bronchoscopic intubation preserves spontaneous ventilation and avoids loss of airway during induction.\n- The head coil and bore prevent effective mask ventilation, jaw thrust, or device repositioning; therefore, a definitive airway (ETT) is preferred to LMA or deep sedation in high-risk patients.\n- Rehearse an extraction plan with the team before scanning: “Stop scan,” “Table out,” “Remove head coil/padding,” then manage airway. Assign roles and confirm that Zone III rescue equipment and personnel are ready.\n- Use only MR-conditional equipment in Zone IV; keep ferromagnetic rescue tools outside. Continuous $ETCO_2$ and reliable $FiO_2$ delivery are required to the same standard as the OR.\n- Practical tips: preoxygenate, ramp/align for airway before awake intubation, secure long circuit connections with strain relief, and verify alarms/visual capnography are visible from the control room.\n- Do not rely on dexmedetomidine or “light” propofol to prevent obstruction in OSA; apneic desaturation is rapid in obesity due to reduced FRC, and delayed access in the bore magnifies risk.",
    "educationalObjective": "Plan airway strategy in the scanner bore with limited access and have a rehearsed extraction plan."
  },
  {
    "id": "Core.3.2.6",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "MRI and remote safety",
    "difficulty": "easy",
    "questionText": "A 42-year-old man with severe claustrophobia is scheduled for a brain MRI under general anesthesia. In Zone III, you are preparing to move him into the magnet room (Zone IV). A standard code cart and a steel E-cylinder have been parked near the doorway. The suite recently added a ferromagnetic detection portal at the Zone III–IV threshold, but staff sometimes bypass it to save time when moving equipment.\n\nTo best prevent a projectile incident as the patient crosses into Zone IV, which single practice should be enforced now?",
    "answers": [
      {
        "text": "Keep the code cart and a steel E-cylinder just inside Zone IV but secure them with straps to prevent movement",
        "isCorrect": false,
        "explanation": "Tethering is unsafe; ferromagnetic objects can become high-velocity projectiles in the static field and must not enter Zone IV."
      },
      {
        "text": "Post prominent “No metal beyond this point” signs and verbally remind staff before entry",
        "isCorrect": false,
        "explanation": "Signage and verbal reminders are weak controls and rely on memory; they do not reliably intercept ferromagnetic objects at the threshold."
      },
      {
        "text": "Allow only anesthesia and radiology staff to bring personal items into Zone IV without screening to minimize delays",
        "isCorrect": false,
        "explanation": "Personnel screening must be universal; many projectile incidents arise from unscreened personal items carried by authorized staff."
      },
      {
        "text": "Mandate wanding with a standard handheld metal detector before entering Zone IV",
        "isCorrect": false,
        "explanation": "Conventional metal detectors sense conductivity, not ferromagnetism; they can miss dangerous ferromagnetic items and provide false reassurance."
      },
      {
        "text": "Route all people and equipment through the ferromagnetic detection portal at the Zone III–IV doorway and make it the single controlled entry point",
        "isCorrect": true,
        "explanation": "Ferromagnetic portals specifically detect ferromagnetic hazards at the threshold and, when used as the single controlled entry, prevent unscreened items from entering Zone IV—markedly reducing projectile risk."
      }
    ],
    "didactic": "Projectile incidents in MRI are driven by ferromagnetic attraction within the static magnetic field, with risk peaking at the Zone III–IV threshold and near the bore. The American College of Radiology recommends controlled access: Zone III should be supervised, and Zone IV must have a single controlled doorway. High-reliability prevention pairs a rigorous screening checklist with ferromagnetic detection at the threshold; conventional metal detectors are inadequate because they do not specifically identify ferromagnetism. Practical workflow: route all persons and equipment through a ferromagnetic detection portal, lock or block alternate entries, and allow only MR-safe or MR-conditional devices into Zone IV. Keep code carts and ferromagnetic oxygen cylinders in Zone III; use MR-safe substitutes inside the magnet room and move the patient out to Zone III for resuscitation. Remember that the magnet is always on—never rely on signage or verbal reminders as the primary safety barrier.",
    "educationalObjective": "Prevent projectile incidents by strict equipment control and ferromagnetic detection at the threshold."
  },
  {
    "id": "Core.3.2.7",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "MRI and remote safety",
    "difficulty": "medium",
    "questionText": "A 56-year-old man (BMI 36) with obstructive sleep apnea and severe claustrophobia presents for a 60-minute brain MRI under general anesthesia after failing moderate sedation. The suite has a 3T scanner with an MRI-conditional anesthesia machine and MRI-conditional monitors available in Zone IV. Only standard (non–MRI-conditional) infusion pumps are available. He has a single 18G peripheral IV, planned total intravenous anesthesia with propofol and remifentanil, and controlled ventilation via a circle system using a 3 m circuit extension. Vitals preinduction: BP 142/84, HR 78, SpO2 96% on room air.\n\nTo minimize MRI hazards while maintaining safe anesthesia delivery, which equipment setup and cable/tubing routing is BEST for this case?",
    "answers": [
      {
        "text": "Place the anesthesia machine in the control room and pass 3 m ventilator hoses through the bore across the patient’s chest; keep the infusion pumps in Zone IV for easy adjustments.",
        "isCorrect": false,
        "explanation": "Running long breathing hoses through the bore and across the patient increases hazard and circuit disconnections; placing non–MRI-conditional pumps in Zone IV is unsafe due to projectile risk and RF interference."
      },
      {
        "text": "Use standard OR ECG leads and pulse oximeter inside the bore; coil excess cable near the patient to prevent tugging; position pumps 1 m from isocenter.",
        "isCorrect": false,
        "explanation": "Standard OR leads are typically not MRI-conditional, and coiling cable near the patient creates conductive loops that can cause RF burns; proximity to isocenter does not mitigate these risks."
      },
      {
        "text": "Connect two IV extension sets in a loop around the arm to reduce RF heating; drape ECG leads over the shoulders and tape them to the head coil.",
        "isCorrect": false,
        "explanation": "Forming loops with IV tubing or leads increases induced currents and burn risk; cables should be kept straight, parallel, and away from the head coil when possible."
      },
      {
        "text": "Use a steel oxygen cylinder behind the anesthesia machine in Zone IV as backup; keep IV pumps inside the room but outside the 5-gauss line.",
        "isCorrect": false,
        "explanation": "Ferromagnetic cylinders are dangerous projectiles in Zone IV; non–MRI-conditional pumps should not be in the scanner room even if outside the 5-gauss line due to movement risk and interference."
      },
      {
        "text": "Place infusion pumps in the control room; run a single long IV extension through the waveguide along the wall; keep ECG and pulse-ox cables straight and parallel without loops; use the MRI-conditional anesthesia machine at the head of the bore.",
        "isCorrect": true,
        "explanation": "This configuration keeps ferromagnetic pumps outside the 5-gauss line, routes conductive lines straight to reduce RF-induced heating, avoids loops, and uses MRI-conditional equipment in Zone IV."
      }
    ],
    "didactic": "Key MRI anesthesia safety principles focus on MR compatibility and line/cable routing to avoid projectile and RF burn hazards.\n\n- Use MRI-conditional anesthesia machines and monitors in Zone IV; keep non–MRI-conditional infusion pumps outside the 5-gauss line and route IV extensions through the RF waveguide along the wall.\n- Avoid conductive loops: keep ECG, pulse-ox, and other cables straight and parallel, with excess length outside the bore; pad skin-to-skin and cable-to-skin contact points to limit RF heating.\n- Route breathing circuits and monitoring cables away from the head coil when possible, secure them to prevent motion, and confirm that all ferromagnetic objects (including O2 cylinders) are excluded from Zone IV.\n- Long circuits/tubing change mechanics: circuit resistance increases with length and small radius ($R \\propto \\frac{L}{r^4}$), and added circuit compliance can reduce delivered $V_T$—verify measured tidal volume and alarms after setup.\n- Remote infusions via long extension lines introduce delivery delay and dampen occlusion alarms; use large-bore extensions for higher flow and confirm line patency before starting critical drips.\n- Expect capnography transit delay with long sampling lines; ensure continuous $ETCO_2$ and oxygenation monitoring, maintain appropriate $FiO_2$, and have an MRI-safe airway plan and rescue equipment immediately available.",
    "educationalObjective": "Use MRI-compatible anesthesia equipment and remote monitors; route long circuits and tubing safely."
  },
  {
    "id": "Core.3.3.1",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "Patient selection and optimization",
    "difficulty": "medium",
    "questionText": "A 4-month-old boy (5.5 kg) born at 33 weeks’ gestation is scheduled for elective bilateral myringotomy at a free‑standing ambulatory surgery center without overnight capability. He has been well for the past week; a mild upper respiratory infection with clear rhinorrhea resolved 10 days ago without fever or wheeze. Hemoglobin is 12 g/dL, and he has no history of apnea since the NICU. Vitals are normal. By history, his postconceptual age is 33 + 16 = 49 weeks.\n\nWhich perioperative plan is most appropriate?",
    "answers": [
      {
        "text": "Proceed at the ambulatory center and discharge once routine PACU criteria are met",
        "isCorrect": false,
        "explanation": "Former preterm infants <60 weeks postconceptual age have an increased risk of postoperative apnea and bradycardia; same‑day discharge from a free‑standing center is not appropriate."
      },
      {
        "text": "Proceed at the ambulatory center with 6 hours of pulse oximetry in PACU, then discharge if no events",
        "isCorrect": false,
        "explanation": "Apnea risk in ex‑preterm infants <60 weeks postconceptual age extends beyond a brief PACU observation; 12–24 hours of cardiorespiratory monitoring is typically recommended."
      },
      {
        "text": "Postpone the case at least 4 weeks because of the recent URI",
        "isCorrect": false,
        "explanation": "A mild, afebrile URI that resolved >1 week prior does not mandate a 4‑week delay; the limiting factor here is prematurity‑related apnea risk, not the URI."
      },
      {
        "text": "Proceed at the ambulatory center if spinal anesthesia is used to avoid general anesthesia",
        "isCorrect": false,
        "explanation": "Neuraxial anesthesia may reduce but does not eliminate postoperative apnea risk in ex‑preterm infants; monitoring recommendations still apply when PCA <60 weeks."
      },
      {
        "text": "Schedule the case at a hospital and plan overnight cardiorespiratory monitoring postoperatively",
        "isCorrect": true,
        "explanation": "At 49 weeks postconceptual age and former preterm birth, the child is at elevated risk for postoperative apnea; performing the procedure at a facility with capability for 12–24 hours of apnea and bradycardia monitoring is recommended."
      }
    ],
    "didactic": "Key outpatient selection steps in infants include calculating postconceptual age (PCA = gestational age at birth + postnatal age). Former preterm infants have clinically significant risk of postoperative apnea and bradycardia until approximately 52–60 weeks PCA, with highest risk <48–50 weeks. For PCA <60 weeks, most would avoid discharge from a free‑standing ambulatory center and instead perform surgery where 12–24 hours of cardiorespiratory monitoring is available. Additional risk modifiers include anemia (Hct <30%), history of apnea, and opioid/sedative exposure; minimizing opioids and using regional techniques may help but do not replace monitoring. Mild, resolved URIs without fever, wheeze, or purulence can proceed, though airway reactivity may persist for 2–6 weeks; moderate-to-severe URIs warrant postponement. Practical tip: explicitly calculate PCA preop and document the monitoring plan when scheduling ex‑preterm infants for ambulatory procedures.",
    "educationalObjective": "Apply pediatric ambulatory selection criteria (age, prematurity-related apnea risk, recent URI)."
  },
  {
    "id": "Core.3.3.2",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "Patient selection and optimization",
    "difficulty": "medium",
    "questionText": "A 54-year-old woman is scheduled for a laparoscopic cholecystectomy at a freestanding ambulatory surgery center with no overnight capability. She has BMI 52 kg/m^2, neck circumference 47 cm, Mallampati III, and STOP-Bang 7. She was diagnosed with severe OSA (AHI 45) but stopped using CPAP months ago. Vitals are stable; resting SpO2 is 93% on room air. PMH includes well-controlled hypertension, type 2 diabetes (A1c 7.2%), and a provoked DVT 1 year ago (completed anticoagulation). The surgeon anticipates moderate postoperative pain with opioid needs. Which single patient factor most strongly argues for scheduling this case at a hospital with capability for postoperative monitoring rather than the freestanding ASC?\n\nSelect the best answer.",
    "answers": [
      {
        "text": "History of provoked DVT 1 year ago, now off anticoagulation",
        "isCorrect": false,
        "explanation": "Prior provoked VTE increases baseline risk, but appropriate mechanical/chemical prophylaxis and early ambulation can mitigate this; it does not by itself necessitate inpatient venue for a short laparoscopic procedure."
      },
      {
        "text": "Mallampati III with large neck circumference",
        "isCorrect": false,
        "explanation": "These suggest a potentially difficult airway, which impacts planning and equipment needs but does not inherently mandate inpatient postoperative monitoring if the airway can be safely managed intraoperatively."
      },
      {
        "text": "Severe OSA with poor CPAP adherence and anticipated postoperative opioid use",
        "isCorrect": true,
        "explanation": "Untreated severe OSA plus expected opioid requirement markedly increases the risk of postoperative airway obstruction, hypoventilation, and hypoxemia; this combination favors hospital-based surgery with the ability for monitored recovery and potential overnight observation."
      },
      {
        "text": "Resting SpO2 93% on room air",
        "isCorrect": false,
        "explanation": "Mild resting hypoxemia is common in severe obesity and OSA; it signals risk but is less decisive than nonadherent severe OSA combined with anticipated opioid exposure."
      },
      {
        "text": "Super obesity (BMI 52 kg/m^2)",
        "isCorrect": false,
        "explanation": "While BMI ≥50 increases perioperative risk and many centers use it as a caution or exclusion threshold, BMI alone is less predictive of immediate postoperative respiratory compromise than untreated severe OSA in the setting of opioid use."
      }
    ],
    "didactic": "Ambulatory selection in obesity hinges on integrating airway risk, OSA severity and treatment adherence, anticipated postoperative opioid needs, VTE risk, and facility capabilities. Severe OSA with poor CPAP adherence is a high-risk phenotype for postoperative airway obstruction and hypoventilation, especially when opioids are expected, warranting hospital-based care with monitoring and potential overnight observation. Many ASCs adopt conservative thresholds (e.g., BMI ≥50 kg/m^2) due to equipment and staffing constraints, but BMI alone is less predictive of immediate respiratory events than untreated OSA plus opioids. Practical risk reduction includes opioid-sparing multimodal analgesia and regional techniques, encouraging patients to bring and use CPAP postoperatively, and ensuring monitored settings for those at risk of elevated $PaCO_2$. For dosing in severe obesity: succinylcholine is dosed on total body weight, most nondepolarizers and opioids on ideal/lean body weight, and propofol infusions on lean body weight to avoid overdosing. VTE risk rises with obesity and OSA; employ mechanical prophylaxis for all and consider chemoprophylaxis when bleeding risk is acceptable, along with early ambulation. Align venue with the highest-risk element—untreated severe OSA with expected opioid needs typically necessitates a hospital-based setting with extended monitoring.",
    "educationalObjective": "Assess obesity-specific risks (airway, dosing, VTE) and define thresholds that necessitate inpatient venue."
  },
  {
    "id": "Core.3.3.3",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "Patient selection and optimization",
    "difficulty": "hard",
    "questionText": "A 74-year-old man with nonvalvular atrial fibrillation (CHA2DS2-VASc 5), prior ischemic stroke (2 years ago), hypertension, and CKD stage 3 (eGFR 50 mL/min/1.73 m²) is scheduled for ambulatory open carpal tunnel release at 07:30. He takes apixaban 5 mg twice daily; his last dose was at 21:00 last night. Vitals are stable and exam is unremarkable. The surgeon requests a supraclavicular brachial plexus block for postoperative analgesia, but also states the case can be done comfortably with local infiltration and light sedation if needed.\n\nYou are asked to coordinate antithrombotic management and anesthesia for today. Which management strategy is MOST appropriate?",
    "answers": [
      {
        "text": "Delay the case 24 hours from the last apixaban dose, then perform the supraclavicular block and proceed.",
        "isCorrect": false,
        "explanation": "A 24-hour hold is insufficient for therapeutic-dose factor Xa inhibitors. ASRA recommends a ≥72-hour interruption for neuraxial and deep plexus/peripheral blocks in patients on apixaban at treatment doses."
      },
      {
        "text": "Perform an ultrasound-guided supraclavicular block now because real-time imaging lowers bleeding risk on apixaban.",
        "isCorrect": false,
        "explanation": "Ultrasound improves needle accuracy but does not change ASRA timing for anticoagulants. Deep plexus blocks should follow neuraxial precautions; performing a supraclavicular block ~10 hours after apixaban is contraindicated due to noncompressible bleeding risk."
      },
      {
        "text": "Bridge apixaban with therapeutic enoxaparin, stop apixaban now, and perform an infraclavicular block 12 hours after the last LMWH dose.",
        "isCorrect": false,
        "explanation": "Bridging is generally not indicated for DOACs and increases bleeding risk. Moreover, deep plexus/peripheral blocks require a 24-hour interval after therapeutic LMWH—not 12 hours—so this plan still violates timing and adds harm."
      },
      {
        "text": "Proceed with surgeon-administered local infiltration plus light sedation today and continue apixaban; avoid a deep plexus block.",
        "isCorrect": true,
        "explanation": "For minor, superficial hand surgery, local infiltration with light sedation provides adequate anesthesia while respecting ASRA guidance that deep plexus blocks (e.g., supraclavicular) follow neuraxial timing. Therapeutic apixaban requires a ≥72-hour hold for neuraxial/deep plexus techniques; continuing anticoagulation avoids unnecessary thromboembolic risk in a high-risk AF patient."
      },
      {
        "text": "Convert to single-shot spinal anesthesia today since 24 hours off apixaban is adequate for neuraxial techniques.",
        "isCorrect": false,
        "explanation": "Neuraxial techniques require a ≥72-hour hold from the last therapeutic-dose apixaban. Proceeding with a spinal after only 24 hours substantially increases neuraxial hematoma risk."
      }
    ],
    "didactic": "Key point: Deep plexus/peripheral blocks (e.g., supraclavicular, infraclavicular, lumbar plexus) should follow neuraxial timing for antithrombotics. For therapeutic-dose direct oral factor Xa inhibitors (apixaban, rivaroxaban, edoxaban), a ≥72-hour hold is recommended before neuraxial or deep plexus block; ultrasound does not shorten this interval. For LMWH, wait ≥12 hours (prophylactic dosing) or ≥24 hours (therapeutic dosing) before neuraxial/deep plexus techniques; P2Y12 inhibitors (e.g., clopidogrel) require 5–7 days. In contrast, superficial, compressible-site anesthesia/analgesia (surgeon local infiltration, distal field blocks) can often proceed without interrupting antithrombotics. In ambulatory minor procedures, favor techniques that avoid violating neuraxial/deep plexus timing and avoid unnecessary DOAC interruption or bridging. Practical tip: when anticoagulation cannot be held, choose superficial/local options with light sedation and reserve deep blocks/neuraxial for when guideline timing can be met.",
    "educationalObjective": "Coordinate antithrombotic management for minor procedures and ensure neuraxial/regional timing compliance."
  },
  {
    "id": "Core.3.3.4",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "Patient selection and optimization",
    "difficulty": "easy",
    "questionText": "A 45-year-old ASA II patient undergoes ambulatory laparoscopic inguinal hernia repair under general anesthesia. Two hours after arrival to the PACU, the charge nurse asks whether the patient can be discharged home. Which of the following PACU findings most clearly warrants conversion to inpatient admission rather than discharge?",
    "answers": [
      {
        "text": "Nausea with one episode of emesis that resolves after ondansetron and haloperidol; now tolerating oral fluids and crackers",
        "isCorrect": false,
        "explanation": "PONV that responds to therapy and allows oral intake is acceptable for discharge; the admission trigger is refractory PONV that prevents hydration and medication tolerance."
      },
      {
        "text": "Pain initially 8/10, now 3/10 at rest and 4/10 with ambulation on an oral multimodal regimen",
        "isCorrect": false,
        "explanation": "Pain controlled to a functional level with an oral regimen is appropriate for discharge; admission is indicated when pain remains uncontrolled despite appropriate therapy."
      },
      {
        "text": "Requires 3 L/min nasal cannula to maintain SpO2 94% at rest; desaturates to 88% on room air",
        "isCorrect": true,
        "explanation": "A persistent supplemental oxygen requirement to maintain adequate saturation at rest is a clear conversion-to-inpatient criterion due to risk of hypoxemia after discharge."
      },
      {
        "text": "BP 92/56 mm Hg (baseline 118/72), HR 78, asymptomatic after 500 mL LR with stable MAP >65 mm Hg and ambulating without dizziness",
        "isCorrect": false,
        "explanation": "Mild, transient hypotension that resolves with fluids and leaves the patient asymptomatic and hemodynamically stable (MAP >65 mm Hg without vasoactive support) does not mandate admission."
      },
      {
        "text": "Brief orthostatic dizziness on first ambulation that resolves after 1 L LR; now ambulating independently and voided once",
        "isCorrect": false,
        "explanation": "Transient volume-related symptoms that resolve with fluids and do not recur with ambulation are compatible with discharge."
      }
    ],
    "didactic": "Ambulatory discharge decisions hinge on stability without ongoing resource needs. Common conversion-to-inpatient triggers include: (1) hemodynamic instability (e.g., persistent hypotension, tachyarrhythmia, or any need for vasoactive infusion), (2) an ongoing oxygen requirement to keep saturations acceptable on room air at rest, and (3) uncontrolled pain or refractory PONV that prevents oral intake and medication tolerance. Practical tips: confirm stable vitals (MAP ≥65 mm Hg without pressors) after ambulation, ensure SpO2 ≥92% on room air for at least 20–30 minutes, and verify pain/nausea are manageable with an oral regimen at home doses. Reassess after weaning $FiO_2$ to 0.21; any desaturation at rest or with minimal exertion argues against discharge. Treat PONV with multimodal therapy and confirm the patient can keep down fluids and oral meds. Social factors (no escort, inability to comply) may necessitate extended observation, but medical triggers above best define conversion-to-inpatient.",
    "educationalObjective": "Define clear conversion-to-inpatient criteria (hemodynamic instability, uncontrolled pain/PONV, oxygen requirement)."
  },
  {
    "id": "Core.3.3.5",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "Patient selection and optimization",
    "difficulty": "medium",
    "questionText": "A 66-year-old man is scheduled for an elective laparoscopic inguinal hernia repair at a freestanding ambulatory surgery center without overnight capability. Three months ago, he underwent elective PCI with a drug-eluting stent for stable angina and has been asymptomatic since. Medications include aspirin 81 mg daily, clopidogrel 75 mg daily, metoprolol, and atorvastatin. He walks several blocks and climbs two flights of stairs without symptoms. The surgeon asks to stop clopidogrel 5 days preoperatively to minimize bleeding and proceed as planned with same-day discharge.\n\nWhich management plan is most appropriate for this patient?",
    "answers": [
      {
        "text": "Proceed at the ambulatory center as scheduled, stop clopidogrel 5 days preoperatively, and continue aspirin.",
        "isCorrect": false,
        "explanation": "Interrupting P2Y12 therapy only 3 months after a DES for stable coronary disease increases stent thrombosis risk; elective surgery should generally be deferred until at least 6 months post-DES rather than stopping clopidogrel now."
      },
      {
        "text": "Admit to the hospital now, continue aspirin, stop clopidogrel 5 days preoperatively, and plan for overnight telemetry.",
        "isCorrect": false,
        "explanation": "Changing the venue to the hospital does not mitigate the heightened stent thrombosis risk from early P2Y12 interruption at 3 months post-DES for stable disease; deferral is preferred for elective surgery."
      },
      {
        "text": "Stop clopidogrel 5 days preoperatively and \"bridge\" with therapeutic enoxaparin until the morning of surgery.",
        "isCorrect": false,
        "explanation": "Heparin or LMWH does not prevent stent thrombosis due to P2Y12 interruption and is not recommended as a bridge for antiplatelet therapy."
      },
      {
        "text": "Postpone surgery until at least 6 months after DES placement, maintain dual antiplatelet therapy until then, and reassess for outpatient eligibility.",
        "isCorrect": true,
        "explanation": "For elective noncardiac surgery after DES placed for stable coronary disease, guidelines recommend delaying surgery for ~6 months to avoid premature P2Y12 interruption and stent thrombosis; at 6 months, clopidogrel can often be held if needed for bleeding risk."
      },
      {
        "text": "Proceed at the ambulatory center without stopping aspirin or clopidogrel.",
        "isCorrect": false,
        "explanation": "Continuing DAPT minimizes stent thrombosis risk but increases bleeding for a moderate-bleeding procedure (laparoscopic hernia repair) in a setting without inpatient resources; for an elective case at 3 months post-DES, deferral is safer."
      }
    ],
    "didactic": "Key perioperative principles for recent coronary stents hinge on balancing thrombosis versus bleeding and matching the venue to patient risk and resource needs.\n\n- After drug-eluting stent placement for stable coronary disease, elective noncardiac surgery should ideally be delayed for about 6 months to avoid premature interruption of P2Y12 therapy. For ACS indications, many guidelines recommend waiting 12 months when feasible.\n- Time-sensitive procedures may be considered ≥3 months post-DES if the risk of deferral exceeds cardiac risk, but this does not apply to routine elective hernia repair in an ASC.\n- If surgery must proceed before the recommended interval and bleeding risk is low, continuing DAPT can be acceptable, but the setting should permit inpatient monitoring and management of bleeding—typically a hospital rather than an ASC.\n- Bridging with heparin/LMWH does not protect against stent thrombosis from antiplatelet interruption and is discouraged.\n- Practical tip: For moderate-to-high bleeding risk procedures, defer until the minimum DAPT period has elapsed; then continue aspirin, hold the P2Y12 agent per surgical bleeding risk, and choose the venue (ambulatory vs inpatient) based on residual cardiac risk and anticipated need for postoperative monitoring.",
    "educationalObjective": "Optimize cardiovascular disease preoperatively and identify cases requiring inpatient monitoring or delay."
  },
  {
    "id": "Core.3.3.6",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "Patient selection and optimization",
    "difficulty": "hard",
    "questionText": "A 58-year-old woman with type 2 diabetes, obesity (BMI 35), and hypertension is scheduled for elective outpatient shoulder arthroscopy under general anesthesia with an LMA at a freestanding ambulatory surgery center. Medications: metformin, empagliflozin 10 mg daily (last dose yesterday morning), and semaglutide weekly, escalated from 0.5 mg to 1.0 mg this week (last injection 2 days ago). She reports persistent nausea and early satiety since the dose increase; no emesis today. She last ate solids 10 hours ago and had clear liquids 3 hours ago. Vitals are stable; POC glucose is 150 mg/dL; bicarbonate 24 mEq/L; anion gap 12. The center has no ICU and limited capability to run insulin infusions.\n\nWhich perioperative plan is MOST appropriate today to minimize aspiration and ketoacidosis risk?",
    "answers": [
      {
        "text": "Postpone and reschedule: hold empagliflozin for at least 3 days preop (4 days if on ertugliflozin); reschedule after semaglutide dose escalation stabilizes and GI symptoms resolve; consider gastric ultrasound or full-stomach precautions if symptoms persist at the next date.",
        "isCorrect": true,
        "explanation": "Elective ambulatory surgery should be deferred until SGLT2 inhibitors have been held long enough to reduce euglycemic DKA risk and GLP-1–related gastric stasis risk is lower (i.e., after dose escalation or GI symptoms resolve). This plan aligns with consensus guidance and the center’s resource limitations."
      },
      {
        "text": "Proceed today if bedside gastric ultrasound shows an empty antrum and point-of-care β-hydroxybutyrate is <0.6 mmol/L; use an LMA if both are reassuring.",
        "isCorrect": false,
        "explanation": "A single normal antral scan and low ketones do not eliminate the subsequent risk of perioperative ketosis with recent SGLT2 exposure; safe intra/postoperative monitoring and insulin–dextrose therapy may be needed, which the ambulatory setting cannot support."
      },
      {
        "text": "Convert to regional anesthesia with light sedation to avoid aspiration and metabolic complications; it is safe to proceed without medication changes.",
        "isCorrect": false,
        "explanation": "Regional anesthesia may reduce aspiration risk but does not eliminate euglycemic DKA risk from recent SGLT2 use; fasting and surgical stress can still trigger ketosis. The medication timing issue remains unaddressed."
      },
      {
        "text": "Proceed as scheduled after confirming standard NPO status; an LMA is acceptable and no medication changes are needed.",
        "isCorrect": false,
        "explanation": "Standard fasting does not mitigate delayed gastric emptying from GLP-1 agonists during dose escalation with active GI symptoms, and proceeding ignores the euglycemic DKA risk from recent SGLT2 inhibitor use (held <72 hours)."
      },
      {
        "text": "Proceed today with rapid sequence induction and endotracheal intubation to address aspiration risk from semaglutide; no changes are needed for empagliflozin.",
        "isCorrect": false,
        "explanation": "RSI may reduce aspiration risk but does not address ongoing euglycemic DKA risk from recent SGLT2 use; perioperative stress and fasting can precipitate ketosis even with normal glucose."
      }
    ],
    "didactic": "Key issues are GLP-1–related delayed gastric emptying (aspiration risk) and SGLT2 inhibitor–associated euglycemic DKA (EDKA). For SGLT2 inhibitors, hold for at least 3 days preop (72 hours; ertugliflozin 4 days) for elective cases; if not held, postpone elective surgery. If urgent and SGLT2 cannot be stopped, monitor β-hydroxybutyrate and acid–base status, and use insulin with dextrose to suppress ketogenesis—typically unsuitable for freestanding ambulatory centers.\n\nGLP-1 agonists: most patients can continue; however, those in active dose escalation or with GI symptoms (nausea, vomiting, early satiety) have higher residual gastric volumes. In symptomatic or high-risk patients, either delay surgery until symptoms abate or apply full-stomach precautions; bedside gastric ultrasound can aid decision-making when expertise is available, but a reassuring scan does not address SGLT2-related EDKA risk.\n\nPractical tips:\n- Elective + recent SGLT2 use: defer; check ketones if concern for EDKA (β-hydroxybutyrate >3 mmol/L suggests DKA).\n- GLP-1 with symptoms/escalation: consider delay; if proceeding urgently, treat as full stomach (RSI, cuffed ETT) and avoid heavy opioids; prokinetics may help but do not normalize gastric emptying.\n- Ambulatory setting constraints (no ICU/infusions) lower the threshold to postpone rather than attempt complex metabolic management.",
    "educationalObjective": "Plan perioperative management of diabetes, including GLP-1 agonists and SGLT2 inhibitors, to reduce aspiration and ketoacidosis risk."
  },
  {
    "id": "Core.3.3.7",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "Patient selection and optimization",
    "difficulty": "easy",
    "questionText": "A 78-year-old man is scheduled for ambulatory laparoscopic inguinal hernia repair at a freestanding surgery center with no overnight capability. He has hypertension and stage 3 chronic kidney disease; BMI is 29 kg/m^2 and vitals are stable. He ambulates with a cane and completes a Timed Up and Go test in 18 seconds. Mini-Cog screening is 2/5 with an abnormal clock draw. STOP-Bang is 3; he uses his home CPAP nightly. He lives alone; his daughter can drive him home but cannot stay overnight. Which preoperative finding most strongly argues against safe same-day discharge from this ambulatory center?",
    "answers": [
      {
        "text": "Lack of a responsible adult to provide overnight supervision after discharge",
        "isCorrect": true,
        "explanation": "Absence of reliable post-discharge supervision is a hard stop for same-day discharge after anesthesia/sedation due to risks of falls, medication misadventure, and delayed recognition of complications."
      },
      {
        "text": "45-minute drive home from the surgery center",
        "isCorrect": false,
        "explanation": "Travel time alone is not a contraindication to same-day discharge if the patient is otherwise stable and has appropriate postoperative support and instructions."
      },
      {
        "text": "Intermediate OSA risk (STOP-Bang 3) with adherence to home CPAP",
        "isCorrect": false,
        "explanation": "OSA increases postoperative risk, but with CPAP adherence and opioid-sparing strategies, it typically does not preclude ambulatory surgery or discharge if other criteria and supports are met."
      },
      {
        "text": "Timed Up and Go of 18 seconds (frailty)",
        "isCorrect": false,
        "explanation": "Frailty predicts falls and unplanned admission, prompting risk mitigation or consideration of observation, but it is not an absolute barrier if adequate supervision and support are ensured."
      },
      {
        "text": "Positive Mini-Cog screen (2/5) suggesting cognitive impairment",
        "isCorrect": false,
        "explanation": "Cognitive impairment elevates delirium and safety risks, but with informed caregiver supervision and simplified regimens, same-day discharge may still be appropriate; lack of supervision is the critical limiting factor here."
      }
    ],
    "didactic": "Safe same-day discharge hinges on medical stability and adequate home support. Nearly all ambulatory centers require both a responsible escort and reliable adult supervision for at least 24 hours after anesthesia/sedation; lack of supervision is a strong contraindication to discharge. Frailty screening (e.g., Timed Up and Go >12 seconds, slow gait speed, weight loss) and cognitive screening (e.g., Mini-Cog <3) identify patients at higher risk for falls, delirium, and readmission, guiding enhanced precautions or observation but do not by themselves mandate admission if robust support is in place. OSA, especially when patients use CPAP and receive opioid-sparing multimodal/regional analgesia, rarely precludes ambulatory pathways with appropriate monitoring. Practical tips: ask about home supports early, document the plan for overnight supervision, tailor analgesia to minimize sedatives/anticholinergics, and provide clear written instructions to the caregiver. If supervision cannot be arranged, convert to 23-hour observation or reschedule to a facility that can provide overnight care.",
    "educationalObjective": "Screen for frailty, cognitive impairment, and social support that affect same-day discharge safety."
  },
  {
    "id": "Core.3.3.8",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "Patient selection and optimization",
    "difficulty": "easy",
    "questionText": "You are screening cases for a freestanding ambulatory surgery center (no overnight capability; limited ability to manage prolonged postoperative oxygen needs). Which patient is the best candidate for same-day surgery at this facility?\n\n- All patients are hemodynamically stable at rest and NPO; assume standard monitors are available. Procedures are elective.\n\nSelect the single best option.",
    "answers": [
      {
        "text": "58-year-old with severe OSA who does not use CPAP, BMI 41, scheduled for uvulopalatopharyngoplasty with expected significant opioid requirement",
        "isCorrect": false,
        "explanation": "Untreated/severe OSA with anticipated opioid use increases risk of postoperative airway obstruction and hypoventilation, often necessitating extended monitoring not available at a freestanding ASC."
      },
      {
        "text": "65-year-old with a drug-eluting coronary stent placed 6 weeks ago on dual antiplatelet therapy, scheduled for elective open inguinal hernia repair",
        "isCorrect": false,
        "explanation": "Elective surgery should generally be deferred for several months after DES placement; interrupting antiplatelet therapy risks stent thrombosis, while continuing it increases bleeding risk—both problematic in an ASC setting."
      },
      {
        "text": "72-year-old with heart failure (EF 25%) recently hospitalized for decompensation, now dyspneic with minimal exertion and using 2 L/min oxygen at home, scheduled for a 2-hour laparoscopic cholecystectomy",
        "isCorrect": false,
        "explanation": "Recent decompensated heart failure and home oxygen use predict high perioperative risk and potential admission; pneumoperitoneum and Trendelenburg can further stress cardiopulmonary reserve—poor fit for an ASC."
      },
      {
        "text": "46-year-old with well-controlled hypertension and mild OSA adherent to CPAP, BMI 32, scheduled for a 45-minute arthroscopic knee meniscectomy with adductor canal block and multimodal analgesia planned",
        "isCorrect": true,
        "explanation": "Comorbidities are controlled (ASA II–III range), OSA is treated with CPAP and an opioid-sparing plan is in place, and the procedure is short with minimal expected blood loss and pain—features well-suited to ambulatory care."
      }
    ],
    "didactic": "Ambulatory selection hinges on three pillars: patient factors (ASA class and control of comorbidities), procedure factors (duration, invasiveness, bleeding/pain), and facility capabilities (monitoring, rescue, admission pathways). Well-optimized ASA I–III patients undergoing short, low-blood-loss procedures with oral/regional analgesia are ideal. OSA can be acceptable if the patient is adherent to CPAP and an opioid-sparing plan is used; untreated/severe OSA with anticipated opioid needs often warrants inpatient-level monitoring. Recent decompensated heart failure, oxygen dependence, unstable coronary disease, or recent drug-eluting stent placement generally excludes patients from freestanding ASCs. Procedure choice matters: avoid cases likely to require parenteral analgesia, prolonged recovery, or significant fluid shifts/bleeding. Practical tip: if you anticipate unplanned admission or need for extended respiratory monitoring, redirect to a hospital-based setting.",
    "educationalObjective": "Select appropriate ambulatory candidates using ASA class, comorbidity control, and procedure complexity."
  },
  {
    "id": "Core.3.3.9",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "Patient selection and optimization",
    "difficulty": "medium",
    "questionText": "You are triaging patients in a preoperative clinic for an ambulatory center that cannot admit overnight but can provide extended PACU observation for 2–3 hours. All patients below are scheduled for outpatient laparoscopic inguinal hernia repair under general anesthesia with multimodal analgesia; a TAP block is available to minimize opioids. Comorbidities (e.g., hypertension) are well controlled, and none have COPD or heart failure.\n\nWhich patient profile is the best candidate for same-day discharge from this ambulatory center?\n",
    "answers": [
      {
        "text": "AHI 10 (mild OSA), BMI 38, poor CPAP adherence, chronic opioid use 50 MME/day",
        "isCorrect": false,
        "explanation": "Concurrent poor CPAP adherence and higher opioid requirements compound risk; despite mild OSA, this profile is unfavorable for ambulatory same-day discharge."
      },
      {
        "text": "AHI 46 (severe OSA), BMI 36, adherent with CPAP ~6 h/night, opioid-naïve; TAP block planned",
        "isCorrect": false,
        "explanation": "Although CPAP adherence and opioid-sparing help, severe OSA increases perioperative risk; compared with a mild OSA, adherent, low-opioid–need patient, this is not the best ambulatory candidate."
      },
      {
        "text": "AHI 18 (moderate OSA), BMI 34, adherent to CPAP, chronic pain with 80 MME/day and history of high postoperative opioid needs despite blocks",
        "isCorrect": false,
        "explanation": "High baseline and anticipated postoperative opioid requirements increase risk of ventilatory depression and apneic events in OSA, making ambulatory same-day discharge less appropriate even with CPAP adherence."
      },
      {
        "text": "AHI 22 (moderate OSA), BMI 35, prescribed CPAP but uses <1 h/night and refuses to bring the device; opioid-naïve; TAP block planned",
        "isCorrect": false,
        "explanation": "Poor CPAP adherence and inability/unwillingness to use CPAP postoperatively increase risk of hypoxemia and airway events, arguing against same-day discharge despite low expected opioid use."
      },
      {
        "text": "AHI 12 (mild OSA), BMI 33, uses home CPAP nightly with download showing >90% of nights ≥5 h, opioid-naïve; TAP block planned, expected minimal opioid need",
        "isCorrect": true,
        "explanation": "Mild OSA with strong CPAP adherence and an opioid-sparing plan carries the lowest risk of postoperative airway obstruction and hypoxemia, making ambulatory management with same-day discharge most appropriate among the options."
      }
    ],
    "didactic": "Ambulatory suitability in OSA hinges on three pillars: OSA severity, expected postoperative opioid needs, and CPAP adherence/availability. Lower AHI (mild–moderate), proven CPAP adherence (e.g., ≥4 h/night on most nights), and an opioid-sparing plan (regional blocks, acetaminophen, NSAIDs, gabapentinoids) favor same-day discharge. High opioid requirements (chronic use, painful procedures, or inability to use regional) amplify risk for hypoventilation and hypoxemia in OSA and often warrant planned admission or prolonged monitoring. Poor CPAP adherence or refusal to bring/use the device post-op is a strong reason to avoid ambulatory discharge because home CPAP mitigates nocturnal events when residual anesthetics and opioids persist. Practical tips: instruct patients to bring and use CPAP in PACU and at home, minimize long-acting opioids and sedatives, schedule early cases to allow observation, and consider extended pulse-oximetry with supplemental oxygen. When multiple risk factors coexist (severe OSA, poor CPAP use, high opioid need), prefer inpatient or monitored settings over ambulatory discharge.",
    "educationalObjective": "Stratify OSA patients for ambulatory surgery using severity, opioid needs, and home CPAP adherence."
  },
  {
    "id": "Core.3.4.1",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "Procedural sedation and MAC",
    "difficulty": "medium",
    "questionText": "A 32-year-old man with obesity (BMI 33) and symptomatic GERD presents to the ED with a painful anterior shoulder dislocation requiring urgent reduction. Vitals are BP 138/82, HR 104, RR 18, SpO2 98% on room air. He ate a burger, fries, and a milkshake 3 hours ago. The ED team requests “MAC with propofol” for the reduction in a monitored bay. Airway exam is unremarkable. \n\nWhich approach best balances timely reduction with mitigation of aspiration risk in this urgent setting?\n",
    "answers": [
      {
        "text": "Proceed now with ketamine-based sedation because airway reflexes are preserved",
        "isCorrect": false,
        "explanation": "Ketamine does not guarantee intact protective reflexes; vomiting, hypersalivation, and laryngospasm can still occur, especially when sedation depth fluctuates in a full-stomach patient."
      },
      {
        "text": "Perform a rapid-sequence induction with endotracheal intubation for general anesthesia",
        "isCorrect": false,
        "explanation": "RSI with a cuffed ETT mitigates aspiration risk but is more invasive than necessary for a brief reduction when a regional option can achieve excellent conditions with minimal sedation."
      },
      {
        "text": "Delay the reduction until 6 hours after the meal, then proceed with MAC",
        "isCorrect": false,
        "explanation": "Time-sensitive reductions should not be delayed; additionally, high-fat, solid meals typically require 8 or more hours of fasting. Deferral risks neurovascular compromise and more difficult reduction."
      },
      {
        "text": "Administer nonparticulate antacid and metoclopramide, then proceed with moderate-to-deep propofol sedation via nasal cannula",
        "isCorrect": false,
        "explanation": "Antacid and prokinetic therapy do not reliably empty the stomach or prevent regurgitation; propofol sedation often drifts to deep levels, removing airway reflexes and increasing aspiration risk in a full-stomach patient."
      },
      {
        "text": "Proceed now with ultrasound-guided interscalene block and perform the reduction with minimal sedation in a head-up position",
        "isCorrect": true,
        "explanation": "A regional technique avoids deep sedation in a recently fed, high-risk patient and provides muscle relaxation for reduction. Minimal sedation with head-up positioning reduces aspiration risk while allowing timely care."
      }
    ],
    "didactic": "Key fasting intervals for elective anesthesia/deep sedation per ASA guidance: clear liquids ≥2 h; breast milk 4 h; infant formula/nonhuman milk/light meal 6 h; fatty/fried foods 8 h or more. These fasting recommendations apply to general anesthesia and deep sedation because airway reflexes may be blunted unpredictably; moderate sedation can deepen, so similar caution is prudent.\n\nFor urgent, time-sensitive procedures in non-fasted patients, do not rely on antacids/prokinetics to “make it safe.” Instead, mitigate risk by selecting techniques that avoid deep sedation (regional/local anesthesia), minimizing positive-pressure mask ventilation, using head-up positioning, and ensuring suction and airway equipment are immediately available. If deep sedation or GA is required in a high-risk patient or procedure (e.g., ERCP in prone, severe GERD with full stomach), a rapid-sequence induction with a cuffed ETT is appropriate. Point-of-care gastric ultrasound can aid decision-making when expertise is available. Practical tip: For shoulder reduction, interscalene or suprascapular–axillary nerve blocks provide excellent conditions and often obviate the need for deep sedation in recently fed patients.",
    "educationalObjective": "Apply fasting guidance for elective sedation and adapt for urgent procedures while mitigating aspiration risk."
  },
  {
    "id": "Core.3.4.2",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "Procedural sedation and MAC",
    "difficulty": "medium",
    "questionText": "A 68-year-old man with severe COPD (FEV1 30% predicted) and OSA on nightly CPAP presents for ambulatory colonoscopy. He uses nocturnal home oxygen. A recent ABG shows $PaCO_2$ 55 mm Hg and PaO2 65 mm Hg on room air. Preprocedure vitals: BP 148/82 mm Hg, HR 74/min, SpO2 92% on room air. The endoscopist anticipates a 30-minute exam with moderate-to-severe discomfort from insufflation and possible polypectomy. You plan to maintain spontaneous ventilation with supplemental oxygen via nasal cannula and continuous capnography.\n\nWhich primary sedation-analgesia strategy is most appropriate to provide comfort while minimizing hypoventilation in this patient?",
    "answers": [
      {
        "text": "Midazolam 2 mg IV plus fentanyl 100 mcg IV, titrated as needed",
        "isCorrect": false,
        "explanation": "Benzodiazepine–opioid combinations have supra-additive respiratory depression and blunt ventilatory response to $CO_2$, high-risk in COPD/OSA with chronic hypercapnia. Although analgesic, they substantially increase hypoventilation risk."
      },
      {
        "text": "Titrated ketamine (e.g., 0.25–0.5 mg/kg IV bolus, then 0.1–0.25 mg/kg boluses or 0.2–0.5 mg/kg/hr infusion)",
        "isCorrect": true,
        "explanation": "Ketamine provides effective analgesia, preserves ventilatory drive and airway reflexes, and offers bronchodilation—ideal for COPD/OSA with chronic hypercapnia. Hemodynamics are generally maintained; secretions and dysphoria can be mitigated with careful titration."
      },
      {
        "text": "Propofol infusion (e.g., 50–100 mcg/kg/min) titrated to moderate-to-deep sedation",
        "isCorrect": false,
        "explanation": "Propofol causes dose-dependent respiratory depression and apnea, risking marked $PaCO_2$ rise and airway obstruction in COPD/OSA. It also tends to decrease blood pressure."
      },
      {
        "text": "Dexmedetomidine infusion (e.g., 0.2–0.7 mcg/kg/hr) without adjuncts",
        "isCorrect": false,
        "explanation": "Dexmedetomidine minimally depresses respiration but provides limited analgesia; colonoscopy discomfort often necessitates additional opioids, negating its respiratory advantage. It may also cause bradycardia/hypotension."
      },
      {
        "text": "Midazolam 2 mg IV alone, with rescue doses if needed",
        "isCorrect": false,
        "explanation": "Midazolam offers anxiolysis but poor analgesia for a painful procedure and still depresses ventilation in COPD/OSA. Likely inadequate for comfort and safety."
      }
    ],
    "didactic": "For painful procedures in patients with severe COPD and OSA, prioritize agents that preserve ventilatory drive while providing analgesia. Small reductions in alveolar ventilation can disproportionately raise $PaCO_2$ in chronic CO2 retainers: $PaCO_2 \\propto \\frac{V_{CO_2}}{\\dot V_A}$. Ketamine is uniquely suited: it supplies dissociative analgesia, preserves spontaneous ventilation and airway reflexes, and bronchodilates—helpful in COPD—while maintaining hemodynamics. Dexmedetomidine offers minimal respiratory depression but weak analgesia and can cause bradycardia/hypotension; it is better for minimally painful MAC cases or when immobility with cooperative sedation is desired. Propofol and benzodiazepine–opioid regimens are effective but carry substantial risks of hypoventilation, apnea, and airway obstruction in OSA/COPD; if used, employ capnography, cautious titration, and readiness to support the airway. Practical tips: give ketamine 0.25–0.5 mg/kg IV over 30–60 seconds, repeat 0.1–0.25 mg/kg as needed or run 0.2–0.5 mg/kg/hr; monitor with nasal ETCO2, and avoid unnecessary co-administration of opioids/benzodiazepines that erode ketamine’s respiratory advantages.",
    "educationalObjective": "Choose sedatives/analgesics (midazolam, fentanyl, propofol, ketamine, dexmedetomidine) based on procedure and patient factors."
  },
  {
    "id": "Core.3.4.3",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "Procedural sedation and MAC",
    "difficulty": "easy",
    "questionText": "A 62-year-old man (BMI 40) with hypertension and severe OSA on nightly CPAP presents to an ambulatory surgery center for a 45-minute combined carpal tunnel release and trigger finger release under MAC. The surgeon plans a forearm tourniquet for 35 minutes and will proceed in a single upper-extremity field. Baseline vitals: BP 138/82 mm Hg, HR 78/min, SpO2 96% on room air. The patient is anxious but agreeable to “light sedation.” Standard monitors and nasal cannula with end-tidal $CO_2$ sampling will be used.\n\nWhich anesthetic plan best balances safety and rapid recovery for this patient?",
    "answers": [
      {
        "text": "Ultrasound-guided axillary brachial plexus block covering median/ulnar/radial nerves, plus light titrated propofol (25–50 mcg/kg/min) and minimal or no opioids",
        "isCorrect": true,
        "explanation": "A regional block reliably treats incision and tourniquet pain, allowing light, short-acting sedation with preserved spontaneous ventilation—minimizing airway risk in OSA and expediting discharge."
      },
      {
        "text": "Deep propofol infusion (100–150 mcg/kg/min) plus intermittent fentanyl to tolerate the tourniquet, nasal cannula oxygen",
        "isCorrect": false,
        "explanation": "Deep sedation with propofol and opioids increases risk of airway obstruction/apnea in OSA and often escalates when tourniquet pain emerges, delaying recovery."
      },
      {
        "text": "Midazolam 4 mg and fentanyl 100 mcg boluses, with surgeon local infiltration at the incision sites",
        "isCorrect": false,
        "explanation": "Benzodiazepine–opioid synergy commonly causes respiratory depression in OSA and may still fail to cover tourniquet discomfort, prompting more sedatives and prolonged PACU time."
      },
      {
        "text": "General anesthesia with LMA and low-dose sevoflurane to ensure immobility and comfort",
        "isCorrect": false,
        "explanation": "While effective, GA adds airway manipulation, higher PONV risk, and typically longer recovery without clear benefit over regional + light sedation for this brief ambulatory case."
      },
      {
        "text": "Dexmedetomidine 1 mcg/kg bolus over 10 minutes then 0.7 mcg/kg/h infusion without regional block, allow surgeon local infiltration",
        "isCorrect": false,
        "explanation": "Dexmedetomidine has less respiratory depression, but a 1 mcg/kg bolus risks bradycardia/hypotension and, without a block, tourniquet pain often necessitates rescue opioids and deeper sedation."
      }
    ],
    "didactic": "Combining a targeted regional technique with light, titratable sedation is ideal for OSA patients undergoing painful extremity procedures in ambulatory settings. A brachial plexus block (e.g., axillary for hand surgery) covers both incision and tourniquet pain, preventing the cycle of escalating sedatives/opioids that increases airway risk. Light propofol (about 25–50 mcg/kg/min) or very small boluses provide anxiolysis with rapid offset; avoid routine opioids when surgical analgesia is regional. Dexmedetomidine can be useful for MAC but large boluses (1 mcg/kg) may cause bradycardia/hypotension and delay discharge; if used, start low and avoid boluses in OSA. Practical tips: confirm block onset before tourniquet inflation, use end-tidal $CO_2$ monitoring with nasal cannula, position to optimize airway, and have CPAP available postoperatively. This approach reduces respiratory complications, PONV, and time to discharge while maintaining patient comfort.",
    "educationalObjective": "Combine local/regional techniques with light sedation to improve safety and recovery profiles."
  },
  {
    "id": "Core.3.4.4",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "Procedural sedation and MAC",
    "difficulty": "easy",
    "questionText": "A 62-year-old man (BMI 32) with obstructive sleep apnea on home CPAP presents to the endoscopy suite for ERCP under monitored anesthesia care with propofol titrated to achieve moderate-to-deep sedation. Baseline vitals: BP 142/78 mm Hg, HR 78/min, $SpO_2$ 98% on nasal cannula at 4 L/min. After a propofol bolus, he becomes unresponsive to verbal and light tactile stimulation, withdraws only to a trapezius squeeze, and has a brief apnea with $SpO_2$ to 86%. You perform a jaw thrust and provide several assisted positive-pressure breaths by mask; ventilation resumes and $SpO_2$ returns to 99%. The endoscopist asks to continue.\n\nWhich statement best reflects appropriate practice under the ASA sedation continuum and provider responsibilities in this situation?",
    "answers": [
      {
        "text": "During MAC in the endoscopy suite, airway maneuvers (jaw thrust, mask ventilation) are not permitted and indicate a breach of MAC.",
        "isCorrect": false,
        "explanation": "MAC describes a service level, not a prohibition on airway support. Airway maneuvers and positive-pressure ventilation are appropriate components of rescue during deep sedation."
      },
      {
        "text": "Because mask ventilation was required, the procedure must be converted to endotracheal general anesthesia.",
        "isCorrect": false,
        "explanation": "A brief need for airway support does not mandate conversion; the key requirement is the capability to rescue from a deeper-than-intended level. Conversion is based on ongoing airway instability, aspiration risk, or procedural needs."
      },
      {
        "text": "Continuous capnography is optional during deep sedation if pulse oximetry is used and $FiO_2$ is high.",
        "isCorrect": false,
        "explanation": "During moderate and deep sedation, monitoring for exhaled $CO_2$ is recommended to detect hypoventilation early; high $FiO_2$ may delay $SpO_2$ desaturation and mask apnea."
      },
      {
        "text": "Withdrawal only to painful stimulation (e.g., trapezius squeeze) indicates moderate sedation.",
        "isCorrect": false,
        "explanation": "Purposeful response only to repeated or painful stimulation is deep sedation; moderate sedation entails purposeful response to verbal or tactile stimulation without painful stimuli."
      },
      {
        "text": "Proceed with deep sedation only if the anesthesia provider can recognize and rescue from general anesthesia, including airway management and positive-pressure ventilation.",
        "isCorrect": true,
        "explanation": "Under the sedation continuum, patients may drift deeper than intended; providers delivering deep sedation must be able to rescue from general anesthesia, including airway interventions and ventilation support."
      }
    ],
    "didactic": "Sedation exists on a continuum: minimal (responds to verbal commands), moderate (purposeful response to verbal/tactile, no airway intervention needed), deep (purposeful response only after repeated or painful stimulation; airway/ventilation may be impaired), and general anesthesia (unarousable; airway intervention usually required). Because patients can unintentionally drift deeper, providers must be able to “rescue” one level deeper than intended (e.g., deep sedation providers must rescue from general anesthesia with airway management and positive-pressure ventilation). Monitoring should include continuous assessment of ventilation with capnography during moderate and deep sedation, as $SpO_2$ can lag and high $FiO_2$ may obscure apnea. Practical tips: have suction, BVM, oral/nasal airways, and a supraglottic device immediately available; preoxygenate OSA patients; titrate propofol slowly; and communicate with the proceduralist about stimulation timing. Depth is defined by patient responsiveness and physiologic effects, not by the drug or the label “MAC.” If repeated airway rescue is needed or aspiration risk is high, consider conversion to a secured airway under general anesthesia.",
    "educationalObjective": "Describe the sedation continuum and the requirement for rescue capability from a deeper-than-intended level."
  },
  {
    "id": "Core.3.4.5",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "Procedural sedation and MAC",
    "difficulty": "easy",
    "questionText": "In the GI suite, a 58-year-old ASA II man undergoes colonoscopy under MAC with propofol. Your record includes: pre-procedure assessment and consent, NPO status, sedation start 09:14 and stop 09:33, medications with dose and exact times, and time-based vitals every 5 minutes with $SpO_2$, capnography ($ETCO_2$), ECG, and NIBP. In recovery, he is comfortable, hemodynamically stable on room air, and has a ride home.\n\nTo complete documentation for safe ambulatory discharge in accordance with institutional sedation policy, which entry is MOST appropriate to add?",
    "answers": [
      {
        "text": "A single spot check of blood pressure and $SpO_2$ immediately before discharge",
        "isCorrect": false,
        "explanation": "Policies require time-based monitored recovery with objective criteria; a single data point does not demonstrate sustained stability or readiness."
      },
      {
        "text": "An objective discharge score (e.g., Modified Aldrete or PADSS) meeting threshold, with the time criteria were achieved and confirmation of a responsible escort",
        "isCorrect": true,
        "explanation": "Policies typically require an objective score demonstrating return to baseline or a threshold (commonly ≥9), the time readiness is met, and confirmation of an escort; this best evidences discharge readiness."
      },
      {
        "text": "A narrative note stating the patient is awake, drinking fluids, and requests discharge",
        "isCorrect": false,
        "explanation": "Subjective impressions lack standardized criteria; policies favor objective scoring systems to reduce variability and risk."
      },
      {
        "text": "An anesthesia end time equal to the moment the patient physically leaves the facility",
        "isCorrect": false,
        "explanation": "Anesthesia end time reflects when the anesthesiologist is no longer in attendance, not facility exit; equating them misrepresents care and does not address discharge criteria."
      },
      {
        "text": "The total propofol administered and the time of last opioid dose",
        "isCorrect": false,
        "explanation": "Medication totals and last opioid time are important but already documented; they do not by themselves establish discharge readiness."
      }
    ],
    "didactic": "High-quality procedural sedation documentation spans three phases:\n\n- Pre-procedure: indication, consent, focused history/airway, ASA class, NPO status, and baseline vitals.\n- Intra-procedure: sedation start/stop times, all medications with dose/route/time and cumulative totals, and time-based monitoring of oxygenation, ventilation (capnography for moderate–deep sedation), and circulation at least every 5 minutes per ASA Standards.\n- Recovery/discharge: continued monitoring at regular intervals until objective discharge criteria are met, then document an objective score (e.g., Modified Aldrete or PADSS), the time readiness was achieved, final vitals, and confirmation of a responsible escort and instructions provided.\n\nPractical tips: use the flowsheet to auto-sum meds, ensure $ETCO_2$ and $SpO_2$ are audible/continuous, and avoid conflating anesthesia end time with discharge time. Objective scoring (threshold commonly ≥9 or back to baseline) standardizes safety and reduces variability in ambulatory settings.",
    "educationalObjective": "Document sedation times, medications, monitoring, and discharge readiness according to institutional policy."
  },
  {
    "id": "Core.3.4.6",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "Procedural sedation and MAC",
    "difficulty": "medium",
    "questionText": "A 35-year-old man (ASA II) presents to an ambulatory procedure room for closed reduction of an anterior shoulder dislocation under MAC. Standard monitors are applied and oxygen is provided via nasal cannula at 2 L/min. For a 10-minute reduction, you administer ketamine 1 mg/kg IV to achieve dissociative sedation. Two minutes later, while the reduction begins, he develops copious oral secretions with gurgling respirations and mild suprasternal retractions. SpO2 falls from 99% to 92% despite increasing nasal cannula flow to 4 L/min; HR is 110 bpm and BP is 160/95 mm Hg. The jaw is easily supported and no masseter rigidity is present.\n\nWhich of the following is the most appropriate next step to manage this ketamine-related complication?",
    "answers": [
      {
        "text": "Administer atropine 1 mg IV to dry secretions",
        "isCorrect": false,
        "explanation": "Atropine can reduce secretions, but 1 mg is an excessive dose in this setting and risks significant tachycardia and CNS effects; glycopyrrolate is preferred in a tachycardic adult due to less chronotropy and no CNS penetration."
      },
      {
        "text": "Give an additional ketamine 0.5 mg/kg IV to deepen dissociation",
        "isCorrect": false,
        "explanation": "Deeper ketamine levels do not address secretion-related obstruction and may worsen sialorrhea, prolong recovery, and further stimulate sympathetic output."
      },
      {
        "text": "Apply CPAP 10 cm H2O with 100% $FiO_2$ to stent the upper airway",
        "isCorrect": false,
        "explanation": "Positive pressure without first clearing pooled secretions risks aspiration and may precipitate laryngospasm; initial management is suction plus an antisialagogue, with airway maneuvers as needed after secretions are cleared."
      },
      {
        "text": "Administer glycopyrrolate 0.2 mg IV and suction the oropharynx",
        "isCorrect": true,
        "explanation": "Glycopyrrolate provides effective antisialagogue effects with minimal chronotropy and no CNS penetration; combined with immediate suctioning, it relieves secretion-related upper airway obstruction and reduces laryngospasm risk without exacerbating tachycardia or emergence phenomena."
      },
      {
        "text": "Administer midazolam 2 mg IV to prevent an emergence reaction",
        "isCorrect": false,
        "explanation": "Benzodiazepines may mitigate emergence reactions later but do not treat acute hypersalivation and can worsen airway patency/ventilation when combined with sedatives; the priority is clearing secretions and reducing further salivation."
      }
    ],
    "didactic": "Ketamine dosing depends on the goal: subdissociative analgesia is typically 0.1–0.3 mg/kg IV, while dissociative sedation is 1–2 mg/kg IV (onset 30–60 seconds, duration ~10–15 minutes for a single bolus). Hypersalivation is common and can compromise the upper airway or precipitate laryngospasm—prompt suction and airway positioning (jaw thrust, oral/nasal airway) are first-line, followed by an antisialagogue if needed. Glycopyrrolate 0.2 mg IV (≈0.004 mg/kg) effectively reduces secretions with minimal tachycardia and no CNS effects, making it preferable to atropine in tachycardic adults. Emergence reactions (e.g., dysphoria, hallucinations) can be mitigated with low-dose midazolam (e.g., 0.5–1 mg IV) or small propofol boluses near the end of the procedure and by minimizing stimulation. Practical tips: consider prophylactic glycopyrrolate in patients at higher risk of problematic secretions (e.g., URIs, heavy secretors), and treat any desaturation with suction, airway maneuvers, and 100% $FiO_2$ before escalating to positive pressure. For brief, painful procedures, an initial 0.5–1 mg/kg IV ketamine bolus often suffices; reassess before redosing to avoid unnecessary adverse effects.",
    "educationalObjective": "Dose ketamine safely for analgesic and dissociative sedation and manage hypersalivation or emergence reactions."
  },
  {
    "id": "Core.3.4.7",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "Procedural sedation and MAC",
    "difficulty": "medium",
    "questionText": "A 54-year-old man (ASA II) is receiving monitored anesthesia care for an outpatient MRI in the remote imaging suite. He is breathing spontaneously on 3 L/min nasal cannula with EtCO2 sampling and an infusion of propofol at 75 mcg/kg/min. After 10 minutes, NIBP is 78/46 mm Hg, HR 44 bpm, SpO2 98%, EtCO2 40 mm Hg. You reduce the propofol to 50 mcg/kg/min and administer a 500 mL lactated Ringer’s bolus. Five minutes later, NIBP is 74/44 mm Hg and HR is 42 bpm with the same respiratory parameters.\n\nWhich medication is the most appropriate next step to improve his blood pressure?",
    "answers": [
      {
        "text": "Glycopyrrolate 0.2 mg IV",
        "isCorrect": false,
        "explanation": "Glycopyrrolate may modestly increase HR without directly correcting vasodilation and has a slower, less reliable pressor effect. It is less effective than ephedrine for rapid MAP restoration in this setting."
      },
      {
        "text": "Norepinephrine infusion at 0.02 mcg/kg/min",
        "isCorrect": false,
        "explanation": "A vasopressor infusion is typically unnecessary as an immediate next step for transient, sedation-induced hypotension responsive to bolus therapy. Reserve for refractory hypotension or when repeated boluses fail."
      },
      {
        "text": "Atropine 0.5 mg IV bolus",
        "isCorrect": false,
        "explanation": "Atropine treats vagally mediated bradycardia but does not correct propofol-induced vasodilation. In combined hypotension and bradycardia without a strong vagal trigger, ephedrine more directly improves MAP by increasing both CO and SVR."
      },
      {
        "text": "Ephedrine 10 mg IV bolus",
        "isCorrect": true,
        "explanation": "Ephedrine increases HR and contractility (β1) and SVR (α) to raise MAP, which is ideal for propofol-associated hypotension with bradycardia after fluids and dose reduction. It addresses both low CO and vasodilation."
      },
      {
        "text": "Phenylephrine 100 mcg IV bolus",
        "isCorrect": false,
        "explanation": "Phenylephrine will raise SVR but often further slows HR via baroreflex, risking lower CO and persistent hypotension in a bradycardic patient. Best when hypotension coexists with tachycardia or isolated vasodilation."
      }
    ],
    "didactic": "Propofol commonly causes venous and arterial vasodilation (↓preload and ↓SVR), blunts baroreflex-mediated tachycardia, and has mild negative inotropy—predisposing to hypotension and bradycardia, especially in relatively hypovolemic ambulatory patients. After lightening sedation and giving fluids, choose vasoactive agents based on the hemodynamic phenotype. Ephedrine is preferred for hypotension with bradycardia because it raises HR and contractility (β1) and SVR (α), improving MAP via both determinants of $MAP \\approx CO \\times SVR$ (i.e., $P = Q \\times R$). Phenylephrine suits hypotension with tachycardia or pure vasodilation but may worsen bradycardia. For profound symptomatic bradycardia (e.g., vagal events during endoscopy or dexmedetomidine bolus), atropine is appropriate; if blood pressure is also low, add a vasopressor that supports CO. Practical tips: reduce/stop the offending sedative, give 250–500 mL crystalloid, then use ephedrine 5–10 mg IV for bradycardic hypotension or phenylephrine 50–100 mcg IV for tachycardic hypotension; escalate to a norepinephrine infusion if recurrent or refractory.",
    "educationalObjective": "Manage hypotension and bradycardia during propofol or dexmedetomidine sedation with fluids and vasoactive agents."
  },
  {
    "id": "Core.3.4.8",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "Procedural sedation and MAC",
    "difficulty": "medium",
    "questionText": "A 62-year-old man (BMI 34) is undergoing screening colonoscopy under MAC with propofol boluses and fentanyl 50 mcg given 10 minutes ago. He is on a nasal cannula with sidestream capnography at 3 L/min. He becomes progressively more somnolent and begins to snore. The capnogram shows an obstructive pattern with prolonged expiratory upsloping, a respiratory rate of 6/min, and rising $ETCO_2$ from 40 to 56 mm Hg; intermittent hypopneic breaths are followed by 10–12 seconds of near-apnea. $SpO_2$ remains 98%.\n\nWhich is the most appropriate next step to prevent hypoxemia and correct the underlying problem?",
    "answers": [
      {
        "text": "Perform a jaw-thrust and insert a nasopharyngeal airway to relieve obstruction; reassess the capnogram and ventilation",
        "isCorrect": true,
        "explanation": "Capnography indicates obstructive hypoventilation before desaturation. Immediate airway-opening maneuvers (jaw thrust, NPA) address the cause and often restore adequate ventilation without waiting for $SpO_2$ to fall."
      },
      {
        "text": "Switch to a nonrebreather mask without capnography to improve oxygenation",
        "isCorrect": false,
        "explanation": "Abandoning capnography removes the earliest warning of hypoventilation and does not correct ventilatory failure."
      },
      {
        "text": "Give naloxone 0.4 mg IV to reverse opioid-induced respiratory depression",
        "isCorrect": false,
        "explanation": "Opioid reversal is not the first-line response to early obstructive hypoventilation and this dose risks acute pain and hypertension; address the airway first and titrate reversal only if needed."
      },
      {
        "text": "Administer a propofol bolus to deepen sedation and improve procedural tolerance",
        "isCorrect": false,
        "explanation": "Deeper sedation will worsen upper-airway obstruction and central respiratory depression, increasing risk of apnea and hypoxemia."
      },
      {
        "text": "Increase nasal cannula flow to 6 L/min and continue to monitor the pulse oximeter",
        "isCorrect": false,
        "explanation": "This treats oxygenation, not ventilation. Higher $FiO_2$ may delay desaturation and dilute sampled $CO_2$, masking worsening hypoventilation."
      }
    ],
    "didactic": "Capnography detects hypoventilation and airway obstruction earlier than oximetry because $SpO_2$ can remain normal for 30–90 seconds on supplemental oxygen despite absent ventilation. An obstructive capnogram (prolonged expiratory upsloping, rising $ETCO_2$, bradypnea) during MAC sedation typically reflects upper-airway collapse from sedative–opioid synergy. First-line management is airway opening: head tilt–chin lift, jaw thrust, optimize head/neck position, and place an oral or nasopharyngeal airway. Reduce or pause sedatives and provide verbal/tactile stimulation to increase respiratory drive.\n\nPractical tips:\n- Keep capnography in place; it guides response in real time. High O2 flows can dilute sampled $CO_2$ and delay desaturation without fixing ventilation.\n- If apnea or inadequate ventilation persists (e.g., absent waveform or tidal $ETCO_2$ for >15–20 s), escalate to assisted bag-mask ventilation with 100% O2 and call for help.\n- Normal $ETCO_2$ is ~35–45 mm Hg; a trend upward with falling rate during sedation should prompt early maneuvers before hypoxemia develops.",
    "educationalObjective": "Prevent hypoventilation with capnography and early airway maneuvers; escalate to bag-mask ventilation when needed."
  },
  {
    "id": "Core.3.4.9",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "Procedural sedation and MAC",
    "difficulty": "hard",
    "questionText": "A 58-year-old man (BMI 40) with poorly controlled diabetes, symptomatic GERD, and suspected gastroparesis presents for urgent ERCP for ascending cholangitis after only 4 hours NPO. In the endoscopy suite under MAC with a propofol infusion (120 mcg/kg/min) and supplemental O2 via nasal cannula, he becomes progressively more difficult to ventilate in the prone/semi-prone position. He suddenly coughs and retches; copious bilious secretions flood the oropharynx. Capnography becomes erratic, then absent; $SpO_2$ falls from 100% to 86% despite jaw thrust, an oral airway, and aggressive suctioning. The endoscopist requests “a little more propofol to finish.”\n\nWhich is the most appropriate next step?",
    "answers": [
      {
        "text": "Give ondansetron and glycopyrrolate, suction thoroughly, and resume MAC",
        "isCorrect": false,
        "explanation": "Antiemetics and antisialagogues do not treat established regurgitation or protect the airway. Continuing MAC in the face of aspiration risk and hypoxemia is inappropriate."
      },
      {
        "text": "Abort the procedure and perform rapid-sequence induction with endotracheal intubation to secure the airway",
        "isCorrect": true,
        "explanation": "Persistent airway obstruction with active regurgitation and hypoxemia despite adjuncts mandates conversion to GA with a cuffed ETT for airway protection. Stop the procedure, suction, reposition as feasible, and RSI to secure the airway before proceeding."
      },
      {
        "text": "Apply CPAP via face mask in the prone position and allow the endoscopist to complete quickly",
        "isCorrect": false,
        "explanation": "Noninvasive positive pressure in an actively regurgitating patient can insufflate the stomach and worsen aspiration; it does not protect the airway. Continuing the procedure prioritizes expediency over safety."
      },
      {
        "text": "Administer additional propofol and continue the ERCP",
        "isCorrect": false,
        "explanation": "Deepening sedation may suppress cough but risks apnea and loss of airway reflexes, worsening obstruction and aspiration. Continuing the procedure with ongoing regurgitation and desaturation is unsafe."
      },
      {
        "text": "Place a supraglottic airway and proceed with the endoscope in place",
        "isCorrect": false,
        "explanation": "An LMA does not protect against aspiration and may be incompatible with duodenoscope passage. With active regurgitation and failed basic maneuvers, definitive airway protection is required."
      }
    ],
    "didactic": "In procedural sedation/MAC, the threshold to abort or convert to GA is crossed when there is persistent airway obstruction, active regurgitation/aspiration, or inadequate conditions despite appropriate adjuncts. High-risk features here include obesity, symptomatic GERD, suspected gastroparesis, urgent timing (limited fasting), and an upper GI procedure in the prone/semi-prone position. Key priorities are: stop the procedure, call for help, suction aggressively, place the patient head-down/lateral if feasible, and secure a definitive airway with RSI and a cuffed ETT; if turning supine is unsafe or impossible, be prepared to intubate prone with assistance. Supraglottic airways do not protect against aspiration, and escalating sedatives to suppress gag/cough removes protective reflexes and can precipitate complete obstruction. Noninvasive positive pressure risks gastric insufflation and increased aspiration when emesis is present. Practical tip: establish a clear conversion plan before high-risk endoscopy (backup equipment, help pathway, and criteria to intubate) and consider upfront GA with ETT in full-stomach or ERCP patients with multiple aspiration risk factors.",
    "educationalObjective": "Recognize when to abort or convert to GA for persistent airway obstruction, aspiration, or inadequate conditions."
  },
  {
    "id": "Core.3.4.10",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "Procedural sedation and MAC",
    "difficulty": "medium",
    "questionText": "A 62-year-old man (BMI 39) with severe OSA (AHI 42) uses home CPAP at 10 cm H2O. He presents for ambulatory ankle arthroscopy under MAC with a popliteal sciatic nerve block. Sedation is started with a propofol infusion at 50 mcg/kg/min after fentanyl 100 mcg and midazolam 1 mg; he breathes spontaneously via nasal cannula at 4 L/min in the supine position. Twenty minutes later, he is snoring with intermittent obstruction; capnography shows hypoventilation with absent ETCO2 during apneic spells, and SpO2 drifts from 97% to 90–92% despite jaw thrust. Blood pressure is 132/78 mm Hg and HR 74/min; the surgeon reports adequate surgical anesthesia from the block.\n\nWhich of the following intra- and postoperative strategies is MOST appropriate to reduce respiratory complications while maintaining patient comfort in this ambulatory OSA patient?",
    "answers": [
      {
        "text": "Place a nasopharyngeal airway and continue the current propofol infusion; avoid dexmedetomidine due to the risk of bradycardia in obesity.",
        "isCorrect": false,
        "explanation": "An airway adjunct may temporize obstruction but does not address sedative/opioid-driven hypoventilation or postoperative risk; obesity alone is not a contraindication to carefully titrated dexmedetomidine."
      },
      {
        "text": "Administer midazolam 2 mg for anxiolysis, maintain supine positioning, and avoid CPAP in PACU due to aspiration risk.",
        "isCorrect": false,
        "explanation": "Benzodiazepines exacerbate upper-airway collapsibility in OSA, and avoiding CPAP postoperatively is inappropriate once the patient is awake and cooperative; CPAP reduces recurrent obstruction."
      },
      {
        "text": "Increase the propofol infusion and give additional fentanyl to suppress movement, with routine discharge once Aldrete criteria are met.",
        "isCorrect": false,
        "explanation": "Escalating propofol plus opioid deepens ventilatory depression and worsens OSA-related obstruction; routine discharge may miss delayed hypoventilation after sedatives/opioids in high-risk patients."
      },
      {
        "text": "Start a low-dose dexmedetomidine infusion, avoid further opioids, place the patient in a head-elevated ramped position, and resume home CPAP with extended oximetry in PACU.",
        "isCorrect": true,
        "explanation": "Dexmedetomidine provides cooperative sedation with minimal respiratory depression; head-elevated ramping reduces pharyngeal collapsibility; avoiding opioids is reasonable given effective regional anesthesia; and resuming CPAP with extended observation mitigates delayed postoperative obstruction in OSA."
      },
      {
        "text": "Convert to general anesthesia with a supraglottic airway, give hydromorphone for postoperative analgesia, and plan same-day discharge when awake.",
        "isCorrect": false,
        "explanation": "General anesthesia and postoperative opioids increase respiratory risk in OSA and are unnecessary given a functioning nerve block; this plan also lacks enhanced postoperative monitoring."
      }
    ],
    "didactic": "Key strategies for MAC in OSA focus on minimizing respiratory depressants, optimizing airway patency, and planning postoperative monitoring. Prefer opioid-sparing techniques (regional/local anesthesia, acetaminophen, NSAIDs) and sedatives with less ventilatory depression (dexmedetomidine, low-dose ketamine) over combinations of propofol plus opioids/benzodiazepines. Positional maneuvers—head-elevated ramping and lateral positioning when feasible—reduce pharyngeal collapsibility and improve functional residual capacity. Continuous capnography is essential during moderate-to-deep sedation, and supplemental oxygen (e.g., nasal cannula or HFNC) should be titrated to maintain adequate $FiO_2$ without masking hypoventilation. In PACU, resume the patient’s CPAP as soon as awake and cooperative, monitor with pulse oximetry for an extended period, and avoid additional opioids if regional analgesia is effective. Discharge should follow institutional OSA pathways ensuring sustained airway patency and ventilation without stimulation or recent sedatives/opioids.",
    "educationalObjective": "Tailor MAC for OSA by minimizing opioids, using positional strategies, and planning postoperative observation."
  },
  {
    "id": "Core.3.4.11",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "Procedural sedation and MAC",
    "difficulty": "easy",
    "questionText": "A 52-year-old man presents for screening colonoscopy with monitored anesthesia care. After receiving midazolam 2 mg IV and fentanyl 50 mcg IV, he becomes acutely agitated and disinhibited—pulling at monitors and shouting—despite intact airway, respiratory rate 16, oxygen saturation 98% on 3 L/min nasal cannula, heart rate 110 bpm, and blood pressure 148/86 mm Hg. He has no seizure history, does not take benzodiazepines, and staff attempts at verbal reorientation and reducing ambient stimulation have not improved his agitation. The endoscopist wants to proceed. Which is the most appropriate next step to manage this paradoxical reaction?\n",
    "answers": [
      {
        "text": "Administer additional midazolam 1 mg IV to deepen sedation",
        "isCorrect": false,
        "explanation": "Giving more benzodiazepine often worsens paradoxical agitation and increases risk of respiratory depression; it treats the symptom with more of the offending agent."
      },
      {
        "text": "Administer ketamine 0.5 mg/kg IV to control agitation",
        "isCorrect": false,
        "explanation": "Ketamine may temporize agitation but introduces additional psychomimetic and hemodynamic effects; reversal of the provoking drug is safer and more targeted."
      },
      {
        "text": "Administer flumazenil 0.2 mg IV and repeat every 60 seconds to a maximum of 1 mg if needed",
        "isCorrect": true,
        "explanation": "This is a benzodiazepine-induced paradoxical reaction; flumazenil rapidly reverses midazolam in benzodiazepine-naïve patients. Titrate in small increments and monitor for resedation due to flumazenil’s shorter half-life."
      },
      {
        "text": "Apply physical restraints and proceed without further medication changes",
        "isCorrect": false,
        "explanation": "Restraints do not treat the underlying problem and increase risk of injury and aspiration; pharmacologic reversal is preferred when a specific antagonist exists."
      },
      {
        "text": "Administer fentanyl 50 mcg IV to facilitate the procedure",
        "isCorrect": false,
        "explanation": "Opioids will not reverse benzodiazepine disinhibition and add synergistic respiratory depression without addressing the cause of agitation."
      }
    ],
    "didactic": "Paradoxical reactions to benzodiazepines present with agitation, disinhibition, and autonomic activation and are more common in extremes of age, baseline anxiety, and after higher or rapid dosing. First de-escalate by reducing stimulation, reorienting, and pausing the procedure; if ineffective and the patient is benzodiazepine-naïve without seizure risk, administer flumazenil. Practical dosing: 0.2 mg IV over 15 seconds, then 0.1–0.2 mg every 60 seconds to a usual total of 0.6–1 mg; monitor for resedation because flumazenil’s effect is shorter than midazolam’s. Avoid flumazenil in chronic benzodiazepine users, those with seizure disorders, or suspected tricyclic antidepressant co-ingestion due to withdrawal and seizure risk. If reversal is contraindicated, consider switching to a different sedative (e.g., carefully titrated propofol or dexmedetomidine) with airway readiness rather than escalating benzodiazepines or opioids. Always reassess readiness to proceed—if agitation persists despite appropriate measures, delay or convert to a safer anesthetic plan.",
    "educationalObjective": "Treat paradoxical reactions to benzodiazepines with de-escalation and flumazenil when appropriate."
  },
  {
    "id": "Core.3.4.12",
    "category": "Ambulatory, Procedural & Remote",
    "subcategory": "Procedural sedation and MAC",
    "difficulty": "hard",
    "questionText": "A 58-year-old man (BMI 46 kg/m^2) with severe OSA presents for prone ERCP under deep sedation (MAC). Baseline SpO2 is 98% on room air. You anticipate limited face-mask access once the endoscope is inserted and are concerned about hypoventilation and apnea after propofol. You want to maximize the safe apnea time if ventilation becomes inadequate during the procedure.\n\nWhich oxygenation strategy before and during sedation best extends the safe apnea time in this patient?\n",
    "answers": [
      {
        "text": "Provide face-mask preoxygenation with 5 cm H2O PEEP, then switch to room air once the scope is in place to reduce fire risk",
        "isCorrect": false,
        "explanation": "PEEP during preoxygenation increases FRC, but stopping oxygen eliminates apneic oxygenation when it’s most needed. Fire risk mitigation should not include removing supplemental O2 entirely in a high-risk airway scenario unless absolutely necessary."
      },
      {
        "text": "Place nasal CPAP at 8 cm H2O using room air during the procedure to maintain airway patency without supplemental oxygen",
        "isCorrect": false,
        "explanation": "Positive pressure may splint the airway but provides no increased O2 reservoir or apneic oxygenation when using room air. Hypoxemia risk remains high during apnea in an obese, OSA patient."
      },
      {
        "text": "Initiate heated, humidified high-flow nasal oxygen at 50–60 L/min with 100% O2 before sedation to denitrogenate and continue it throughout the procedure for apneic oxygenation",
        "isCorrect": true,
        "explanation": "High-flow nasal oxygen provides ongoing apneic oxygenation, mild PEEP, and upper-airway dead-space washout, which is critical when face-mask access is limited. Preprocedure denitrogenation plus continuous high-flow delivery prolongs time to desaturation in high-risk patients (obesity/OSA) despite apnea."
      },
      {
        "text": "Use standard nasal cannula at 2–4 L/min started after propofol administration",
        "isCorrect": false,
        "explanation": "Low-flow cannula can provide some apneic oxygenation but is often insufficient in severe obesity/OSA. Delayed initiation (after sedation) forfeits denitrogenation and offers inadequate flow to meaningfully extend safe apnea time."
      },
      {
        "text": "Preoxygenate for 3 minutes with a nonrebreather mask at 15 L/min, then remove the mask for the endoscope and place no supplemental oxygen",
        "isCorrect": false,
        "explanation": "Preoxygenation alone increases O2 stores but offers no ongoing apneic oxygenation once the mask is removed. In an obese, OSA patient with reduced FRC, desaturation may occur quickly without continuous oxygen delivery."
      }
    ],
    "didactic": "Safe apnea time is largely determined by O2 stores and ongoing delivery versus metabolic consumption. Approximate O2 stores equal FRC × $FiO_2$; in obesity, reduced FRC shortens safe apnea time even after preoxygenation. High-flow nasal oxygen (40–70 L/min) started before sedation improves denitrogenation, provides continuous apneic oxygenation when ventilation ceases, generates mild PEEP (increasing end-expiratory lung volume), and washes out upper-airway dead space. CO2 still rises during apneic oxygenation (ventilation is not restored), so continuous monitoring and airway maneuvers (jaw thrust, oral/nasal airway) to maintain patency remain essential. Practical tips: elevate the head during preoxygenation, start HFNO early at 100% O2, keep it running throughout the case, and ensure a patent upper airway to enable effective O2 diffusion. In high-risk settings with limited airway access (e.g., ERCP), HFNO significantly reduces desaturation events compared with low-flow cannula or preoxygenation alone.",
    "educationalObjective": "Use high-flow nasal oxygen or apneic oxygenation in high-risk patients to extend safe apnea time."
  }
]